/******************************************************************************
* Copyright (c) 2023 FELICITYSOLAR Corporation, All Rights Reserved
*
* Original Author:  Ivan
* Last rev by:      Ivan
* Last rev date:    2023.12.13
* Last change list:
*
* Overview:
* Description:
* NOTE:
*******************************************************************************/
#ifndef MonitorProtocol_C
#define MonitorProtocol_C
//-----------------------------------------------------------------------------
// Include
//-----------------------------------------------------------------------------
#include "GlobalHeadFile.h"

//-----------------------------------------------------------------------------
// Adding Constants and Macro Definitions
//-----------------------------------------------------------------------------

//----------------------------------------------------------------------------
//Adding Private Enumerated and Structure Definitions
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
//Adding Public Enumerated and Structure Definitions Stuff
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
//Adding Public Function Prototypes
//-----------------------------------------------------------------------------
void MonitorProtocol_Task_1ms(void) ;
void MonitorProtocol_Task_5ms(void) ;
void MonitorProtocol_Task_20ms(void);
void MonitorProtocol_Task_100ms(void);

//-----------------------------------------------------------------------------
//Adding Private Function Prototypes (i.e. static)
//-----------------------------------------------------------------------------

void SciProtocol_RenewTxBuffer(Uint16,Uint16,Uint16);
void SciProtocol_CrcCheck(void);
Uint16 Sci_CrcCaculate(Uint16 *DataFirstAddPtr,Uint16 uiDataLength);

void MonitorProtocol_AnologUpdate(void);
void MonitorProtocol_AlarmRenew(void);
//-----------------------------------------------------------------------------
//Adding Private Variables (i.e. static)
//-----------------------------------------------------------------------------
Union_Fault             unFaultFlag;                           //故障量
Uint16 	         		uiSciAnalogDataBag[eAnalogDataEnd + 1];//模拟量
Uint16                  uiSciAnalogInforDataBag[eAnalogInforDataEnd +1];//模拟量（系统信息）

Uint16           		uiSciSetDataBag[eSetDataEndAdd + 1];   //设置量
Uint16	         		uiSciCommandDataBag[eCommandIDEnd + 1];//控制量
Uint16                  uiSciCommand_BMSDataBag[eCommand_BMSIDEnd + 1];//控制量

Uint16                  uiFaultCode;//故障码
Uint16                  uiWarnCode;//告警码
Uint16                  uiGridFaultCode;

//------------------------------------------------------------------------------
//注：如实际应用为有符号的负数，则需先转成无符号型再填入下表中，如：-1为65535，-10为65526；
const Uint16 uiSetDataRange[eSetDataEndAdd + 1][eSetDataRangeEnd] = {
        //  MIN     MAX     系数                  中文名称
        {   1   ,   10  ,   1   }   ,// 0   机器地址设置
        {   0   ,   1   ,   0   }   ,// 1   Dsp并机使能
        {   0   ,   1   ,   0   }   ,// 2   主从机设置
        {   0   ,   65535   ,   1   }   ,// 3   Eeprom自动写入
        {   0   ,   65535   ,   0   }   ,// 4   预留
        {   0   ,   65535   ,   0   }   ,// 5   预留
        {   0   ,   65535   ,   0   }   ,// 6   预留
        {   0   ,   65535   ,   0   }   ,// 7   预留
        {   0   ,   65535   ,   0   }   ,// 8   预留
        {   0   ,   65535   ,   0   }   ,// 9   预留
        {   0   ,   500 ,   250 }   ,// 10  PV1启动电压
        {   0   ,   500 ,   250 }   ,// 11  PV2启动电压
        {   0   ,   500 ,   250 }   ,// 12  PV3启动电压
        {   0   ,   500 ,   250 }   ,// 13  PV4启动电压
        {   0   ,   1   ,   0   }   ,// 14  PV_AFCI检测使能
        {   0   ,   65535   ,   0   }   ,// 15  预留
        {   0   ,   65535   ,   0   }   ,// 16  预留
        {   0   ,   5   ,   1   }   ,// 17  电池类型
        {   4   ,   20  ,   10  }   ,// 18  电池1节数
        {   4   ,   20  ,   10  }   ,// 19  电池2节数
        {   0   ,   1   ,   0   }   ,// 20  电池AFCI检测使能
        {   0   ,   3   ,   0   }   ,// 21  电池模式
        {   0   ,   500 ,   100 }   ,// 22  电池1容量
        {   0   ,   550 ,   500 }   ,// 23  电池1最大充电电流限幅值
        {   0   ,   550 ,   500 }   ,// 24  电池1最大放电电流限幅值
        {   0   ,   1   ,   0   }   ,// 25  电池1激活使能
        {   0   ,   1   ,   0   }   ,// 26  BMS通讯故障使能
        {   0   ,   1   ,   0   }   ,// 27  电池并联使能
        {   0   ,   500 ,   100 }   ,// 28  电池2容量
        {   0   ,   550 ,   500 }   ,// 29  电池2最大充电电流限幅值
        {   0   ,   550 ,   500 }   ,// 30  电池2最大放电电流限幅值
        {   0   ,   1   ,   0   }   ,// 31  电池2激活使能
        {   0   ,   100 ,   30  }   ,// 32  并网时电池自动启动充电SOC点
        {   0   ,   100 ,   40  }   ,// 33  并网时电池自动退出充电SOC点
        {   0   ,   100 ,   30  }   ,// 34  并油机时电池自动启动充电SOC点
        {   0   ,   100 ,   40  }   ,// 35  并油机时电池自动退出充电SOC点
        {   0   ,   550 ,   250 }   ,// 36  电网给电池充电电流
        {   0   ,   550 ,   250 }   ,// 37  油机给电池充电电流
        {   0   ,   1   ,   0   }   ,// 38  油机启动信号
        {   0   ,   1   ,   1   }   ,// 39  电网充电总使能
        {   0   ,   1   ,   1   }   ,// 40  油机充电总使能
        {   0   ,   240 ,   240 }   ,// 41  油机最大运行时间
        {   1500    ,   8000    ,   4200    }   ,// 42  并网时电池1自动启动充电电压点
        {   1500    ,   8000    ,   4600    }   ,// 43  并网时电池1自动退出充电电压点
        {   1500    ,   8000    ,   4200    }   ,// 44  并油机时电池1自动启动充电电压点
        {   1500    ,   8000    ,   4600    }   ,// 45  并油机时电池1自动退出充电电压点
        {   1500    ,   8000    ,   4200    }   ,// 46  并网时电池2自动启动充电电压点
        {   1500    ,   8000    ,   4600    }   ,// 47  并网时电池2自动退出充电电压点
        {   1500    ,   8000    ,   4200    }   ,// 48  并油机时电池2自动启动充电电压点
        {   1500    ,   8000    ,   4600    }   ,// 49  并油机时电池2自动退出充电电压点
        {   0   ,   20  ,   1   }               ,// 50  锂电BMS协议
        {   1500    ,   8000    ,   5440    }   ,// 51  电池1恒压充电压
        {   1500    ,   8000    ,   5400    }   ,// 52  电池1浮充电压
        {   1500    ,   8000    ,   5440    }   ,// 53  电池2恒压充电压
        {   1500    ,   8000    ,   5400    }   ,// 54  电池2浮充电压
        {   1500    ,   8000    ,   5120    }   ,// 55  电池1重启AC输出电压点
        {   1500    ,   8000    ,   5120    }   ,// 56  电池1低压告警电压点
        {   1500    ,   8000    ,   4600    }   ,// 57  电池1低压关机电压点
        {   0   ,   100 ,   40  }               ,// 58  电池重启AC输出SOC点
        {   0   ,   100 ,   20  }               ,// 59  电池低压告警SOC点
        {   0   ,   100 ,   10  }               ,// 60  电池低压关机SOC点
        {   1500    ,   8000    ,   5120    }   ,// 61  电池2重启AC输出电压点
        {   1500    ,   8000    ,   5120    }   ,// 62  电池2低压告警电压点
        {   1500    ,   8000    ,   4600    }   ,// 63  电池2低压关机电压点
        {   0   ,   16  ,   2   }   ,// 64  并网法规设置
        {   3800,   4000,   4000}   ,// 65  额定输出电压
        {   0   ,   1   ,   0   }   ,// 66  额定输出频率
        {   0   ,   500 ,   500 }   ,// 67  机器额定容量
        {   0   ,   3   ,   0   }   ,// 68  工作模式
        {   0   ,   1   ,   0   }   ,// 69  防逆流 to Load卖电使能
        {   0   ,   1   ,   0   }   ,// 70  防逆流 to CT   卖电使能
        {   0   ,   550 ,   500 }   ,// 71  电网最大卖电功率
        {   0   ,   1   ,   0   }   ,// 72  电网最大输入功率限制使能
        {   0   ,   550 ,   500 }   ,// 73  电网最大输入功率
        {   60536,  5000,   0   }   ,// 74  防逆流功率回差
        {   0   ,   1   ,   0   }   ,// 75  调度模式使能
        {   64986,  550 ,   0   }   ,// 76  调度模式有功功率给定
        {   0   ,   1   ,   0   }   ,// 77  能量优先级
        {   0   ,   5   ,   0   }   ,// 78  无功控制模式
        {   65286   ,   250 ,   0   }   ,// 79  无功功率给定
        {   65436   ,   100 ,   100 }   ,// 80  功率因数给定
        {   1   ,   50000   ,   100 }   ,// 81  有功功率变化率
        {   1   ,   50000   ,   100 }   ,// 82  无功功率变化率
        {   1   ,   50000   ,   100 }   ,// 83  开机斜率
        {   1   ,   50000   ,   100 }   ,// 84  关机斜率
        {   1   ,   600 ,   30  }   ,// 85  并网等待时间
        {   0   ,   1   ,   0   }   ,// 86  DRM使能
        {   0   ,   10000,  2000}   ,// 87  CT变比设置
        {   0   ,   1   ,   1   }   ,// 88  漏电流GFCI保护使能
        {   0   ,   1000,   1 }   ,// 89  漏电流GFCI保护阀值
        {   0   ,   1   ,   1   }   ,// 90  绝缘阻抗检测使能
        {   0   ,   2000,   33  }   ,// 91  绝缘阻抗检测阀值
        {   0   ,   1   ,   0   }   ,// 92  主动孤岛保护使能
        {   65516,  20  ,   0   }   ,// 93  离网电压补偿
        {   0   ,   1   ,   0   }   ,// 94  不对称相馈电使能
        {   0   ,   1   ,   0   }   ,// 95  黑启动使能
        {   0   ,   1   ,   0   }   ,// 96  系统N线接入
        {   0   ,   1   ,   0   }   ,// 97  负载继电器断开控制
        {   0   ,   1   ,   0   }   ,// 98  旁路供电使能
        {   0   ,   1   ,   0   }   ,// 99  离网N_Groud使能
        {   0   ,   1   ,   0   }   ,// 100 微网模式使能
        {   0   ,   65535   ,   0   }   ,// 101 预留
        {   0   ,   65535   ,   0   }   ,// 102 预留
        {   0   ,   65535   ,   0   }   ,// 103 预留
        {   0   ,   65535   ,   0   }   ,// 104 预留
        {   0   ,   65535   ,   0   }   ,// 105 预留
        {   0   ,   1   ,   0   }   ,// 106 F(P)功频响应模式使能
        {   0   ,   1   ,   0   }   ,// 107 F(P)功频出力变化基准
        {   1   ,   50000   ,   1000    }   ,// 108 F(P)功频响应速率
        {   0   ,   2000    ,   0   }   ,// 109 F(P)功频响应延时
        {   1   ,   50000   ,   1000    }   ,// 110 F(P)功频退出速率
        {   0   ,   2000    ,   0   }   ,// 111 F(P)功频退出延时
        {   0   ,   100 ,   40  }   ,// 112 F(P)过频降额系数
        {   5000    ,   6500    ,   5020    }   ,// 113 F(P)过频降额起点
        {   5000    ,   6500    ,   5120    }   ,// 114 F(P)过频降额终点
        {   5000    ,   6500    ,   5010    }   ,// 115 F(P)过频降额退出点
        {   0   ,   110 ,   100 }   ,// 116 F(P)过频降额限值
        {   65436   ,   100 ,   40  }   ,// 117 F(P)欠频升额系数
        {   4500    ,   6000    ,   4980    }   ,// 118 F(P)欠频升额起点
        {   4500    ,   6000    ,   4880    }   ,// 119 F(P)欠频升额终点
        {   4500    ,   6000    ,   4990    }   ,// 120 F(P)欠频升额退出点
        {   0   ,   110 ,   100 }   ,// 121 F(P)欠频升额限值
        {   0   ,   1   ,   0   }   ,// 122 U(Q)工作模式
        {   100 ,   110 ,   108 }   ,// 123 U(Q)电压上升起点
        {   100 ,   110 ,   110 }   ,// 124 U(Q)电压上升终点
        {   65436   ,   100 ,   0   }   ,// 125 U(Q)无功上升起点
        {   0   ,   100 ,   50  }   ,// 126 U(Q)无功上升终点
        {   90  ,   100 ,   92  }   ,// 127 U(Q)电压下降起点
        {   90  ,   100 ,   90  }   ,// 128 U(Q)电压下降终点
        {   65436   ,   100 ,   0   }   ,// 129 U(Q)无功下降起点
        {   65436   ,   0   ,   65486   }   ,// 130 U(Q)无功下降终点
        {   65436   ,   100 ,   20  }   ,// 131 U(Q)无功PLock_IN
        {   65436   ,   100 ,   5   }   ,// 132 U(Q)无功PLock_OUT
        {   0   ,   1   ,   0   }   ,// 133 U(P)过压降额模式使能
        {   100 ,   140 ,   108 }   ,// 134 U(P)过压降额电压点A
        {   100 ,   140 ,   110 }   ,// 135 U(P)过压降额电压点B
        {   100 ,   140 ,   112 }   ,// 136 U(P)过压降额电压点C
        {   100 ,   140 ,   114 }   ,// 137 U(P)过压降额电压点D
        {   0   ,   110 ,   100 }   ,// 138 U(P)过压降额有功点A
        {   0   ,   110 ,   80  }   ,// 139 U(P)过压降额有功点B
        {   0   ,   110 ,   60  }   ,// 140 U(P)过压降额有功点C
        {   0   ,   110 ,   40  }   ,// 141 U(P)过压降额有功点D
        {   1   ,   50000   ,   10  }   ,// 142 U(P)过压降额下降速率
        {   1   ,   50000   ,   10  }   ,// 143 U(P)过压降额恢复速率
        {   0   ,   1   ,   0   }   ,// 144 P(Q)有功无功调节模式使能
        {   0   ,   100 ,   0   }   ,// 145 P(Q)有功点A
        {   0   ,   100 ,   0   }   ,// 146 P(Q)有功点B
        {   0   ,   100 ,   0   }   ,// 147 P(Q)有功点C
        {   0   ,   100 ,   0   }   ,// 148 P(Q)有功点D
        {   65436   ,   100 ,   0   }   ,// 149 P(Q)无功点A
        {   65436   ,   100 ,   0   }   ,// 150 P(Q)无功点B
        {   65436   ,   100 ,   0   }   ,// 151 P(Q)无功点C
        {   65436   ,   100 ,   0   }   ,// 152 P(Q)无功点D
        {   0   ,   1   ,   0   }   ,// 153 P(PF)有功功因使能
        {   0   ,   100 ,   20  }   ,// 154 P(PF)有功点A
        {   0   ,   100 ,   40  }   ,// 155 P(PF)有功点B
        {   0   ,   100 ,   60  }   ,// 156 P(PF)有功点C
        {   0   ,   100 ,   80  }   ,// 157 P(PF)有功点D
        {   65436   ,   100 ,   100 }   ,// 158 P(PF)功因点A
        {   65436   ,   100 ,   100 }   ,// 159 P(PF)功因点B
        {   65436   ,   100 ,   100 }   ,// 160 P(PF)功因点C
        {   65436   ,   100 ,   100 }   ,// 161 P(PF)功因点D
        {   0   ,   100 ,   20  }   ,// 162 P(PF)有功Lock_IN
        {   0   ,   100 ,   5   }   ,// 163 P(PF)有功Lock_OUT
        {   0   ,   1   ,   0   }   ,// 164 U(PF)电压功因模式使能
        {   0   ,   120 ,   80  }   ,// 165 U(PF)电压上升起点
        {   0   ,   120 ,   100 }   ,// 166 U(PF)电压上升终点
        {   65436   ,   100 ,   100 }   ,// 167 U(PF)功因下降起点
        {   65436   ,   100 ,   50  }   ,// 168 U(PF)功因下降终点
        {   0   ,   1   ,   0   }   ,// 169 F(G)电网适应性使能
        {   4500    ,   6000    ,   4950    }   ,// 170 F(G)欠频转放电频率点
        {   0   ,   100 ,   1   }   ,// 171 F(G)欠频转放电限值
        {   5000    ,   6500    ,   5020    }   ,// 172 F(G)过频转充电频率点
        {   65436   ,   0   ,   65535   }   ,// 173 F(G)过频转充电限值
        {   0   ,   1   ,   0   }   ,// 174 微网模式
        {   0   ,   1   ,   0   }   ,// 175 微网控制方式
        {   1   ,   1000    ,   100 }   ,// 176 有功下垂系数
        {   1   ,   1000    ,   200 }   ,// 177 无功下垂系数
        {   1   ,   60000   ,   7990    }   ,// 178 阻尼系数Dp
        {   0   ,   6000    ,   1   }   ,// 179 惯性时间常数TJ
        {   0   ,   1   ,   1   }   ,// 180 一次调频使能
        {   10  ,   200 ,   33  }   ,// 181 调频频率死区值
        {   1   ,   60000   ,   500 }   ,// 182 有功调频系数Kf
        {   0   ,   100 ,   50  }   ,// 183 调频功率上限值
        {   0   ,   100 ,   50  }   ,// 184 调频功率下限值
        {   0   ,   1   ,   1   }   ,// 185 一次调压使能
        {   1   ,   500 ,   50  }   ,// 186 调压电压死区值
        {   1   ,   60000   ,   200 }   ,// 187 无功调压系数Kv
        {   0   ,   100 ,   50  }   ,// 188 调压无功上限值
        {   0   ,   100 ,   50  }   ,// 189 调压无功下限值
        {   0   ,   1   ,   0   }   ,// 190 低电压穿越使能
        {   0   ,   400 ,   150 }   ,// 191 LVRT动态无功Kf因子
        {   0   ,   1   ,   0   }   ,// 192 高电压穿越使能
        {   0   ,   400 ,   150 }   ,// 193 HVRT动态无功Kf因子
        {   5   ,   90  ,   90  }   ,// 194 LVRT电压1
        {   0   ,   65535   ,   300 }   ,// 195 LVRT_T1
        {   5   ,   90  ,   20  }   ,// 196 LVRT电压2
        {   0   ,   65535   ,   100 }   ,// 197 LVRT_T2
        {   5   ,   90  ,   20  }   ,// 198 LVRT电压3
        {   0   ,   65535   ,   100 }   ,// 199 LVRT_T3
        {   5   ,   90  ,   20  }   ,// 200 LVRT电压4
        {   0   ,   65535   ,   100 }   ,// 201 LVRT_T4
        {   5   ,   90  ,   20  }   ,// 202 LVRT电压5
        {   0   ,   65535   ,   100 }   ,// 203 LVRT_T5
        {   110 ,   140 ,   110 }   ,// 204 HVRT电压1
        {   0   ,   65535   ,   100 }   ,// 205 HVRT_T1
        {   110 ,   140 ,   130 }   ,// 206 HVRT电压2
        {   0   ,   65535   ,   50  }   ,// 207 HVRT_T2
        {   110 ,   140 ,   130 }   ,// 208 HVRT电压3
        {   0   ,   65535   ,   50  }   ,// 209 HVRT_T3
        {   110 ,   140 ,   130 }   ,// 210 HVRT电压4
        {   0   ,   65535   ,   50  }   ,// 211 HVRT_T4
        {   110 ,   140 ,   130 }   ,// 212 HVRT电压5
        {   0   ,   65535   ,   50  }   ,// 213 HVRT_T5
        {   0   ,   65535   ,   0   }   ,// 214 预留
        {   0   ,   65535   ,   0   }   ,// 215 预留
        {   0   ,   65535   ,   0   }   ,// 216 预留
        {   0   ,   65535   ,   0   }   ,// 217 预留
        {   105 ,   150 ,   115 }   ,// 218 电网过压1段(%)
        {   0   ,   65535   ,   200 }   ,// 219 电网过压1段时间(10ms)
        {   105 ,   150 ,   130 }   ,// 220 电网过压2段(%)
        {   0   ,   65535   ,   10  }   ,// 221 电网过压2段时间(10ms)
        {   105 ,   150 ,   130 }   ,// 222 电网过压3段(%)
        {   0   ,   65535   ,   10  }   ,// 223 电网过压3段时间(10ms)
        {   105 ,   150 ,   130 }   ,// 224 电网过压4段(%)
        {   0   ,   65535   ,   10  }   ,// 225 电网过压4段时间(10ms)
        {   105 ,   150 ,   130 }   ,// 226 电网过压5段(%)
        {   0   ,   65535   ,   10  }   ,// 227 电网过压5段时间(10ms)
        {   10  ,   95  ,   80  }   ,// 228 电网欠压1段(%)
        {   0   ,   65535   ,   200 }   ,// 229 电网欠压1段时间(10ms)
        {   10  ,   95  ,   50  }   ,// 230 电网欠压2段(%)
        {   0   ,   65535   ,   10  }   ,// 231 电网欠压2段时间(10ms)
        {   10  ,   95  ,   50  }   ,// 232 电网欠压3段(%)
        {   0   ,   65535   ,   10  }   ,// 233 电网欠压3段时间(10ms)
        {   10  ,   95  ,   50  }   ,// 234 电网欠压4段(%)
        {   0   ,   65535   ,   10  }   ,// 235 电网欠压4段时间(10ms)
        {   10  ,   95  ,   50  }   ,// 236 电网欠压5段(%)
        {   0   ,   65535   ,   10  }   ,// 237 电网欠压5段时间(10ms)
        {   3   ,   20  ,   5   }   ,// 238 电网电压不平衡保护值
        {   0   ,   65535   ,   3000    }   ,// 239 电网电压不平衡保护时间
        {   5000    ,   6500    ,   5050    }   ,// 240 电网过频1段(0.01Hz)
        {   0   ,   65535   ,   200 }   ,// 241 电网过频1段时间(10ms)
        {   5000    ,   6500    ,   5100    }   ,// 242 电网过频2段(0.01Hz)
        {   0   ,   65535   ,   16  }   ,// 243 电网过频2段时间(10ms)
        {   5000    ,   6500    ,   5100    }   ,// 244 电网过频3段(0.01Hz)
        {   0   ,   65535   ,   16  }   ,// 245 电网过频3段时间(10ms)
        {   5000    ,   6500    ,   5100    }   ,// 246 电网过频4段(0.01Hz)
        {   0   ,   65535   ,   16  }   ,// 247 电网过频4段时间(10ms)
        {   5000    ,   6500    ,   5100    }   ,// 248 电网过频5段(0.01Hz)
        {   0   ,   65535   ,   16  }   ,// 249 电网过频5段时间(1ms)
        {   4500    ,   6000    ,   4750    }   ,// 250 电网欠频1段(0.01Hz)
        {   0   ,   65535   ,   200 }   ,// 251 电网欠频1段时间(10ms)
        {   4500    ,   6000    ,   4700    }   ,// 252 电网欠频2段(0.01Hz)
        {   0   ,   65535   ,   16  }   ,// 253 电网欠频2段时间(10ms)
        {   4500    ,   6000    ,   4700    }   ,// 254 电网欠频3段(0.01Hz)
        {   0   ,   65535   ,   16  }   ,// 255 电网欠频3段时间(10ms)
        {   4500    ,   6000    ,   4700    }   ,// 256 电网欠频4段(0.01Hz)
        {   0   ,   65535   ,   16  }   ,// 257 电网欠频4段时间(10ms)
        {   4500    ,   6000    ,   4700    }   ,// 258 电网欠频5段(0.01Hz)
        {   0   ,   65535   ,   16  }   ,// 259 电网欠频5段时间(10ms)
        {   0   ,   65535   ,   0   }   ,// 260 预留
        {   0   ,   65535   ,   0   }   ,// 261 预留
        {   0   ,   65535   ,   0   }   ,// 262 预留
        {   0   ,   1   ,   0   }   ,// 263 经济模式使能
        {   0   ,   65535   ,   0x007F  }   ,// 264 生效星期
        {   0   ,   1   ,   0   }   ,// 265 规则1电网充电使能
        {   0   ,   1   ,   0   }   ,// 266 规则1油机充电使能
        {   0   ,   65535   ,   0x0001  }   ,// 267 规则1起始时间
        {   0   ,   65535   ,   0x173B  }   ,// 268 规则1结束时间
        {   1500    ,   7500    ,   5000    }   ,// 269 规则1目标电压
        {   0   ,   100 ,   50  }   ,// 270 规则1目标SOC（BMS连接采用）
        {   0   ,   5000    ,   250 }   ,// 271 规则1放电功率
        {   0   ,   1   ,   0   }   ,// 272 规则2电网充电使能
        {   0   ,   1   ,   0   }   ,// 273 规则2油机充电使能
        {   0   ,   65535   ,   0x0001  }   ,// 274 规则2起始时间
        {   0   ,   65535   ,   0x173B  }   ,// 275 规则2结束时间
        {   1500    ,   7500    ,   5000    }   ,// 276 规则2目标电压
        {   0   ,   100 ,   50  }   ,// 277 规则2目标SOC（BMS连接采用）
        {   0   ,   5000    ,   250 }   ,// 278 规则2放电功率
        {   0   ,   1   ,   0   }   ,// 279 规则3电网充电使能
        {   0   ,   1   ,   0   }   ,// 280 规则3油机充电使能
        {   0   ,   65535   ,   0x0001  }   ,// 281 规则3起始时间
        {   0   ,   65535   ,   0x173B  }   ,// 282 规则3结束时间
        {   1500    ,   7500    ,   5000    }   ,// 283 规则3目标电压
        {   0   ,   100 ,   50  }   ,// 284 规则3目标SOC（BMS连接采用）
        {   0   ,   5000    ,   250 }   ,// 285 规则3放电功率
        {   0   ,   1   ,   0   }   ,// 286 规则4电网充电使能
        {   0   ,   1   ,   0   }   ,// 287 规则4油机充电使能
        {   0   ,   65535   ,   0x0001  }   ,// 288 规则4起始时间
        {   0   ,   65535   ,   0x173B  }   ,// 289 规则4结束时间
        {   1500    ,   7500    ,   5000    }   ,// 290 规则4目标电压
        {   0   ,   100 ,   50  }   ,// 291 规则4目标SOC（BMS连接采用）
        {   0   ,   5000    ,   250 }   ,// 292 规则4放电功率
        {   0   ,   1   ,   0   }   ,// 293 规则5电网充电使能
        {   0   ,   1   ,   0   }   ,// 294 规则5油机充电使能
        {   0   ,   65535   ,   0x0001  }   ,// 295 规则5起始时间
        {   0   ,   65535   ,   0x173B  }   ,// 296 规则5结束时间
        {   1500    ,   7500    ,   5000    }   ,// 297 规则5目标电压
        {   0   ,   100 ,   50  }   ,// 298 规则5目标SOC（BMS连接采用）
        {   0   ,   5000    ,   250 }   ,// 299 规则5放电功率
        {   0   ,   1   ,   0   }   ,// 300 规则6电网充电使能
        {   0   ,   1   ,   0   }   ,// 301 规则6油机充电使能
        {   0   ,   65535   ,   0x0001  }   ,// 302 规则6起始时间
        {   0   ,   65535   ,   0x173B  }   ,// 303 规则6结束时间
        {   1500    ,   7500    ,   5000    }   ,// 304 规则6目标电压
        {   0   ,   100 ,   50  }   ,// 305 规则6目标SOC（BMS连接采用）
        {   0   ,   5000    ,   250 }   ,// 306 规则6放电功率
        {   0   ,   65535   ,   0   }   ,// 307 预留
        {   0   ,   65535   ,   0   }   ,// 308 预留
        {   0   ,   65535   ,   0   }   ,// 309 预留
        {   0   ,   65535   ,   0   }   ,// 310 预留
        {   0   ,   2   ,   0   }   ,// 311 油机模式
        {   0   ,   5000    ,   500 }   ,// 312 油机输入额定功率
        {   0   ,   1   ,   0   }   ,// 313 油机输入功率限制使能位
        {   0   ,   1   ,   0   }   ,// 314 油机接入电网端口使能位
        {   0   ,   1   ,   0   }   ,// 315 智能负载常闭使能位
        {   1500    ,   8000    ,   5400    }   ,// 316 智能负载闭合电池电压点
        {   1500    ,   8000    ,   5000    }   ,// 317 智能负载断开电池电压点
        {   0   ,   100 ,   90  }   ,// 318 智能负载闭合电池SOC点
        {   0   ,   100 ,   80  }   ,// 319 智能负载断开电池SOC点
        {   0   ,   65535   ,   0   }   ,// 320 预留
        {   0   ,   65535   ,   0   }   ,// 321 预留
        {   0   ,   65535   ,   0   }   ,// 322 预留
        {   0   ,   65535   ,   0   }   ,// 323 预留
        {   0   ,   65535   ,   0   }   ,// 324 预留
        {   0   ,   65535   ,   0   }   ,// 325 预留
        {   0   ,   65535   ,   0   }   ,// 326 预留
        {   0   ,   65535   ,   0   }   ,// 327 预留
        {   0   ,   65535   ,   0   }   ,// 328 预留
        {   0   ,   65535   ,   0   }   ,// 329 预留
        {   105 ,   150 ,   115 }   ,// 330 油机过压1段(%)
        {   0   ,   65535,  200 }   ,// 331 油机过压1段时间(10ms)
        {   105 ,   150 ,   130 }   ,// 332 油机过压2段(%)
        {   0   ,   65535,  10  }   ,// 333 油机过压2段时间(10ms)
        {   10  ,   95  ,   80  }   ,// 334 油机欠压1段(%)
        {   0   ,   65535,  200 }   ,// 335 油机欠压1段时间(10ms)
        {   10  ,   95  ,   50  }   ,// 336 油机欠压2段(%)
        {   0   ,   65535,  10  }   ,// 337 油机欠压2段时间(10ms)
        {   5000,   6500,   5050}   ,// 338 油机过频1段(0.01Hz)
        {   0   ,   65535,  200 }   ,// 339 油机过频1段时间(10ms)
        {   5000,   6500,   5100}   ,// 340 油机过频2段(0.01Hz)
        {   0   ,   65535,  16  }   ,// 341 油机过频2段时间(10ms)
        {   4500,   6000,   4750}   ,// 342 油机欠频1段(0.01Hz)
        {   0   ,   65535,  200 }   ,// 343 油机欠频1段时间(10ms)
        {   4500,   6000,   4700}   ,// 344 油机欠频2段(0.01Hz)
        {   0   ,   65535,  16  }   ,// 345 油机欠频2段时间(10ms)
        {   0   ,   65535   ,   0   }   ,// 346 预留
        {   0   ,   65535   ,   0   }   ,// 347 预留
        {   0   ,   65535   ,   0   }   ,// 348 预留
        {   0   ,   65535   ,   0   }   ,// 349 预留
        {   0   ,   65535   ,   0   }   ,// 350 预留
        {   0   ,   65535   ,   0   }   ,// 351 预留
        {   0   ,   65535   ,   0   }   ,// 352 预留
        {   0   ,   65535   ,   0   }   ,// 353 预留
        {   0   ,   65535   ,   0   }   ,// 354 预留
        {   0   ,   65535   ,   0   }   ,// 355 预留
        {   0   ,   65535   ,   0   }   ,// 356 预留
        {   0   ,   65535   ,   0   }   ,// 357 预留
        {   0   ,   65535   ,   0   }   ,// 358 预留
        {   0   ,   65535   ,   0   }   ,// 359 预留
        {   0   ,   65535   ,   0   }   ,// 360 预留
        {   0   ,   65535   ,   0   }   ,// 361 预留
        {   0   ,   65535   ,   0   }   ,// 362 预留
        {   0   ,   65535   ,   0   }   ,// 363 预留
        {   0   ,   65535   ,   0   }   ,// 364 预留
        {   0   ,   65535   ,   0   }   ,// 365 预留
        {   1548    ,   2548    ,   2048    }   ,// 366 PV1电压校准系数
        {   0   ,   65535   ,   0   }   ,// 367 PV1电压校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 368 PV2电压校准系数
        {   0   ,   65535   ,   0   }   ,// 369 PV2电压校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 370 PV3电压校准系数
        {   0   ,   65535   ,   0   }   ,// 371 PV3电压校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 372 PV4电压校准系数
        {   0   ,   65535   ,   0   }   ,// 373 PV4电压校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 374 PV1电流校准系数
        {   0   ,   65535   ,   0   }   ,// 375 PV1电流校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 376 PV2电流校准系数
        {   0   ,   65535   ,   0   }   ,// 377 PV2电流校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 378 PV3电流校准系数
        {   0   ,   65535   ,   0   }   ,// 379 PV3电流校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 380 PV4电流校准系数
        {   0   ,   65535   ,   0   }   ,// 381 PV4电流校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 382 电池电压1校准系数
        {   0   ,   65535   ,   0   }   ,// 383 电池电压1校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 384 电池电压2校准系数
        {   0   ,   65535   ,   0   }   ,// 385 电池电压2校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 386 BAT电流1校准系数
        {   0   ,   65535   ,   0   }   ,// 387 BAT电流1校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 388 BAT电流2校准系数
        {   0   ,   65535   ,   0   }   ,// 389 BAT电流2校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 390 PBUS电压校准系数
        {   0   ,   65535   ,   0   }   ,// 391 PBUS电压校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 392 NBUS电压校准系数
        {   0   ,   65535   ,   0   }   ,// 393 NBUS电压校准偏置
        {   1548    ,   2548    ,   2048    }   ,// 394 U相油机电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 395 V相油机电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 396 W相油机电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 397 U相电网电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 398 V相电网电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 399 W相电网电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 400 A相逆变电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 401 B相逆变电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 402 C相逆变电压校准系数
        {   1548    ,   2548    ,   2048    }   ,// 403 A相逆变电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 404 B相逆变电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 405 C相逆变电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 406 U相电网电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 407 V相电网电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 408 W相电网电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 409 U相外部CT电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 410 V相外部CT电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 411 W相外部CT电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 412 R相负载电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 413 S相负载电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 414 T相负载电流校准系数
        {   1548    ,   2548    ,   2048    }   ,// 415 放电量校准高位
        {   1548    ,   2548    ,   2048    }   ,// 416 放电量校准低位
        {   1548    ,   2548    ,   2048    }   ,// 417 充电量校准高位
        {   1548    ,   2548    ,   2048    }   ,// 418 充电量校准低位
        {   0   ,   65535   ,   0   }   ,// 419 预留
        {   0   ,   65535   ,   0   }   ,// 420 预留
        {   0   ,   65535   ,   0   }   ,// 421 预留
        {   0   ,   65535   ,   0   }   ,// 422 预留
        {   0   ,   65535   ,   0   }   ,// 423 预留
        {   0   ,   65535   ,   0   }   ,// 424 预留
        {   0   ,   65535   ,   0   }   ,// 425 预留
        {   0   ,   65535   ,   0   }   ,// 426 预留
        {   0   ,   65535   ,   0   }   ,// 427 预留
        {   0   ,   65535   ,   0   }   ,// 428 预留
        {   0   ,   65535   ,   0   }   ,// 429 预留
        {   0   ,   65535   ,   0   }   ,// 430 预留
        {   0   ,   65535   ,   0   }   ,// 431 预留
        {   0   ,   65535   ,   0   }   ,// 432 预留
        {   0   ,   65535   ,   0   }   ,// 433 预留
        {   0   ,   65535   ,   0   }   ,// 434 预留
        {   0   ,   65535   ,   0   }   ,// 435 预留
        {   0   ,   65535   ,   0   }   ,// 436 预留
        {   0   ,   65535   ,   0   }   ,// 437 预留
        {   0   ,   65535   ,   0   }   ,// 438 预留
        {   0   ,   65535   ,   0   }   ,// 439 预留
        {   0   ,   65535   ,   0   }   ,// 440 预留
        {   0   ,   65535   ,   0   }   ,// 441 预留
        {   0   ,   65535   ,   0   }   ,// 442 预留
        {   0   ,   65535   ,   0   }   ,// 443 预留
        {   0   ,   65535   ,   0   }   ,// 444 预留
        {   0   ,   65535   ,   0   }   ,// 445 预留
        {   0   ,   65535   ,   0   }   ,// 446 预留
        {   0   ,   65535   ,   0   }   ,// 447 预留
        {   0   ,   65535   ,   0   }   ,// 448 预留
        {   0   ,   65535   ,   0   }   ,// 449 预留
        {   0   ,   65535   ,   0   }   ,// 450 预留
        {   0   ,   65535   ,   0   }   ,// 451 预留
        {   0   ,   65535   ,   0   }   ,// 452 预留
        {   0   ,   65535   ,   0   }   ,// 453 预留
        {   0   ,   65535   ,   0   }   ,// 454 预留
        {   0   ,   65535   ,   0   }   ,// 455 预留
        {   0   ,   65535   ,   0   }   ,// 456 预留
        {   0   ,   65535   ,   0   }   ,// 457 预留
        {   0   ,   65535   ,   0   }   ,// 458 预留
        {   0   ,   65535   ,   0   }   ,// 459 机器序列号1
        {   0   ,   65535   ,   0   }   ,// 460 机器序列号2
        {   0   ,   65535   ,   0   }   ,// 461 机器序列号3
        {   0   ,   65535   ,   0   }   ,// 462 机器序列号4
        {   0   ,   65535   ,   0   }   ,// 463 机器序列号5
        {   0   ,   65535   ,   0   }   ,// 464 机器序列号长度
        {   0   ,   65535   ,   0   }   ,// 465 ATE写显示板版本号
        {   0   ,   65535   ,   0   }   ,// 466 ATE写控制板版本号
        {   0   ,   65535   ,   0   }   ,// 467 ATE写功率板版本号
        {   0   ,   65535   ,   0   }   ,// 468 升级固件
        {   0   ,   65535   ,   0   }   ,// 469 复位重启
        {   0   ,   65535   ,   0   }   ,// 470 EE恢复默认值
        {   0   ,   65535   ,   0   }   ,// 471 老化模式
        {   0   ,   65535   ,   0   }   ,// 472 远程控制开关
        {   0   ,   65535   ,   0   }   ,// 473 EE恢复出厂设置
        {   0   ,   65535   ,   0   }   ,// 474 老化电池启动电压
        {   0   ,   65535   ,   0   }   ,// 475 老化电池放电电流
        {   0   ,   65535   ,   0   }   ,// 476 老化最大PV功率
        {   0   ,   65535   ,   0   }   ,// 477 老化最大逆变功率
        {   0   ,   65535   ,   0   }   ,// 478 MPPT电压点控制
        {   0   ,   65535   ,   0   }   ,// 479 发电量发电时间清零设置
        {   0   ,   65535   ,   0   }   ,// 480 安规设置
        {   0   ,   65535   ,   0   }   ,// 481 绝缘阻抗设置
        {   0   ,   65535   ,   0   }   ,// 482 电表协议选择
        {   0   ,   65535   ,   0   }   ,// 483 Wifi通讯地址和波特率
        {   0   ,   65535   ,   0   }   ,// 484 与电表通讯波特率和校验位
        {   0   ,   65535   ,   0   }   ,// 485 与电表通讯地址
        {   0   ,   65535   ,   0   }   ,// 486 电表使能写，禁止读
        {   0   ,   65535   ,   0   }   ,// 487 电表Modbus地址
        {   0   ,   65535   ,   0   }   ,// 488 电表数据
        {   0   ,   65535   ,   0   }   ,// 489 485通讯地址和波特率
        {   0   ,   1   ,   0   }   ,// 490 LCD背光
        {   0   ,   1   ,   0   }   ,// 491 蜂鸣器
        {   1   ,   15  ,   1   }   ,// 492 电池包地址
        {   0   ,   1   ,   0   }   ,// 493 清除事件记录
        {   0   ,   1   ,   1   }   ,// 494 事件记录功能
        {   0   ,   1   ,   1   }   ,// 495 故障记录功能
        {   0   ,   1   ,   0   }   ,// 496 Log查询类型
        {   0   ,   9   ,   0   }   ,// 497 Log索引

};

//------------------------------------------------------------------------------
//注：如实际应用为有符号的负数，则需先转成无符号型再填入下表中，如：-1为65535，-10为65526；
const Uint16 uiDefaultData[eSetDataEndAdd + 1] = {
    1   ,// 0   机器地址设置
    0   ,// 1   Dsp并机使能
    0   ,// 2   主从机设置
    1   ,// 3   Eeprom自动写入
    0   ,// 4   预留
    0   ,// 5   预留
    0   ,// 6   预留
    0   ,// 7   预留
    0   ,// 8   预留
    0   ,// 9   预留
    250 ,// 10  PV1启动电压
    250 ,// 11  PV2启动电压
    250 ,// 12  PV3启动电压
    250 ,// 13  PV4启动电压
    0   ,// 14  PV_AFCI检测使能
    0   ,// 15  预留
    0   ,// 16  预留
    1   ,// 17  电池类型
    10  ,// 18  电池1节数
    10  ,// 19  电池2节数
    0   ,// 20  电池AFCI检测使能
    0   ,// 21  电池模式
    100 ,// 22  电池1容量
    500 ,// 23  电池1最大充电电流限幅值
    500 ,// 24  电池1最大放电电流限幅值
    0   ,// 25  电池1激活使能
    0   ,// 26  BMS通讯故障使能
    0   ,// 27  电池并联使能
    100 ,// 28  电池2容量
    500 ,// 29  电池2最大充电电流限幅值
    500 ,// 30  电池2最大放电电流限幅值
    0   ,// 31  电池2激活使能
    30  ,// 32  并网时电池自动启动充电SOC点
    40  ,// 33  并网时电池自动退出充电SOC点
    30  ,// 34  并油机时电池自动启动充电SOC点
    40  ,// 35  并油机时电池自动退出充电SOC点
    250 ,// 36  电网给电池充电电流
    250 ,// 37  油机给电池充电电流
    0   ,// 38  油机启动信号
    1   ,// 39  电网充电总使能
    1   ,// 40  油机充电总使能
    240 ,// 41  油机最大运行时间
    4200,// 42  并网时电池1自动启动充电电压点
    4600,// 43  并网时电池1自动退出充电电压点
    4200,// 44  并油机时电池1自动启动充电电压点
    4600,// 45  并油机时电池1自动退出充电电压点
    4200,// 46  并网时电池2自动启动充电电压点
    4600,// 47  并网时电池2自动退出充电电压点
    4200,// 48  并油机时电池2自动启动充电电压点
    4600,// 49  并油机时电池2自动退出充电电压点
    1   ,// 50  锂电BMS协议
    5440,// 51  电池1恒压充电压
    5400,// 52  电池1浮充电压
    5440,// 53  电池2恒压充电压
    5400,// 54  电池2浮充电压
    5120,// 55  电池1重启AC输出电压点
    5120,// 56  电池1低压告警电压点
    4600,// 57  电池1低压关机电压点
    40  ,// 58  电池重启AC输出SOC点
    20  ,// 59  电池低压告警SOC点
    10  ,// 60  电池低压关机SOC点
    5120,// 61  电池2重启AC输出电压点
    5120,// 62  电池2低压告警电压点
    4600,// 63  电池2低压关机电压点
    2   ,// 64  并网法规设置
    4000    ,// 65  额定输出电压
    0   ,// 66  额定输出频率
    500 ,// 67  机器额定容量
    0   ,// 68  工作模式
    0   ,// 69  防逆流 to Load卖电使能
    0   ,// 70  防逆流 to CT   卖电使能
    500 ,// 71  电网最大卖电功率
    0   ,// 72  电网最大输入功率限制使能
    500 ,// 73  电网最大输入功率
    0   ,// 74  防逆流功率回差
    0   ,// 75  调度模式使能
    0   ,// 76  调度模式有功功率给定
    0   ,// 77  能量优先级
    0   ,// 78  无功控制模式
    0   ,// 79  无功功率给定
    100 ,// 80  功率因数给定
    100 ,// 81  有功功率变化率
    100 ,// 82  无功功率变化率
    100 ,// 83  开机斜率
    100 ,// 84  关机斜率
    30  ,// 85  并网等待时间
    0   ,// 86  DRM使能
    2000    ,// 87  CT变比设置
    1   ,// 88  漏电流GFCI保护使能
    200 ,// 89  漏电流GFCI保护阀值
    1   ,// 90  绝缘阻抗检测使能
    30  ,// 91  绝缘阻抗检测阀值
    0   ,// 92  主动孤岛保护使能
    0   ,// 93  离网电压补偿
    0   ,// 94  不对称相馈电使能
    0   ,// 95  黑启动使能
    0   ,// 96  系统N线接入
    0   ,// 97  负载继电器断开控制
    0   ,// 98  旁路供电使能
    0   ,// 99  离网N_Groud使能
    0   ,// 100 微网模式使能
    0   ,// 101 预留
    0   ,// 102 预留
    0   ,// 103 预留
    0   ,// 104 预留
    0   ,// 105 预留
    0   ,// 106 F(P)功频响应模式使能
    0   ,// 107 F(P)功频出力变化基准(暂时不使用)
    1000    ,// 108 F(P)功频响应速率
    0   ,// 109 F(P)功频响应延时
    1000    ,// 110 F(P)功频退出速率
    0   ,// 111 F(P)功频退出延时
    40  ,// 112 F(P)过频降额系数
    5020    ,// 113 F(P)过频降额起点
    5120    ,// 114 F(P)过频降额终点
    5010    ,// 115 F(P)过频降额退出点（新增）
    100 ,// 116 F(P)过频降额限值(暂时不使用)
    40  ,// 117 F(P)欠频升额系数
    4980    ,// 118 F(P)欠频升额起点
    4880    ,// 119 F(P)欠频升额终点
    4990    ,// 120 F(P)欠频升额退出点
    100 ,// 121 F(P)欠频升额限值(暂时不使用)
    0   ,// 122 U(Q)工作模式
    108 ,// 123 U(Q)电压上升起点
    110 ,// 124 U(Q)电压上升终点
    0   ,// 125 U(Q)无功上升起点
    50  ,// 126 U(Q)无功上升终点
    92  ,// 127 U(Q)电压下降起点
    90  ,// 128 U(Q)电压下降终点
    0   ,// 129 U(Q)无功下降起点
    65486,// 130 U(Q)无功下降终点
    20  ,// 131 U(Q)无功PLock_IN
    5   ,// 132 U(Q)无功PLock_OUT
    0   ,// 133 U(P)过压降额模式使能(新增)
    108 ,// 134 U(P)过压降额电压点A
    110 ,// 135 U(P)过压降额电压点B
    112 ,// 136 U(P)过压降额电压点C
    114 ,// 137 U(P)过压降额电压点D
    100 ,// 138 U(P)过压降额有功点A
    80  ,// 139 U(P)过压降额有功点B
    60  ,// 140 U(P)过压降额有功点C
    40  ,// 141 U(P)过压降额有功点D
    10  ,// 142 U(P)过压降额下降速率
    10  ,// 143 U(P)过压降额恢复速率
    0   ,// 144 P(Q)有功无功调节模式使能
    0   ,// 145 P(Q)有功点A
    0   ,// 146 P(Q)有功点B
    0   ,// 147 P(Q)有功点C
    0   ,// 148 P(Q)有功点D
    0   ,// 149 P(Q)无功点A
    0   ,// 150 P(Q)无功点B
    0   ,// 151 P(Q)无功点C
    0   ,// 152 P(Q)无功点D
    0   ,// 153 P(PF)有功功因使能
    20  ,// 154 P(PF)有功点A
    40  ,// 155 P(PF)有功点B
    60  ,// 156 P(PF)有功点C
    80  ,// 157 P(PF)有功点D
    100 ,// 158 P(PF)功因点A
    100 ,// 159 P(PF)功因点B
    100 ,// 160 P(PF)功因点C
    100 ,// 161 P(PF)功因点D
    20  ,// 162 P(PF)有功Lock_IN
    5   ,// 163 P(PF)有功Lock_OUT
    0   ,// 164 U(PF)电压功因模式使能
    80  ,// 165 U(PF)电压上升起点
    100 ,// 166 U(PF)电压上升终点
    100 ,// 167 U(PF)功因下降起点
    50  ,// 168 U(PF)功因下降终点
    0   ,// 169 F(G)电网适应性使能
    4950 ,// 170 F(G)欠频转放电频率点
    1   ,// 171 F(G)欠频转放电限值
    5020 ,// 172 F(G)过频转充电频率点
    65535   ,// 173 F(G)过频转充电限值
    0   ,// 174 微网模式
    0   ,// 175 微网控制方式
    100 ,// 176 有功下垂系数
    200 ,// 177 无功下垂系数
    7990    ,// 178 阻尼系数Dp
    1   ,// 179 惯性时间常数TJ
    1   ,// 180 一次调频使能
    33  ,// 181 调频频率死区值
    500 ,// 182 有功调频系数Kf
    50  ,// 183 调频功率上限值
    50  ,// 184 调频功率下限值
    1   ,// 185 一次调压使能
    50  ,// 186 调压电压死区值
    200 ,// 187 无功调压系数Kv
    50  ,// 188 调压无功上限值
    50  ,// 189 调压无功下限值
    0   ,// 190 低电压穿越使能
    150 ,// 191 LVRT动态无功Kf因子
    0   ,// 192 高电压穿越使能
    150 ,// 193 HVRT动态无功Kf因子
    90  ,// 194 LVRT电压1
    300 ,// 195 LVRT_T1
    20  ,// 196 LVRT电压2
    100 ,// 197 LVRT_T2
    20  ,// 198 LVRT电压3
    100 ,// 199 LVRT_T3
    20  ,// 200 LVRT电压4
    100 ,// 201 LVRT_T4
    20  ,// 202 LVRT电压5
    100 ,// 203 LVRT_T5
    110 ,// 204 HVRT电压1
    100 ,// 205 HVRT_T1
    130 ,// 206 HVRT电压2
    50  ,// 207 HVRT_T2
    130 ,// 208 HVRT电压3
    50  ,// 209 HVRT_T3
    130 ,// 210 HVRT电压4
    50  ,// 211 HVRT_T4
    130 ,// 212 HVRT电压5
    50  ,// 213 HVRT_T5
    0   ,// 214 预留
    0   ,// 215 预留
    0   ,// 216 预留
    0   ,// 217 预留
    115 ,// 218 电网过压1段(%)
    200 ,// 219 电网过压1段时间(10ms)
    130 ,// 220 电网过压2段(%)
    10  ,// 221 电网过压2段时间(10ms)
    130 ,// 222 电网过压3段(%)
    10  ,// 223 电网过压3段时间(10ms)
    130 ,// 224 电网过压4段(%)
    10  ,// 225 电网过压4段时间(10ms)
    130 ,// 226 电网过压5段(%)
    10  ,// 227 电网过压5段时间(10ms)
    80  ,// 228 电网欠压1段(%)
    200 ,// 229 电网欠压1段时间(10ms)
    50  ,// 230 电网欠压2段(%)
    10  ,// 231 电网欠压2段时间(10ms)
    50  ,// 232 电网欠压3段(%)
    10  ,// 233 电网欠压3段时间(10ms)
    50  ,// 234 电网欠压4段(%)
    10  ,// 235 电网欠压4段时间(10ms)
    50  ,// 236 电网欠压5段(%)
    10  ,// 237 电网欠压5段时间(10ms)
    5   ,// 238 电网电压不平衡保护值
    3000    ,// 239 电网电压不平衡保护时间
    5050    ,// 240 电网过频1段(0.01Hz)
    200 ,// 241 电网过频1段时间(10ms)
    5100    ,// 242 电网过频2段(0.01Hz)
    16  ,// 243 电网过频2段时间(10ms)
    5100    ,// 244 电网过频3段(0.01Hz)
    16  ,// 245 电网过频3段时间(10ms)
    5100    ,// 246 电网过频4段(0.01Hz)
    16  ,// 247 电网过频4段时间(10ms)
    5100    ,// 248 电网过频5段(0.01Hz)
    16  ,// 249 电网过频5段时间(1ms)
    4750    ,// 250 电网欠频1段(0.01Hz)
    200 ,// 251 电网欠频1段时间(10ms)
    4700    ,// 252 电网欠频2段(0.01Hz)
    16  ,// 253 电网欠频2段时间(10ms)
    4700    ,// 254 电网欠频3段(0.01Hz)
    16  ,// 255 电网欠频3段时间(10ms)
    4700    ,// 256 电网欠频4段(0.01Hz)
    16  ,// 257 电网欠频4段时间(10ms)
    4700    ,// 258 电网欠频5段(0.01Hz)
    16  ,// 259 电网欠频5段时间(10ms)
    0   ,// 260 预留
    0   ,// 261 预留
    0   ,// 262 预留
    0   ,// 263 经济模式使能
    0x007F  ,// 264 生效星期
    0   ,// 265 规则1电网充电使能
    0   ,// 266 规则1油机充电使能
    0x0001  ,// 267 规则1起始时间
    0x173B  ,// 268 规则1结束时间
    5000    ,// 269 规则1目标电压
    50  ,// 270 规则1目标SOC（BMS连接采用）
    250 ,// 271 规则1放电功率
    0   ,// 272 规则2电网充电使能
    0   ,// 273 规则2油机充电使能
    0x0001  ,// 274 规则2起始时间
    0x173B  ,// 275 规则2结束时间
    5000    ,// 276 规则2目标电压
    50  ,// 277 规则2目标SOC（BMS连接采用）
    250 ,// 278 规则2放电功率
    0   ,// 279 规则3电网充电使能
    0   ,// 280 规则3油机充电使能
    0x0001  ,// 281 规则3起始时间
    0x173B  ,// 282 规则3结束时间
    5000    ,// 283 规则3目标电压
    50  ,// 284 规则3目标SOC（BMS连接采用）
    250 ,// 285 规则3放电功率
    0   ,// 286 规则4电网充电使能
    0   ,// 287 规则4油机充电使能
    0x0001  ,// 288 规则4起始时间
    0x173B  ,// 289 规则4结束时间
    5000    ,// 290 规则4目标电压
    50  ,// 291 规则4目标SOC（BMS连接采用）
    250 ,// 292 规则4放电功率
    0   ,// 293 规则5电网充电使能
    0   ,// 294 规则5油机充电使能
    0x0001  ,// 295 规则5起始时间
    0x173B  ,// 296 规则5结束时间
    5000    ,// 297 规则5目标电压
    50  ,// 298 规则5目标SOC（BMS连接采用）
    250 ,// 299 规则5放电功率
    0   ,// 300 规则6电网充电使能
    0   ,// 301 规则6油机充电使能
    0x0001  ,// 302 规则6起始时间
    0x173B  ,// 303 规则6结束时间
    5000    ,// 304 规则6目标电压
    50  ,// 305 规则6目标SOC（BMS连接采用）
    250 ,// 306 规则6放电功率
    0   ,// 307 预留
    0   ,// 308 预留
    0   ,// 309 预留
    0   ,// 310 预留
    0   ,// 311 油机模式
    500 ,// 312 油机输入额定功率
    0   ,// 313 油机输入功率限制使能位
    0   ,// 314 油机接入电网端口使能位
    0   ,// 315 智能负载常闭使能位
    5400    ,// 316 智能负载闭合电池电压点
    5000    ,// 317 智能负载断开电池电压点
    90  ,// 318 智能负载闭合电池SOC点
    80  ,// 319 智能负载断开电池SOC点
    0   ,// 320 预留
    0   ,// 321 预留
    0   ,// 322 预留
    0   ,// 323 预留
    0   ,// 324 预留
    0   ,// 325 预留
    0   ,// 326 预留
    0   ,// 327 预留
    0   ,// 328 预留
    0   ,// 329 预留
    115 ,// 330 油机过压1段(%)
    200 ,// 331 油机过压1段时间(10ms)
    130 ,// 332 油机过压2段(%)
    10  ,// 333 油机过压2段时间(10ms)
    80  ,// 334 油机欠压1段(%)
    200 ,// 335 油机欠压1段时间(10ms)
    50  ,// 336 油机欠压2段(%)
    10  ,// 337 油机欠压2段时间(10ms)
    5050    ,// 338 油机过频1段(0.01Hz)
    200 ,// 339 油机过频1段时间(10ms)
    5100    ,// 340 油机过频2段(0.01Hz)
    16  ,// 341 油机过频2段时间(10ms)
    4750    ,// 342 油机欠频1段(0.01Hz)
    200 ,// 343 油机欠频1段时间(10ms)
    4700    ,// 344 油机欠频2段(0.01Hz)
    16  ,// 345 油机欠频2段时间(10ms)
    0   ,// 346 预留
    0   ,// 347 预留
    0   ,// 348 预留
    0   ,// 349 预留
    0   ,// 350 预留
    0   ,// 351 预留
    0   ,// 352 预留
    0   ,// 353 预留
    0   ,// 354 预留
    0   ,// 355 预留
    0   ,// 356 预留
    0   ,// 357 预留
    0   ,// 358 预留
    0   ,// 359 预留
    0   ,// 360 预留
    0   ,// 361 预留
    0   ,// 362 预留
    0   ,// 363 预留
    0   ,// 364 预留
    0   ,// 365 预留
    2048    ,// 366 PV1电压校准系数
    0   ,// 367 PV1电压校准偏置
    2048    ,// 368 PV2电压校准系数
    0   ,// 369 PV2电压校准偏置
    2048    ,// 370 PV3电压校准系数
    0   ,// 371 PV3电压校准偏置
    2048    ,// 372 PV4电压校准系数
    0   ,// 373 PV4电压校准偏置
    2048    ,// 374 PV1电流校准系数
    0   ,// 375 PV1电流校准偏置
    2048    ,// 376 PV2电流校准系数
    0   ,// 377 PV2电流校准偏置
    2048    ,// 378 PV3电流校准系数
    0   ,// 379 PV3电流校准偏置
    2048    ,// 380 PV4电流校准系数
    0   ,// 381 PV4电流校准偏置
    2048    ,// 382 电池电压1校准系数
    0   ,// 383 电池电压1校准偏置
    2048    ,// 384 电池电压2校准系数
    0   ,// 385 电池电压2校准偏置
    2048    ,// 386 BAT电流1校准系数
    0   ,// 387 BAT电流1校准偏置
    2048    ,// 388 BAT电流2校准系数
    0   ,// 389 BAT电流2校准偏置
    2048    ,// 390 PBUS电压校准系数
    0   ,// 391 PBUS电压校准偏置
    2048    ,// 392 NBUS电压校准系数
    0   ,// 393 NBUS电压校准偏置
    2048    ,// 394 U相油机电压校准系数
    2048    ,// 395 V相油机电压校准系数
    2048    ,// 396 W相油机电压校准系数
    2048    ,// 397 U相电网电压校准系数
    2048    ,// 398 V相电网电压校准系数
    2048    ,// 399 W相电网电压校准系数
    2048    ,// 400 A相逆变电压校准系数
    2048    ,// 401 B相逆变电压校准系数
    2048    ,// 402 C相逆变电压校准系数
    2048    ,// 403 A相逆变电流校准系数
    2048    ,// 404 B相逆变电流校准系数
    2048    ,// 405 C相逆变电流校准系数
    2048    ,// 406 U相电网电流校准系数
    2048    ,// 407 V相电网电流校准系数
    2048    ,// 408 W相电网电流校准系数
    2048    ,// 409 U相外部CT电流校准系数
    2048    ,// 410 V相外部CT电流校准系数
    2048    ,// 411 W相外部CT电流校准系数
    2048    ,// 412 R相负载电流校准系数
    2048    ,// 413 S相负载电流校准系数
    2048    ,// 414 T相负载电流校准系数
    2048    ,// 415 放电量校准高位
    2048    ,// 416 放电量校准低位
    2048    ,// 417 充电量校准高位
    2048    ,// 418 充电量校准低位
    0   ,// 419 预留
    0   ,// 420 预留
    0   ,// 421 预留
    0   ,// 422 预留
    0   ,// 423 预留
    0   ,// 424 预留
    0   ,// 425 预留
    0   ,// 426 预留
    0   ,// 427 预留
    0   ,// 428 预留
    0   ,// 429 预留
    0   ,// 430 预留
    0   ,// 431 预留
    0   ,// 432 预留
    0   ,// 433 预留
    0   ,// 434 预留
    0   ,// 435 预留
    0   ,// 436 预留
    0   ,// 437 预留
    0   ,// 438 预留
    0   ,// 439 预留
    0   ,// 440 预留
    0   ,// 441 预留
    0   ,// 442 预留
    0   ,// 443 预留
    0   ,// 444 预留
    0   ,// 445 预留
    0   ,// 446 预留
    0   ,// 447 预留
    0   ,// 448 预留
    0   ,// 449 预留
    0   ,// 450 预留
    0   ,// 451 预留
    0   ,// 452 预留
    0   ,// 453 预留
    0   ,// 454 预留
    0   ,// 455 预留
    0   ,// 456 预留
    0   ,// 457 预留
    0   ,// 458 预留
    0   ,// 459 机器序列号1
    0   ,// 460 机器序列号2
    0   ,// 461 机器序列号3
    0   ,// 462 机器序列号4
    0   ,// 463 机器序列号5
    0   ,// 464 机器序列号长度
    0   ,// 465 ATE写显示板版本号
    0   ,// 466 ATE写控制板版本号
    0   ,// 467 ATE写功率板版本号
    0   ,// 468 升级固件
    0   ,// 469 复位重启
    0   ,// 470 EE恢复默认值
    0   ,// 471 老化模式
    0   ,// 472 远程控制开关
    0   ,// 473 EE恢复出厂设置
    0   ,// 474 老化电池启动电压
    0   ,// 475 老化电池放电电流
    0   ,// 476 老化最大PV功率
    0   ,// 477 老化最大逆变功率
    0   ,// 478 MPPT电压点控制
    0   ,// 479 发电量发电时间清零设置
    0   ,// 480 安规设置
    0   ,// 481 绝缘阻抗设置
    0   ,// 482 电表协议选择
    0   ,// 483 Wifi通讯地址和波特率
    0   ,// 484 与电表通讯波特率和校验位
    0   ,// 485 与电表通讯地址
    0   ,// 486 电表使能写，禁止读
    0   ,// 487 电表Modbus地址
    0   ,// 488 电表数据
    0   ,// 489 485通讯地址和波特率
    0   ,// 490 LCD背光
    0   ,// 491 蜂鸣器
    1   ,// 492 电池包地址
    0   ,// 493 清除事件记录
    1   ,// 494 事件记录功能
    1   ,// 495 故障记录功能
    0   ,// 496 Log查询类型
    0   ,// 497 Log索引
};

//const Uint16 uiCRCTable[] = {
//    0X0000, 0XC0C1, 0XC181, 0X0140, 0XC301, 0X03C0, 0X0280, 0XC241,
//    0XC601, 0X06C0, 0X0780, 0XC741, 0X0500, 0XC5C1, 0XC481, 0X0440,
//    0XCC01, 0X0CC0, 0X0D80, 0XCD41, 0X0F00, 0XCFC1, 0XCE81, 0X0E40,
//    0X0A00, 0XCAC1, 0XCB81, 0X0B40, 0XC901, 0X09C0, 0X0880, 0XC841,
//    0XD801, 0X18C0, 0X1980, 0XD941, 0X1B00, 0XDBC1, 0XDA81, 0X1A40,
//    0X1E00, 0XDEC1, 0XDF81, 0X1F40, 0XDD01, 0X1DC0, 0X1C80, 0XDC41,
//    0X1400, 0XD4C1, 0XD581, 0X1540, 0XD701, 0X17C0, 0X1680, 0XD641,
//    0XD201, 0X12C0, 0X1380, 0XD341, 0X1100, 0XD1C1, 0XD081, 0X1040,
//    0XF001, 0X30C0, 0X3180, 0XF141, 0X3300, 0XF3C1, 0XF281, 0X3240,
//    0X3600, 0XF6C1, 0XF781, 0X3740, 0XF501, 0X35C0, 0X3480, 0XF441,
//    0X3C00, 0XFCC1, 0XFD81, 0X3D40, 0XFF01, 0X3FC0, 0X3E80, 0XFE41,
//    0XFA01, 0X3AC0, 0X3B80, 0XFB41, 0X3900, 0XF9C1, 0XF881, 0X3840,
//    0X2800, 0XE8C1, 0XE981, 0X2940, 0XEB01, 0X2BC0, 0X2A80, 0XEA41,
//    0XEE01, 0X2EC0, 0X2F80, 0XEF41, 0X2D00, 0XEDC1, 0XEC81, 0X2C40,
//    0XE401, 0X24C0, 0X2580, 0XE541, 0X2700, 0XE7C1, 0XE681, 0X2640,
//    0X2200, 0XE2C1, 0XE381, 0X2340, 0XE101, 0X21C0, 0X2080, 0XE041,
//    0XA001, 0X60C0, 0X6180, 0XA141, 0X6300, 0XA3C1, 0XA281, 0X6240,
//    0X6600, 0XA6C1, 0XA781, 0X6740, 0XA501, 0X65C0, 0X6480, 0XA441,
//    0X6C00, 0XACC1, 0XAD81, 0X6D40, 0XAF01, 0X6FC0, 0X6E80, 0XAE41,
//    0XAA01, 0X6AC0, 0X6B80, 0XAB41, 0X6900, 0XA9C1, 0XA881, 0X6840,
//    0X7800, 0XB8C1, 0XB981, 0X7940, 0XBB01, 0X7BC0, 0X7A80, 0XBA41,
//    0XBE01, 0X7EC0, 0X7F80, 0XBF41, 0X7D00, 0XBDC1, 0XBC81, 0X7C40,
//    0XB401, 0X74C0, 0X7580, 0XB541, 0X7700, 0XB7C1, 0XB681, 0X7640,
//    0X7200, 0XB2C1, 0XB381, 0X7340, 0XB101, 0X71C0, 0X7080, 0XB041,
//    0X5000, 0X90C1, 0X9181, 0X5140, 0X9301, 0X53C0, 0X5280, 0X9241,
//    0X9601, 0X56C0, 0X5780, 0X9741, 0X5500, 0X95C1, 0X9481, 0X5440,
//    0X9C01, 0X5CC0, 0X5D80, 0X9D41, 0X5F00, 0X9FC1, 0X9E81, 0X5E40,
//    0X5A00, 0X9AC1, 0X9B81, 0X5B40, 0X9901, 0X59C0, 0X5880, 0X9841,
//    0X8801, 0X48C0, 0X4980, 0X8941, 0X4B00, 0X8BC1, 0X8A81, 0X4A40,
//    0X4E00, 0X8EC1, 0X8F81, 0X4F40, 0X8D01, 0X4DC0, 0X4C80, 0X8C41,
//    0X4400, 0X84C1, 0X8581, 0X4540, 0X8701, 0X47C0, 0X4680, 0X8641,
//    0X8201, 0X42C0, 0X4380, 0X8341, 0X4100, 0X81C1, 0X8081, 0X4040
//};


/******************************************************************************
Function Name		:
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list	:
ReturnTyp			:
Refer documents	:
******************************************************************************/
void MonitorProtocol_Task_RealTime(void)
{

}

/******************************************************************************
Function Name		:
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list	:
ReturnType			:
Refer documents	:
******************************************************************************/
void MonitorProtocol_Task_1ms(void)
{

}

/******************************************************************************
Function Name		:
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list	:
ReturnType			:
Refer documents	:
******************************************************************************/
void MonitorProtocol_Task_5ms(void)
{

}

/******************************************************************************
Function Name		:
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list	:
ReturnType			:
Refer documents	:
******************************************************************************/
void MonitorProtocol_Task_20ms(void)
{
	MonitorProtocol_AnologUpdate();
	MonitorProtocol_AlarmRenew();
}

/******************************************************************************
Function Name		:
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list	:
ReturnType			:
Refer documents	:
******************************************************************************/
void MonitorProtocol_Task_100ms(void)
{


}
/******************************************************************************
Function Name           : CanMonitorProtocol_AlarmRenew
------------------------------------------------------------------------------
Function Descriptions   :
Parameter Name list     :
ReturnType              :
Refer documents        :
******************************************************************************/
void MonitorProtocol_AlarmRenew(void)
{
    // 0-8是故障
    // 1
    unFaultFlag.bit.bTotalPV   = 0 ;
    unFaultFlag.bit.bTotalBat  = 0 ;
    unFaultFlag.bit.bTotalBus  = 0 ;
    unFaultFlag.bit.bTotalINV  = 0 ;
    unFaultFlag.bit.bTotalGrid = 0 ;
    unFaultFlag.bit.bTotalLoad = 0 ;
    unFaultFlag.bit.bTotalSYS  = 0 ;
    unFaultFlag.bit.bTotalSafe = 0 ;
    unFaultFlag.bit.bTotalPara = 0 ;
    // 2
    unFaultFlag.bit.bPV1OV       = g_SysFault.ubFault.bit.PV1VoltOver ;
    unFaultFlag.bit.bPV2OV       = g_SysFault.ubFault.bit.PV2VoltOver ;
    unFaultFlag.bit.bPV1OC       = g_SysFault.ubFault.bit.PV1CurrOver ;
    unFaultFlag.bit.bPV2OC       = g_SysFault.ubFault.bit.PV2CurrOver ;
    unFaultFlag.bit.bPV1Inverse  = g_SysFault.ubFault.bit.PV1Short ;
    unFaultFlag.bit.bPV2Inverse  = g_SysFault.ubFault.bit.PV2Short ;
    unFaultFlag.bit.bPVArc       = 0 ;
    unFaultFlag.bit.bPVHardOC    = 0 ;

    // 3
    unFaultFlag.bit.bBat1SoftOV     = 0 ;
    unFaultFlag.bit.bBat1HardOV     = 0 ;
    unFaultFlag.bit.bBat1UV         = 0 ;
    unFaultFlag.bit.bBat1SoftOC     = 0 ;
    unFaultFlag.bit.bBat1HardOC     = 0 ;
    unFaultFlag.bit.bBat1Inverse    = 0 ;
    unFaultFlag.bit.bBat1RelayOpen  = 0 ;
    unFaultFlag.bit.bBat1RelayShort = 0 ;
    unFaultFlag.bit.bBat1SoftFault  = 0 ;
    unFaultFlag.bit.bBat1SOCLow     = 0 ;

    // 4
    unFaultFlag.bit.bBatArc               = 0 ;
    unFaultFlag.bit.bBusSoftOV            = 0 ;
    unFaultFlag.bit.bBusHardOV            = 0 ;
    unFaultFlag.bit.bBusUV                = 0 ;
    unFaultFlag.bit.bBusUnbalance         = 0 ;
    unFaultFlag.bit.bBusSoftFail          = 0 ;
    unFaultFlag.bit.bBusShort             = 0 ;
    unFaultFlag.bit.bBusBalanBridgeSoftOC = 0 ;
    unFaultFlag.bit.bBusBalanBridgeHardOC = 0 ;

    // 5
    unFaultFlag.bit.bInvSelfCheck    = 0 ;
    unFaultFlag.bit.bInvSoftFault    = 0 ;
    unFaultFlag.bit.bInvVoltFault    = 0 ;
    unFaultFlag.bit.bInvSoftOC       = 0 ;
    unFaultFlag.bit.bInvHardOC       = 0 ;
    unFaultFlag.bit.bInvShort        = 0 ;
    unFaultFlag.bit.bInvVoltDC       = 0 ;
    unFaultFlag.bit.bInvCurrDC       = 0 ;
    unFaultFlag.bit.bGridOV          = 0 ;
    unFaultFlag.bit.bGridUV          = 0 ;
    unFaultFlag.bit.bGridOF          = 0 ;
    unFaultFlag.bit.bGridUF          = 0 ;
    unFaultFlag.bit.bGridSeqInver    = 0 ;
    unFaultFlag.bit.bGridOverLoad    = 0 ;
    unFaultFlag.bit.bGridIsLand      = 0 ;
    unFaultFlag.bit.bGridUnbalance   = 0 ;

    // 6
    unFaultFlag.bit.bLoadOver            = 0 ;
    unFaultFlag.bit.bLoadOver125         = 0 ;
    unFaultFlag.bit.bLoadOver150         = 0 ;
    unFaultFlag.bit.bLoadOver200         = 0 ;
    unFaultFlag.bit.bSysEPO              = 0 ;
    unFaultFlag.bit.bSysOverTempIGBT     = (g_SysFault.ubFault.bit.LlcTempOver || g_SysFault.ubFault.bit.InvTempOver || g_SysFault.ubFault.bit.InnerTempOver || g_SysFault.ubFault.bit.PBACTempOver) ;
    unFaultFlag.bit.bSysOverTempEnvi     = 0 ;
    unFaultFlag.bit.bSysFANFault1        = g_SysAlarm.ubAlarm.bit.Fan1Alarm;
    unFaultFlag.bit.bSysFANFault2        = g_SysAlarm.ubAlarm.bit.Fan2Alarm;
    unFaultFlag.bit.bSysEepromFault      = g_SysFault.ubFault.bit.E2promFault ;
    unFaultFlag.bit.bSys12VAuxiPower     = 0 ;
    unFaultFlag.bit.bSysCTHallOpen       = 0 ;
    unFaultFlag.bit.bSysSlaveDSPComFault = g_SysFault.ubFault.bit.InnerCommErr ;

    // 7
    unFaultFlag.bit.bSysMCUComFault        = g_SysFault.ubFault.bit.MChip_Fault ; // 暂时放从DSP故障
    unFaultFlag.bit.bSysDRMFault           = 0 ;
    unFaultFlag.bit.bSafeLeakCurr          = 0 ;
    unFaultFlag.bit.bSafeBusIso            = g_SysFault.ubFault.bit.IsoCheckFail ;
    unFaultFlag.bit.bSafeBat1Iso           = 0 ;
    unFaultFlag.bit.bSafeConnectGND        = 0 ;
    unFaultFlag.bit.bSafeGenRelayFault     = 0 ;
    unFaultFlag.bit.bSafeGridRelayFault    = 0 ;
    unFaultFlag.bit.bSafeINVRelayOpen      = g_SysFault.ubFault.bit.NtcOpen ;
    unFaultFlag.bit.bSafeINVRelayShort     = 0 ;
    unFaultFlag.bit.bSafeLoadRelayFault    = 0 ;
    unFaultFlag.bit.bParaPWMSyncEcapFault  = 0 ;
    unFaultFlag.bit.bParaCANComFault       = 0 ;
    unFaultFlag.bit.bParaCANMasterLose     = 0 ;
    unFaultFlag.bit.bParaZeroSyncEcapFault = 0 ;

    // 8
    unFaultFlag.bit.bParaCANMasterConflict = 0 ;
    unFaultFlag.bit.bGenOV                 = 0 ;
    unFaultFlag.bit.bGenUV                 = 0 ;
    unFaultFlag.bit.bGenOF                 = 0 ;
    unFaultFlag.bit.bGenUF                 = 0 ;
    unFaultFlag.bit.bGenSeqInver           = 0 ;
    unFaultFlag.bit.bGenOverLoad           = 0 ;
    unFaultFlag.bit.bBMS1CommuniFault      = 0 ;

    // 9-12是告警
    unFaultFlag.bit.bBat1OVAlarm         = 0 ;
    unFaultFlag.bit.bBat1UVAlarm         = 0 ;
    unFaultFlag.bit.bBat1SOCLowAlarm     = 0 ;
    unFaultFlag.bit.bBat2OVAlarm         = 0 ;
    unFaultFlag.bit.bBat2UVAlarm         = g_SysAlarm.ubAlarm.bit.Pv1Loss ;
    unFaultFlag.bit.bBat2SOCLowAlarm     = g_SysAlarm.ubAlarm.bit.Pv2Loss ;
    unFaultFlag.bit.bHVRTAlarm           = 0 ;
    unFaultFlag.bit.bLVRTAlarm           = 0 ;
    unFaultFlag.bit.bUFDerateAlarm       = 0 ;
    unFaultFlag.bit.bOFDerateAlarm       = 0 ;
    unFaultFlag.bit.bUFUprateAlarm       = 0 ;
    unFaultFlag.bit.bOverLoadAlarm       = 0 ;
    unFaultFlag.bit.bDCLightAlarm        = 0 ;
    unFaultFlag.bit.bACLightAlarm        = 0 ;
    unFaultFlag.bit.bHeatTempDerateAlarm = 0 ;
    unFaultFlag.bit.bEnviTempDerateAlarm = 0 ;

    // 以下没有显示
    unFaultFlag.bit.bAFCIComAlarm     = 0 ;
    unFaultFlag.bit.bSysFANAlarm1     = 0 ;
    unFaultFlag.bit.bSysFANAlarm2     = 0 ;

}

/******************************************************************************
Function Name           :
------------------------------------------------------------------------------
Function Descriptions   : 更新模拟量
Parameter Name list     :
ReturnType              :
Refer documents        : 100ms  特别注意：上传负的浮点数时，要将浮点数先转成有符号整数，再赋给无符号数组,否则会出错！
******************************************************************************/
void MonitorProtocol_AnologUpdate(void)
{
    static Uint16 uiRenewStep=0;

	switch(uiRenewStep++)
	{
		case 0:
		{
            uiSciAnalogDataBag[ eAnalogWorkMode           ] = 0;
            uiSciAnalogDataBag[ eAnalogState1             ] = cMachineMode;
            uiSciAnalogDataBag[ eAnalogState2             ] = g_SystemInfo.usVerDate;//cVerDate;
            uiSciAnalogDataBag[ eAnalogState3             ] = g_SystemInfo.usSlvVersion;
            uiSciAnalogDataBag[ eAnalogState4             ] = unPvState.all;

            uiSciAnalogDataBag[ eAnalogYearMonth          ] = g_PvVar.PvFlag.Word.WordL;
            uiSciAnalogDataBag[ eAnalogDayHour            ] = g_PvVar.PvFlag.Word.WordH;
            uiSciAnalogDataBag[ eAnalogMinuteSecond       ] = g_SystemVar.SysRunFlag.all;  // 2-finish
            uiSciAnalogDataBag[ eAnalogWeek               ] = uiSystemState ; // 3 -running

			uiSciAnalogDataBag[ eAnalogWarnCode           ] = uiWarnCode;    //  9   告警码
            uiSciAnalogDataBag[ eAnalogFaultCode          ] = uiFaultCode;   //  10  故障码
            uiSciAnalogDataBag[ eAnalogWarnState1         ] = g_SysFault.ubFault.fault.fault1; // unFaultFlag.uiFaultArray[9]  ;   //  11  警告标志 1
            uiSciAnalogDataBag[ eAnalogWarnState2         ] = g_SysFault.ubFault.fault.fault2; // unFaultFlag.uiFaultArray[10] ;   //  12  警告标志 2
            uiSciAnalogDataBag[ eAnalogWarnState3         ] = unFaultFlag.uiFaultArray[11] ;   //  13  警告标志 3
            uiSciAnalogDataBag[ eAnalogWarnState4         ] = unFaultFlag.uiFaultArray[12] ;   //  14  警告标志 4
            uiSciAnalogDataBag[ eAnalogFaultCode1         ] = unFaultFlag.uiFaultArray[0]  ;   //  15  故障码1
            uiSciAnalogDataBag[ eAnalogFaultCode2         ] = unFaultFlag.uiFaultArray[1]  ;   //  16  故障码2
            uiSciAnalogDataBag[ eAnalogFaultCode3         ] = unFaultFlag.uiFaultArray[2]  ;   //  17  故障码3
            uiSciAnalogDataBag[ eAnalogFaultCode4         ] = (int16)(g_strPvMaxPowerLoop.Ref * cPvPowerMax);//unFaultFlag.uiFaultArray[3]  ;   //  18  故障码4
            uiSciAnalogDataBag[ eAnalogFaultCode5         ] = (int16)((stPower.fPv1ScaleFilter + stPower.fPv2ScaleFilter) * cPvPowerMax);//unFaultFlag.uiFaultArray[4]  ;   //  19  故障码5
            uiSciAnalogDataBag[ eAnalogFaultCode6         ] = MpptStep;//unFaultFlag.uiFaultArray[5]  ;   //  20  故障码6
            uiSciAnalogDataBag[ eAnalogFaultCode7         ] = (int16)(PvVoltRef * cVPvRated * 10);//unFaultFlag.uiFaultArray[6]  ;   //  21  故障码7
            uiSciAnalogDataBag[ eAnalogFaultCode8         ] = (int16)(PvVoltReal * cVPvRated * 10);//unFaultFlag.uiFaultArray[7]  ;   //  22  故障码8
            uiSciAnalogDataBag[ eAnalogFaultCode9         ] = (int16)(PvCurrReal * cIPvRated * 100);//unFaultFlag.uiFaultArray[8]  ;   //  23  故障码9

            uiSciAnalogDataBag[ eAnalogPV1Volt            ] = stValue.fAveReal.VoltPv1 * 10;	//	24	PV1电压
            uiSciAnalogDataBag[ eAnalogPV2Volt            ] = stValue.fAveReal.VoltPv2 * 10;	//	25	PV2电压
            uiSciAnalogDataBag[ eAnalogPV3Volt            ] = stValue.fAveReal.VPBus * 10;	    //	26	PV3电压
            uiSciAnalogDataBag[ eAnalogPV4Volt            ] = stAdcTemp.Ave.Bat_Temp;//stValue.fAveReal.VNBus * 10;	    //	27	PV4电压
            uiSciAnalogDataBag[ eAnalogPV1IndCurr         ] = ((int16)(stValue.fAveReal.CurrPv1 * 100    ));	//	28	PV1电感电流
            uiSciAnalogDataBag[ eAnalogPV2IndCurr         ] = ((int16)(stValue.fAveReal.CurrPv2 * 100    ));	//	29	PV2电感电流
            uiSciAnalogDataBag[ eAnalogPV3IndCurr         ] = ((int16)(stValue.fAveReal.CurrFiltPv1 * 100));	//	30	PV3电感电流
            uiSciAnalogDataBag[ eAnalogPV4IndCurr         ] = ((int16)(stValue.fAveReal.CurrFiltPv2 * 100));	//	31	PV4电感电流
            uiSciAnalogDataBag[ eAnalogPV1_1InputCurr     ] = g_strPv1BusVoltLoop.Ref * cVBusRated * 10;	//	32	PV1_1输入电流
            uiSciAnalogDataBag[ eAnalogPV1_2InputCurr     ] = g_strPv1VoltLoop.Ref * cVPvRated * 10;	//	33	PV1_2输入电流
            uiSciAnalogDataBag[ eAnalogPV2_1InputCurr     ] = g_SystemInfo.fPvBusVoltRealSet * 10;	//	34	PV2_1输入电流
            uiSciAnalogDataBag[ eAnalogPV2_2InputCurr     ] = strMstState.ubState1.all;	//	35	PV2_2输入电流
            uiSciAnalogDataBag[ eAnalogPV3_1InputCurr     ] = ((int16)stAdcTemp.Ave.LLC_Temp);	//	36	PV3_1输入电流
            uiSciAnalogDataBag[ eAnalogPV3_2InputCurr     ] = (int16)(stValue.fAveReal.VoltPv1 * stValue.fAveReal.CurrPv1);	//	37	PV3_2输入电流
            uiSciAnalogDataBag[ eAnalogPV4_1InputCurr     ] = (int16)(stValue.fAveReal.VoltPv2 * stValue.fAveReal.CurrPv2);	//	38	PV4_1输入电流
            uiSciAnalogDataBag[ eAnalogPV4_2InputCurr     ] = ((int16)stAdcTemp.Ave.Pv_Temp);	//	39	PV4_2输入电流
            uiSciAnalogDataBag[ eAnalogPV1Power           ] = ((int16)stAdcTemp.Ave.LLC_TX_Temp);	//	40	PV1功率
            uiSciAnalogDataBag[ eAnalogPV2Power           ] = ((int16)stAdcTemp.Ave.Inv_Temp);	//	41	PV2功率
            uiSciAnalogDataBag[ eAnalogPV3Power           ] = ((int16)g_strPv1BusVoltLoop.integrator * cIPvRated * 100);	//	42	PV3功率
            uiSciAnalogDataBag[ eAnalogPV4Power           ] = ((int16)g_strPv1BusVoltLoop.Out * cIPvRated * 100);	//	43	PV4功率

            uiSciAnalogDataBag[ eAnalogBat1RlyForwardVolt ] = (int16)(g_strPv1VoltLoop.integrator * cIPvRated * 100);	//	44  Bat1继电器前端电压
            uiSciAnalogDataBag[ eAnalogBat2RlyForwardVolt ] = (int16)(g_strPv1VoltLoop.Out * cIPvRated * 100);	//	45	Bat2继电器前端电压
            uiSciAnalogDataBag[ eAnalogBat1RlyBackwardVolt] =(int16)(g_strPv1CurrLoop.integrator * cIPvRated * 100);	//	46	Bat1继电器后端电压压
            uiSciAnalogDataBag[ eAnalogBat2RlyBackwardVolt] = (int16)(g_strPv1CurrLoop.Out * cIPvRated * 100);	//	47	Bat2继电器后端电压端电压
            uiSciAnalogDataBag[ eAnalogIBat1Curr          ] = (int16)(g_strPv1PowerLoop.integrator*cPvPowerMax);//	48	Bat1电流
            uiSciAnalogDataBag[ eAnalogBat1Power          ] = (int16)(g_strPv1PowerLoop.Out*cPvPowerMax);	//	49	Bat1功率
            uiSciAnalogDataBag[ eAnalogIBat2Curr          ] = (int16)(stValue.fAveReal.PvIosVolt*10);//	50	Bat2电流
            uiSciAnalogDataBag[ eAnalogBat2Power          ] = g_PvVar.PvFlag.bit.Pv1PowerDerate;//22;	//	51	Bat2功率  不大于50K   W/1000*10倍
            break;

		}

		case 1:
		{
			
            uiSciAnalogDataBag[ eAnalogBat1PosIso  ] = strMpptCtrlData_Pv1.uiMpptFound;//stValue.fAveReal.PvIosVolt;	//	52	Bat1正对地绝缘阻抗
            uiSciAnalogDataBag[ eAnalogBat1NegIso  ] = strMpptCtrlData_Pv1.uiMpptSearchState;//53;	//	53	Bat1负对地绝缘阻抗
            uiSciAnalogDataBag[ eAnalogBat2PosIso  ] = (int16)(strMpptCtrlData_Pv1.strMpptPower.Middle * cPvPowerMax);//54;	//	54	Bat2正对地绝缘阻抗
            uiSciAnalogDataBag[ eAnalogBat2NegIso  ] = (int16)(strMpptCtrlData_Pv1.fDetlaPower * cPvPowerMax);//55;	//	55	Bat2负对地绝缘阻抗
            uiSciAnalogDataBag[ eAnalogBat1SOC     ] = (int16)(strMpptCtrlData_Pv1.fMpptStep * cVPvRated * 10);//100;  //  56  Bat1SOC
            uiSciAnalogDataBag[ eAnalogBat1SOH     ] = (int16)(strMpptCtrlData_Pv1.strMpptPower.Right * cPvPowerMax);//1000;  //  57  Bat1SOH
            uiSciAnalogDataBag[ eAnalogBat1Cap     ] = (int16)(strMpptCtrlData_Pv1.strMpptPower.Left * cPvPowerMax);//50;    //  58  Bat1容量
            uiSciAnalogDataBag[ eAnalogBat2SOC     ] = bTest1;//g_PvVar.fIsoChkRx;  
            uiSciAnalogDataBag[ eAnalogBat2SOH     ] = bTest2;//g_PvVar.fIsoChkRy;
            uiSciAnalogDataBag[ eAnalogBat2Cap     ] = (int16)(MiddlePower * cPvPowerMax);//g_SystemInfo.uiIsoResLimitSet;

            uiSciAnalogDataBag[ eAnalogBusVolt     ] = (int16)(LeftPower  * cPvPowerMax); //当前PV电压给定
            uiSciAnalogDataBag[ eAnalogPosBusVolt  ] = (int16)(RightPower * cPvPowerMax);   //  63  Bus正电压
            uiSciAnalogDataBag[eAnalogNegBusVolt   ] = g_PvVar.PvFlag.bit.PvRunSts;  //PV运行状态：0->关机 1->MPPT
            uiSciAnalogDataBag[eAnalogBalanceCurr  ] = stAdcOffSet.CurrPv1;  //  65  平衡板电流

            uiSciAnalogDataBag[eAnalogBusPosIso    ] = ((int16)stAdcTemp.Ave.Inv_Temp  );   //  66  Bus正对地绝缘阻抗
            uiSciAnalogDataBag[eAnalogBusNegIso    ] = fPv2CurrRefTopLimit;   //  67  Bus负对地绝缘阻抗

            uiSciAnalogDataBag[eAnalogBoostTempe   ] = ((int16)stAdcTemp.Ave.LLC_Temp);    // 68  Boost温度
            uiSciAnalogDataBag[eAnalogInvTempe     ] =  g_PvVar.PvFlag.bit.Pv1Enable;// 69  逆变温度
            uiSciAnalogDataBag[eAnalogEnviTempe    ] =  g_PvVar.PvFlag.bit.Pv2Enable;// 70  环境温度
            uiSciAnalogDataBag[eAnalogLeadAcidTempe ] = ((int16)stAdcTemp.Ave.Bat_Temp);    // 71  PCB温度1
            uiSciAnalogDataBag[eAnalogPCB2Tempe    ] = ((int16)stAdcTemp.Ave.Pv_Temp);    // 72  PCB温度2
            uiSciAnalogDataBag[eAnalogLeakCurr     ] = IsoRelay1Back;//stValue.fRmsReal.IGfci * 100  ;    // 73  漏电流
            uiSciAnalogDataBag[eAnalogGen_ACurr    ] = IsoRelay2Back;    // 74  A相油机电流
            uiSciAnalogDataBag[eAnalogGen_BCurr    ] = stAdcTemp.AveSmp.LLC_Temp;//75  ;    // 75  B相油机电流
            uiSciAnalogDataBag[eAnalogGen_CCurr    ] = stAdcTemp.AveSmp.Inv_Temp;//76  ;    // 76  C相油机电流
            uiSciAnalogDataBag[eAnalogGEN_AVolt    ] = stAdcTemp.AveSmp.Pv_Temp;//77 ;    // 77  A相油机电压
            uiSciAnalogDataBag[eAnalogGEN_BVolt    ] = stAdcTemp.AveSmp.Bat_Temp;//78 ;    // 78  B相油机电压
            uiSciAnalogDataBag[eAnalogGEN_CVolt    ] = g_SystemInfo.usVerDate;    // 79  C相油机电压
            uiSciAnalogDataBag[eAnalogGrid_AVolt   ] = stValue.fRmsScale.VGridA * cVInvRated * 10;    // 80  A相电网电压
            uiSciAnalogDataBag[eAnalogGrid_BVolt   ] = stValue.fRmsScale.VGridB * cVInvRated * 10;    // 81  B相电网电压
            uiSciAnalogDataBag[eAnalogGrid_CVolt   ] = (int16)swGetFunc39();    // 82  C相电网电压
            uiSciAnalogDataBag[eAnalogINV_AVolt    ] = g_PvVar.fIsoChkPe0Volt * 10;    // 83  A相逆变电压
            uiSciAnalogDataBag[eAnalogINV_BVolt    ] = g_PvVar.fIsoChkPe1Volt * 10;    // 84  B相逆变电压
            uiSciAnalogDataBag[eAnalogINV_CVolt    ] = g_PvVar.fIsoChkPe2Volt * 10;    // 85  C相逆变电压
            uiSciAnalogDataBag[eAnalogLoad_AVolt   ] = g_PvVar.fPv1DeltaPeVolt * 10;    // 86  A相负载电压
            uiSciAnalogDataBag[eAnalogLoad_BVolt   ] = g_PvVar.fPv2DeltaPeVolt * 10;    // 87  B相负载电压
            uiSciAnalogDataBag[eAnalogLoad_CVolt   ] = (int16)(fPv1CurrRefTopLimit * cIPvRated*100);//(int16)(fRatioA*1000);    // 88  C相负载电压
            uiSciAnalogDataBag[eAnalogOutCT_ACurr  ] = (int16)(fPv2CurrRefTopLimit * cIPvRated*100);//(int16)(fRatioB*1000);    // 89  A相外部CT电流
            uiSciAnalogDataBag[eAnalogOutCT_BCurr  ] = strMstState.ubState1.bit.LlcSoftFinish;//(int16)(fRatioC*1000);    // 90  B相外部CT电流
            uiSciAnalogDataBag[eAnalogOutCT_CCurr  ] = g_PvVar.fIsoChkBus0Volt * 10;   // 91  C相外部CT电流
            uiSciAnalogDataBag[eAnalogGrid_ACurr   ] = g_PvVar.fIsoChkBus1Volt * 10;    // 92  A相电网电流
            uiSciAnalogDataBag[eAnalogGrid_BCurr   ] = g_PvVar.fIsoChkBus2Volt * 10;    // 93  B相电网电流
            uiSciAnalogDataBag[eAnalogGrid_CCurr   ] = g_PvVar.PvFlag.bit.PvMainSts;    // 闭环测试用，Pv状态机：初始化、iso检测、运行、故障、开环
            uiSciAnalogDataBag[eAnalogINV_ACurr    ] = g_PvVar.PvFlag.bit.PvTurnOn;     //系统(本机)给Pv下发的开关机标志
            uiSciAnalogDataBag[eAnalogINV_BCurr    ] = unPvState.bit.bPVSourceNormal;   //PV电压判断
            uiSciAnalogDataBag[eAnalogINV_CCurr    ] = hiMstToSlv_PvOn;    				// 97 主DSP下发的PV开机信号（1-On; 0-Off）
            uiSciAnalogDataBag[eAnalogLoad_ACurr   ] = g_PvVar.PvFlag.bit.PvIsoCheckState;    // 98  绝缘对地阻抗检测结果
            uiSciAnalogDataBag[eAnalogLoad_BCurr   ] = g_SystemVar.SysRunFlag.bit.bSystemMainSts;    // 99  B相负载电流
            uiSciAnalogDataBag[eAnalogLoad_CCurr   ] = g_PvVar.PvFlag.bit.PvIsoCheckStep;    // 100 C相负载电流

			break;
		}

        case 2:
        {
            uiSciAnalogDataBag[eAnalogINVdc_AVolt  ] = uiMasterAnalogData[eM2SRealData_DSPVersion];      // 101 A相逆变电压直流分量
            uiSciAnalogDataBag[eAnalogINVdc_BVolt  ] = uiMasterAnalogData[eM2SRealData_CtrlBusVlot];      // 102 B相逆变电压直流分量
            uiSciAnalogDataBag[eAnalogINVdc_CVolt  ] = uiMasterAnalogData[eM2SRealData_FanOn];      // 103 C相逆变电压直流分量
            uiSciAnalogDataBag[eAnalogINVdc_ACurr  ] = uiMasterAnalogData[eM2SRealData_FanDuty];      // 104 A相逆变电流直流分量
            uiSciAnalogDataBag[eAnalogINVdc_BCurr  ] = uiMasterAnalogData[eM2SRealData_State1];      // 105 B相逆变电流直流分量
            uiSciAnalogDataBag[eAnalogINVdc_CCurr  ] = uiMasterAnalogData[eM2SRealData_State2];      // 106 C相逆变电流直流分量
            uiSciAnalogDataBag[eAnalogINVn_Volt    ] = uiMasterAnalogData[eM2SRealData_State3];      // 107 N相逆变电压
            uiSciAnalogDataBag[eAnalogGENFreq      ] = uiMasterAnalogData[eM2SRealData_State4];      // 108 油机频率
            uiSciAnalogDataBag[eAnalogGridFreq     ] = uiMasterAnalogData[eM2SRealData_BatVolt];     // 109 电网频率
            uiSciAnalogDataBag[eAnalogINVFreq      ] = (int16)(uiMasterAnalogData[eM2SRealData_BatCurr]);      // 110 逆变频率
            uiSciAnalogDataBag[eAnalogLoadFreq     ] = (int16)(fReal_BatPower(g_SystemInfo.fBatPower));      // 111 负载频率
            uiSciAnalogDataBag[eAnalogGEN_APhaseP  ] = (int16)(fReal_BatPower(g_SystemInfo.fBatPowerSet));      // 112 A相油机有功功率
            uiSciAnalogDataBag[eAnalogGEN_BPhaseP  ] = uiMasterAnalogData[eM2SRealData_PvMaxPower];      // 113 B相油机有功功率
            uiSciAnalogDataBag[eAnalogGEN_CPhaseP  ] = uiMasterAnalogData[eM2SRealData_PV1StartVolt];      // 114 C相油机有功功率
            uiSciAnalogDataBag[eAnalogGrid_APhaseP ] = (int16)uiMasterAnalogData[eM2SRealData_Bat1VoltUpLimit];//uiMasterAnalogData[eM2SRealData_PV2StartVolt] ;      // 115 A相电网有功功率
            uiSciAnalogDataBag[eAnalogGrid_BPhaseP ] = g_SystemInfo.fBat1VoltUpLimit;      // 116 B相电网有功功率
            uiSciAnalogDataBag[eAnalogGrid_CPhaseP ] = (int16)(fReal_BatPower(g_SystemInfo.fPvMaxPowerSetRef));      // 117 C相电网有功功率
            uiSciAnalogDataBag[eAnalogINV_APhaseP  ] = (int16)(g_SystemInfo.fPv1MaxPowerSet*cPvPowerMax);      // 118 A相逆变有功功率
            uiSciAnalogDataBag[eAnalogINV_BPhaseP  ] = (int16)(g_strPv1PowerLoop.Ref*cPvPowerMax);      // 119 B相逆变有功功率
            uiSciAnalogDataBag[eAnalogINV_CPhaseP  ] = (int16)(g_strPv1PowerLoop.Ref*cPvPowerMax);      // 120 C相逆变有功功率
            uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = (int16)(g_strPv1PowerLoop.Out*cPvPowerMax);      // 121 A相负载有功功率
            uiSciAnalogDataBag[eAnalogLoad_BPhaseP ] = uiMasterAnalogData[eM2SRealData_SetId];      // 122 B相负载有功功率
            uiSciAnalogDataBag[eAnalogLoad_CPhaseP ] = uiMasterAnalogData[eM2SRealData_SetData1];      // 123 C相负载有功功率
            uiSciAnalogDataBag[eAnalogLoad_APhaseS ] = uiMasterAnalogData[eM2SRealData_SetData2];      // 124 A相负载视在功率
            uiSciAnalogDataBag[eAnalogLoad_BPhaseS ] = (int16)(g_strPv1PowerLoop.Err*cPvPowerMax);      // 125 B相负载视在功率
            uiSciAnalogDataBag[eAnalogLoad_CPhaseS ] = fReal_BusVolt(g_SystemInfo.fPVBusLimit);//(int16)(g_strPv2PowerLoop.Err*cPvPowerMax);      // 126 C相负载视在功率
            uiSciAnalogDataBag[eAnalogLoad_APersent] = fReal_BusVolt(stADC.fRealScale.VBus);      // 127 A相负载百分比
            uiSciAnalogDataBag[eAnalogLoad_BPersent] = g_SysFault.ubFault.bit.LlcTempOver;      //PV过温
            uiSciAnalogDataBag[eAnalogLoad_CPersent] = g_SysFault.ubFault.bit.LlcTxTempOver;      // 129 C相负载百分比
            uiSciAnalogDataBag[eAnalogGEN_APF      ] = g_SysFault.ubFault.bit.InvTempOver;      // 130 A相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogGEN_BPF      ] = g_SysFault.ubFault.bit.BatTempOver;      // 131 B相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogGEN_CPF      ] = g_SysFault.ubFault.bit.PvTempOver;      // 132 C相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogGrid_APF     ] = g_SysFault.ubFault.bit.NtcOpen;      // 133 A相电网功率因数（0.01）
            uiSciAnalogDataBag[eAnalogGrid_BPF     ] = g_SysFault.ubFault.bit.Pv1Reverse;      // 134 B相电网功率因数（0.01）
            uiSciAnalogDataBag[eAnalogGrid_CPF     ] = g_SysFault.ubFault.bit.Pv2Reverse;      // 135 C相电网功率因数（0.01）
            uiSciAnalogDataBag[eAnalogINV_APF      ] = 136;     // 136 A相逆变功率因数（0.01）
            uiSciAnalogDataBag[eAnalogINV_BPF      ] = 137;      // 137 B相逆变功率因数（0.01）
            uiSciAnalogDataBag[eAnalogINV_CPF      ] = 138;      // 138 C相逆变功率因数（0.01）
            uiSciAnalogDataBag[eAnalogLinePowerConvertion] = 132;   // 139 总市电折算功率高位
            uiSciAnalogDataBag[eAnalogGenPowerConvertion ] = 133;   // 140 总油机折算功率
            uiSciAnalogDataBag[eAnalogLoadPowerConvertion] = (int16)(g_strPvMaxPowerLoop.integrator*cPvPowerMax);   // 141 负载用电折算功率
            uiSciAnalogDataBag[eAnalogBatPowerConvertion ] = (int16)(g_strPvMaxPowerLoop.Out*cPvPowerMax);       // 142 电池折算功率
            uiSciAnalogDataBag[eAnalogPVPowerConvertion  ] = (int16)(g_strPv2VoltLoop.integrator * cIPvRated * 100);   // 143 PV输入折算功率
            uiSciAnalogDataBag[eAnalogPowerFlowMsg ] = (int16)(g_strPv2VoltLoop.Out * cIPvRated * 100);         // 144 能流信息
            uiSciAnalogDataBag[eAnalogRsvd145      ] = (int16)(g_strPv2CurrLoop.integrator * cIPvRated * 100);         // 145 预留
            uiSciAnalogDataBag[eAnalogRsvd146      ] = (int16)(g_strPv2CurrLoop.Out * cIPvRated * 100);        // 146 预留
            uiSciAnalogDataBag[eAnalogRsvd147      ] = (int16)(g_strPv2PowerLoop.integrator*cPvPowerMax);        // 147 预留
            uiSciAnalogDataBag[eAnalogRsvd148      ] = (int16)(g_strPv2PowerLoop.Out*cPvPowerMax);        // 148 预留
            
            break;
        }
        case 3:
        {

            uiSciAnalogDataBag[eAnalogPV1TotalGenEnergyH   ] = iPfcInvCommTxData[eM2SCommData00];     // 149 PV1总发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogPV1TotalGenEnergyL   ] = iPfcInvCommTxData[eM2SComm_Pv1VoltAdjKa];     // 150 PV1总发电量低位
            uiSciAnalogDataBag[eAnalogPV2TotalGenEnergyH   ] = iPfcInvCommTxData[eM2SComm_Pv1VoltAdjKb];     // 151 PV2总发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogPV2TotalGenEnergyL   ] = iPfcInvCommTxData[eM2SComm_Pv2VoltAdjKa];     // 152 PV2总发电量低位
            uiSciAnalogDataBag[eAnalogPV3TotalGenEnergyH   ] = iPfcInvCommTxData[eM2SComm_Pv2VoltAdjKb];     // 153 PV3总发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogPV3TotalGenEnergyL   ] = iPfcInvCommTxData[eM2SComm_Pv1CurrAdjKa];     // 154 PV3总发电量低位
            uiSciAnalogDataBag[eAnalogPV4TotalGenEnergyH   ] = iPfcInvCommTxData[eM2SComm_Pv1CurrAdjKb];     // 155 PV4总发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogPV4TotalGenEnergyL   ] = iPfcInvCommTxData[eM2SComm_Pv2CurrAdjKa];     // 156 PV4总发电量低位
            uiSciAnalogDataBag[eAnalogBat1TotalChargeH     ] = iPfcInvCommTxData[eM2SComm_Pv2CurrAdjKb];     // 157 Bat1总充电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogBat1TotalChargeL     ] = iPfcInvCommTxData[eM2SComm_BusVoltAdjKa];     // 158 Bat1总充电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnalogBat1TotalDisChargeH  ] = iPfcInvCommTxData[eM2SComm_BusVoltAdjKb];     // 159 Bat1总放电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogBat1TotalDisChargeL  ] = 160 ;    // 160 Bat1总放电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnalogBat2TotalChargeH     ] = 161 ;    // 161 Bat2总充电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogBat2TotalChargeL     ] = 162 ;    // 162 Bat2总充电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnalogBat2TotalDisChargeH  ] = 163 ;    // 163 Bat2总放电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogBat2TotalDisChargeL  ] = 164 ;    // 164 Bat2总放电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnalogGridTotalCostEnergyH ] = 165 ;    // 165 电网总取电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogGridTotalCostEnergyL ] = 166 ;    // 166 电网总取电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnalogGridTotalGenEnergyH  ] = 167 ;    // 167 电网总馈电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogGridTotalGenEnergyL  ] = 168 ;    // 168 电网总馈电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnalogLoadTotalCostEnergyH ] = 169 ;    // 169 负载总耗电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnalogLoadTotalCostEnergyL ] = 170 ;    // 170 负载总耗电量低位（0.1KWh）

            uiSciAnalogDataBag[eAnalogRsvd171 ] = 171 ;    // 171 预留
            uiSciAnalogDataBag[eAnalogRsvd172 ] = 172 ;    // 172 预留
            uiSciAnalogDataBag[eAnalogRsvd173 ] = 173 ;    // 173 预留
            uiSciAnalogDataBag[eAnalogRsvd174 ] = 174 ;    // 174 预留
            uiSciAnalogDataBag[eAnalogRsvd175 ] = 175 ;    // 175 预留
            uiSciAnalogDataBag[eAnalogRsvd176 ] = 176 ;    // 176 预留


            //  以下都不要赋值
//            uiSciAnalogDataBag[eAnaPV1DayGenEnergy     ] = iPfcInvCommTxData[eM2SCommData00]; // 177 ;        // 177 PV1日发电量（0.1KWh），移至GD处计算
//            uiSciAnalogDataBag[eAnaPV1MonthGenEnergyH  ] = iPfcInvCommTxData[eM2SCommData01]; // 178 ;        // 178 PV1月发电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV1MonthGenEnergyL  ] = iPfcInvCommTxData[eM2SCommData02]; // 179 ;        // 179 PV1月发电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV1YearGenEnergyH   ] = iPfcInvCommTxData[eM2SCommData03]; // 180 ;        // 180 PV1年发电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV1YearGenEnergyL   ] = iPfcInvCommTxData[eM2SCommData04]; // 181 ;        // 181 PV1年发电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV2DayGenEnergy     ] = iPfcInvCommTxData[eM2SCommData05]; // 182 ;        // 182 PV2日发电量（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV2MonthGenEnergyH  ] = iPfcInvCommTxData[eM2SCommData06]; // 183 ;        // 183 PV2月发电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV2MonthGenEnergyL  ] = iPfcInvCommTxData[eM2SCommData07]; // 184 ;        // 184 PV2月发电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV2YearGenEnergyH   ] = iPfcInvCommTxData[eM2SCommData08]; // 185 ;        // 185 PV2年发电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV2YearGenEnergyL   ] = iPfcInvCommTxData[eM2SCommData09]; // 186 ;        // 186 PV2年发电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV3DayGenEnergy     ] = iPfcInvCommTxData[eM2SCommData10]; // 187 ;        // 187 PV3日发电量（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV3MonthGenEnergyH  ] = 188 ;        // 188 PV3月发电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV3MonthGenEnergyL  ] = 189 ;        // 189 PV3月发电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV3YearGenEnergyH   ] = 190 ;        // 190 PV3年发电量高（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV3YearGenEnergyL   ] = 191 ;        // 191 PV3年发电量低（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV4DayGenEnergy     ] = 192 ;        // 192 PV4日发电量（0;1KWh）
//            uiSciAnalogDataBag[eAnaPV4MonthGenEnergyH  ] = 193 ;        // 193 PV4月发电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV4MonthGenEnergyL  ] = 194 ;        // 194 PV4月发电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV4YearGenEnergyH   ] = 195 ;        // 195 PV4年发电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPV4YearGenEnergyL   ] = 196 ;        // 196 PV4年发电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaPVTotalGenEnergyH   ] = 197 ;        // 197 PV发电量查询：总-高32位
//            uiSciAnalogDataBag[eAnaPVTotalGenEnergyL   ] = 198 ;        // 198 PV发电量查询：总-低32位
//            uiSciAnalogDataBag[eAnaBat1DayCharge       ] = 199 ;        // 199 Bat1日充电量（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1MonthChargeH    ] = 200 ;        // 200 Bat1月充电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1MonthChargeL    ] = 201 ;        // 201 Bat1月充电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1YearChargeH     ] = 202 ;        // 202 Bat1年充电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1YearChargeL     ] = 203 ;        // 203 Bat1年充电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1DayDisCharge    ] = 204 ;        // 204 Bat1日放电量（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1MonthDisChargeH ] = 205 ;        // 205 Bat1月放电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1MonthDisChargeL ] = 206 ;        // 206 Bat1月放电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1YearDisChargeH  ] = 207 ;        // 207 Bat1年放电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat1YearDisChargeL  ] = 208 ;        // 208 Bat1年放电量低位（0.1KWh）

            break;
        }
        case 4:
        {
//            uiSciAnalogDataBag[eAnaBat2MonthChargeH     ] = uiMasterAnalogData[eM2SRealData_DSPVersion];//210 ;       // 210 Bat2月充电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat2MonthChargeL     ] = uiMasterAnalogData[eM2SRealData_CtrlBusVlot];//211 ;       // 211 Bat2月充电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat2YearChargeH      ] = uiMasterAnalogData[eM2SRealData_FanOn];//212 ;       // 212 Bat2年充电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat2YearChargeL      ] = uiMasterAnalogData[eM2SRealData_FanDuty];//213 ;       // 213 Bat2年充电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat2DayDisCharge     ] = uiMasterAnalogData[eM2SRealData_State1];//214 ;       // 214 Bat2日放电量（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat2MonthDisChargeH  ] = uiMasterAnalogData[eM2SRealData_State2];//215 ;       // 215 Bat2月放电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat2MonthDisChargeL  ] = uiMasterAnalogData[eM2SRealData06];//216 ;       // 216 Bat2月放电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat2YearDisChargeH   ] = uiMasterAnalogData[eM2SRealData07];//217 ;       // 217 Bat2年放电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaBat2YearDisChargeL   ] = uiMasterAnalogData[eM2SRealData_PV1StartVolt];//218 ;       // 218 Bat2年放电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaGridDayCostEnergy    ] = uiMasterAnalogData[eM2SRealData_PV2StartVolt];//219 ;       // 219 Grid日取电量（0.1KWh）    移至GD处计算
//            uiSciAnalogDataBag[eAnaGridMonthCostEnergyH ] = uiMasterAnalogData[eM2SRealData10];//220 ;       // 220 Grid月取电量高位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaGridMonthCostEnergyL ] = uiMasterAnalogData[eM2SRealData11];//221 ;       // 221 Grid月取电量低位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaGridYearCostEnergyH  ] = uiMasterAnalogData[eM2SRealData12];//222 ;       // 222 Grid年取电量高位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaGridYearCostEnergyL  ] = uiMasterAnalogData[eM2SRealData13];//223 ;       // 223 Grid年取电量低位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaGridDayGenEnergy     ] = uiMasterAnalogData[eM2SRealData14];//224 ;       // 224 Grid日馈电量（0.1KWh）    移至GD处计算
//            uiSciAnalogDataBag[eAnaGridMonthGenEnergyH  ] = uiMasterAnalogData[eM2SRealData15];//225 ;       // 225 Grid月馈电量高位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaGridMonthGenEnergyL  ] = uiMasterAnalogData[eM2SRealData16];//226 ;       // 226 Grid月馈电量低位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaGridYearGenEnergyH   ] = uiMasterAnalogData[eM2SRealData17];//227 ;       // 227 Grid年馈电量高位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaGridYearGenEnergyL   ] = uiMasterAnalogData[eM2SRealData18];//228 ;       // 228 Grid年馈电量低位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaLoadDayCostEnergy    ] = uiMasterAnalogData[eM2SRealData19];//229 ;       // 229 Load日耗电量（0.1KWh）    移至GD处计算
//            uiSciAnalogDataBag[eAnaLoadMonthCostEnergyH ] = uiMasterAnalogData[eM2SRealData20];//230 ;       // 230 Load月耗电量高位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaLoadMonthCostEnergyL ] = uiMasterAnalogData[eM2SRealData21];//231 ;       // 231 Load月耗电量低位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaLoadYearCostEnergyH  ] = uiMasterAnalogData[eM2SRealData22];//232 ;       // 232 Load年耗电量高位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaLoadYearCostEnergyL  ] = uiMasterAnalogData[eM2SRealData23];//233 ;       // 233 Load年耗电量低位（0.1KWh）  移至GD处计算
//            uiSciAnalogDataBag[eAnaGenDayCostEnergy     ] = uiMasterAnalogData[eM2SRealData24];//234 ;       // 234 Gen日取电量（0.1KWh）
//            uiSciAnalogDataBag[eAnaGenMonthCostEnergyH  ] = uiMasterAnalogData[eM2SRealData25];//235 ;       // 235 Gen月取电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaGenMonthCostEnergyL  ] = 236 ;       // 236 Gen月取电量低位（0.1KWh）
//            uiSciAnalogDataBag[eAnaGenYearCostEnergyH   ] = 237 ;       // 237 Gen年取电量高位（0.1KWh）
//            uiSciAnalogDataBag[eAnaGenYearCostEnergyL   ] = 238 ;       // 238 Gen年取电量低位（0.1KWh）
//
//            uiSciAnalogDataBag[eAnalogRsvd239      ] = 239 ;          // 239 预留
//            uiSciAnalogDataBag[eAnalogRsvd240      ] = 240 ;          // 240 预留
//            uiSciAnalogDataBag[eAnalogRsvd241      ] = 241 ;          // 241 预留
//            uiSciAnalogDataBag[eAnalogRsvd242      ] = 242 ;          // 242 预留
//            uiSciAnalogDataBag[eAnalogRsvd243      ] = 243 ;          // 243 预留
//            uiSciAnalogDataBag[eAnalogRsvd244      ] = 244 ;          // 244 预留
//            uiSciAnalogDataBag[eAnalogRsvd245      ] = 245 ;          // 245 预留
//            uiSciAnalogDataBag[eAnalogRsvd246      ] = 246 ;          // 246 预留
//            uiSciAnalogDataBag[eAnalogRsvd247      ] = 247 ;          // 247 预留
//            uiSciAnalogDataBag[eAnalogRsvd248      ] = 248 ;          // 248 预留
//            uiSciAnalogDataBag[eAnalogRsvd249      ] = 249 ;          // 249 预留
//            uiSciAnalogDataBag[eAnalogRsvd250      ] = 250 ;          // 250 预留
//            uiSciAnalogDataBag[eAnalogRsvd251      ] = 251 ;          // 251 预留
//            uiSciAnalogDataBag[eAnalogRsvd252      ] = 252 ;          // 252 预留

            break;
        }
        //.........
        default:
        {
            uiRenewStep = 0;
            break;
        }
    }

}
/******************************************************************************
Function Name: Sci_CrcCaculate
--------------------------------------
Function Descriptions   :
Parameter Name list :
ReturnTyp           :
Refer doctuments        :
******************************************************************************/
Uint16 Sci_CrcCaculate(Uint16 *DataFirstAddPtr,Uint16 uiDataLength)
{
    Uint16 uiTemp;
    Uint16 uiCRCWord = 0xFFFF;

    while (uiDataLength--)
    {
        uiTemp = (*DataFirstAddPtr++ ^ uiCRCWord) & 0x00FF;
        uiCRCWord >>= 8;
        uiCRCWord ^= uiCRCTable[uiTemp];
    }
    return uiCRCWord;
}

#endif // MonitorProtocol_C
//===========================================================================
// End of file.
//===========================================================================
