/******************************************************************************
* Copyright (c) 2022 FELICITYSOLAR Corporation, All Rights Reserved
* Original Author	:FengJS,LiaoMF
* Last rev by		:
* Last rev date		:
* Last change list	:
* Overview			:
* Description		:
* NOTE				:
*******************************************************************************/

#ifndef MonitorProtocol_C
#define MonitorProtocol_C

// Adding Include Stuff
#include "DSP2833x_Device.h"     // Headerfile Include File
#include "DSP2833x_Examples.h"   // Examples Include File
#include "System.h"

//-----------------------------------------------------------------------------
// Public Variables
//-----------------------------------------------------------------------------

//----------------------------------------------------------------------------
// Adding Conditional Definitions Stuff
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// Adding Constants and Macro Definitions
//-----------------------------------------------------------------------------

//----------------------------------------------------------------------------
//Adding Private Enumerated and Structure Definitions
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
//Adding Public Enumerated and Structure Definitions Stuff
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
//Adding Public Function Prototypes
//-----------------------------------------------------------------------------
void MonitorProtocol_Task_1ms(void) ;
void MonitorProtocol_Task_5ms(void) ;
void MonitorProtocol_Task_20ms(void);
void MonitorProtocol_Task_100ms(void);

//-----------------------------------------------------------------------------
//Adding Private Function Prototypes (i.e. static)
//-----------------------------------------------------------------------------

void SciProtocol_RenewTxBuffer(Uint16,Uint16,Uint16);
void SciProtocol_CrcCheck(void);
Uint16 Sci_CrcCaculate(Uint16 *DataFirstAddPtr,Uint16 uiDataLength);

void MonitorProtocol_AlarmRenew(void);
void MonitorProtocol_PowerMsgShow(void);
void MonitorProtocol_AnologUpdate(void);
void MonitorProtocol_AnologShowDeal(void);  // 显示参数更新
void MonitorProtocol_ModuleStateShow(void); // 显示模块的状态信息
void MonitorProtocol_AnologInfoDataUpdate(void);
void MonitorProtocol_PowerCalc(float32 fP_Grid, float32 fP_Gen, float32 fP_Bat, float32 fP_Inv, float32 fP_Load, float32 fP_SmartLoad, float32 fP_Pv1, float32 fP_Pv2);
//-----------------------------------------------------------------------------
//Adding Private Variables (i.e. static)
//-----------------------------------------------------------------------------
Union_Fault             unFaultFlag;                           //故障量
Uint16 	         		uiSciAnalogDataBag[eAnalogDataEnd + 1];//模拟量
Uint16                  uiSciAnalogInforDataBag[eAnalogInforDataEnd +1];//模拟量（系统信息）

Uint16           		uiSciSetDataBag[eSetDataEndAdd + 1];   //设置量
Uint16	         		uiSciCommandDataBag[eCommandIDEnd + 1];//控制量
Uint16                  uiSciCommand_BMSDataBag[eCommand_BMSIDEnd + 1];//控制量

volatile Uint16         uiFaultCode;//故障码
volatile Uint16         uiWarnCode;//告警码
Uint16                  uiGridFaultCode;

//------------------------------------------------------------------------------
//注：如实际应用为有符号的负数，则需先转成无符号型再填入下表中，如：-1为65535，-10为65526；
const Uint16 uiSetDataRange[eSetDataEndAdd + 1][eSetDataRangeEnd] = {
        //  MIN     MAX     系数                  中文名称
        {   1      ,   16    ,   1        }   , // 0     8448    机器地址设置
        {   0      ,   1     ,   1        }   , // 1     8449    Dsp并机使能
        {   0      ,   1     ,   1        }   , // 2     8450    主从机设置
        {   0      ,   65535 ,   1        }   , // 3     8451    Eeprom自动写入
        {   0      ,   2 	 ,   1        }   , // 4     8452    并机相位选择
        {   0      ,   3     ,   1        }   , // 5     8453    电网类型  0-单相；1-3相；2-预留
        {   0      ,   1     ,   1        }   , // 6     8454    ATS功能
        {   0      ,   1     ,   1        }   , // 7     8455    ATS使能
#if(cPvPowerRateScale == 20)
        {   500    ,   12000 ,   1        }   , // 8     8456    PV最大输入功率
#else
        {   500    ,   10400 ,   1        }   , // 8     8456    PV最大输入功率
#endif
        {   0      ,   1     ,   1        }   , // 9     8457    PV并联使能
        {   0      ,   500   ,   1        }   , // 10    8458    PV1启动电压
        {   0      ,   500   ,   1        }   , // 11    8459    PV2启动电压
        {   0      ,   500   ,   1        }   , // 12    8460    PV3启动电压
        {   0      ,   500   ,   1        }   , // 13    8461    PV4启动电压
        {   0      ,   1     ,   1        }   , // 14    8462    PV_AFCI检测使能
        {   0      ,   65535 ,   1        }   , // 15    8463    预留
        {   0      ,   65535 ,   1        }   , // 16    8464    预留
        {   0      ,   1     ,   1        }   , // 17    8465    清除ARC故障
        {   4      ,   20    ,   1        }   , // 18    8466    电池1节数
        {   4      ,   20    ,   1        }   , // 19    8467    电池2节数
        {   0      ,   1     ,   1        }   , // 20    8468    电池AFCI检测使能
        {   0      ,   3     ,   1        }   , // 21    8469    电池模式
        {   0      ,   65535 ,   1        }   , // 22    8470    电池1容量
        {   0      ,   1350  ,   10       }   , // 23    8471    电池1最大充电电流限幅值
        {   0      ,   1350  ,   10       }   , // 24    8472    电池1最大放电电流限幅值
        {   0      ,   1     ,   1        }   , // 25    8473    电池1激活使能
        {   0      ,   1     ,   1        }   , // 26    8474    BMS通讯故障使能
        {   0      ,   1     ,   1        }   , // 27    8475    电池并联使能
        {   0      ,   20    ,   1        }   , // 28    8476    锂电BMS协议
        {   0      ,   1     ,   1        }   , // 29    8477    电网启动信号
        {   0      ,   240   ,   1        }   , // 30    8478    油机最小运行时间
        {   0      ,   1     ,   1        }   , // 31    8479    油机强制运行
        {   10     ,   90    ,   1        }   , // 32    8480    并网时电池自动启动充电SOC点
        {   10     ,   100   ,   1        }   , // 33    8481    并网时电池自动退出充电SOC点
        {   10     ,   90    ,   1        }   , // 34    8482    并油机时电池自动启动充电SOC点
        {   10     ,   100   ,   1        }   , // 35    8483    并油机时电池自动退出充电SOC点
        {   0      ,   1350  ,   10       }   , // 36    8484    电网给电池充电电流
        {   0      ,   1350  ,   10       }   , // 37    8485    油机给电池充电电流
        {   0      ,   1     ,   1        }   , // 38    8486    油机启动信号
        {   0      ,   1     ,   1        }   , // 39    8487    电网充电总使能
        {   0      ,   1     ,   1        }   , // 40    8488    油机充电总使能
        {   0      ,   240   ,   1        }   , // 41    8489    油机最大运行时间
        {   410    ,   600   ,   10       }   , // 42    8490    并网时电池1自动启动充电电压点
        {   410    ,   600   ,   10       }   , // 43    8491    并网时电池1自动退出充电电压点
        {   410    ,   600   ,   10       }   , // 44    8492    并油机时电池1自动启动充电电压点
        {   410    ,   600   ,   10       }   , // 45    8493    并油机时电池1自动退出充电电压点
        {   0      ,   1     ,   1        }   , // 46    8494    禁止浮充
        {   410    ,   600   ,   10       }   , // 47    8495    电池均衡充电电压
        {   0      ,   90    ,   1        }   , // 48    8496    电池均衡充电间隔天数
        {   0      ,   100   ,   10       }   , // 49    8497    电池均衡充电时间
        {   0      ,   65535 ,   1        }   , // 50    8498    预留
        {   410    ,   600   ,   10       }   , // 51    8499    电池1电池吸收电压（恒压充电压）
        {   410    ,   600   ,   10       }   , // 52    8500    电池1浮充电压
        {   0      ,   20    ,   1        }   , // 53    8501    电池温度系数
        {   1      ,   200   ,   1        }   , // 54    8502    电池阻抗
        {   410    ,   600   ,   10       }   , // 55    8503    电池1重启AC输出电压点
        {   410    ,   600   ,   10       }   , // 56    8504    电池1低压告警电压点
        {   410    ,   600   ,   10       }   , // 57    8505    电池1低压关机电压点
        {   0      ,   100   ,   1        }   , // 58    8506    电池重启AC输出SOC点
        {   0      ,   100   ,   1        }   , // 59    8507    电池低压告警SOC点
        {   0      ,   100   ,   1        }   , // 60    8508    电池低压关机SOC点
        {   400    ,   600   ,   10       }   , // 61    8509    电池2重启AC输出电压点
        {   0      ,   1     ,   1        }   , // 62    8510    电网相序类型(8048不使用)
        {   0      ,   1     ,   1        }   , // 63    8511    IT系统
        {   1000   ,   1001  ,   1        }   , // 64    8512    并网法规设置
        {   0      ,   2     ,   0        }   , // 65    8513    额定输出电压 0:230 1:220 2:240 3:200 4:120 5:127
        {   0      ,   1     ,   1        }   , // 66    8514    额定输出频率
        {   0      ,   8000  ,   1        }   , // 67    8515    机器额定容量
        {   0      ,   3     ,   1        }   , // 68    8516    工作模式
        {   0      ,   1     ,   1        }   , // 69    8517    防逆流 to Load卖电使能
        {   0      ,   1     ,   1        }   , // 70    8518    防逆流 to CT  卖电使能
        {   0      ,   6000  ,   1        }   , // 71    8519    电网最大卖电功率
        {   0      ,   1     ,   1        }   , // 72    8520    电网最大输入功率限制使能
        {   1000   ,   65000 ,   1        }   , // 73    8521    电网最大输入功率
        {   0      ,   500   ,   1        }   , // 74    8522    防逆流功率回差
        {   0      ,   1     ,   1        }   , // 75    8523    防逆流方式选择
        {   58336  ,   7200  ,   1        }   , // 76    8524    调度模式有功功率给定
        {   0      ,   1     ,   1        }   , // 77    8525    能量优先级
        {   0      ,   5     ,   1        }   , // 78    8526    无功控制模式
        {   62536  ,   3000  ,   1        }   , // 79    8527    无功功率给定
        {   65436  ,   100   ,   100      }   , // 80    8528    功率因数给定
        {   1      ,   6000  ,   1        }   , // 81    8529    有功功率变化率
        {   1      ,   6000  ,   1        }   , // 82    8530    无功功率变化率
        {   1      ,   6000  ,   1        }   , // 83    8531    开机斜率
        {   1      ,   50000 ,   100      }   , // 84    8532    重合闸斜率 1%~50000%/s
        {   1      ,   600   ,   1        }   , // 85    8533    重合闸时间
        {   0      ,   1     ,   1        }   , // 86    8534    DRM使能
        {   100    ,   10000 ,   1        }   , // 87    8535    CT变比设置
        {   0      ,   1     ,   1        }   , // 88    8536    漏电流GFCI保护使能
        {   0      ,   300   ,   1        }   , // 89    8537    漏电流GFCI保护阀值
        {   0      ,   1     ,   1        }   , // 90    8538    绝缘阻抗检测使能
        {   0      ,   2000  ,   1        }   , // 91    8539    绝缘阻抗检测阀值
        {   0      ,   1     ,   1        }   , // 92    8540    主动孤岛保护使能
        {   65516  ,   20    ,   1        }   , // 93    8541    离网电压补偿
        {   0      ,   1     ,   1        }   , // 94    8542    不对称相馈电使能
        {   0      ,   2     ,   1        }   , // 95    8543    通讯信号保护选择
        {   0      ,   30000 ,   1        }   , // 96    8544    BackUp延迟 Unit: ms
        {   0      ,   1     ,   1        }   , // 97    8545    Signal island mode
        {   0      ,   1     ,   1        }   , // 98    8546    外部Meter作为CT
        {   0      ,   1     ,   1        }   , // 99    8547    黑启动使能
        {   0      ,   1     ,   1        }   , // 100   8548    负载继电器断开控制
        {   0      ,   600   ,   1        }   , // 101   8549    启动等待时间 Unit: 1S
        {   0      ,   6     ,   1        }   , // 102   8550    Meter Select
        {   0      ,   2     ,   1        }   , // 103   8551    电表波特率选择(目前50K使用)
        {   0      ,   7     ,   1        }   , // 104   8552    设置电表相位(根据系统中安装的电表选择相应的电表挂靠相位？) bit0:A bit1:B bit2:C
        {   0      ,   1     ,   1        }   , // 105   8553    电网侧电表2(AC couple使用)
        {   0      ,   3     ,   1        }   , // 106   8554    F(P)功频响应模式使能
        {   0      ,   1     ,   1        }   , // 107   8555    F(P)功频出力变化基准
        {   1      ,   50000 ,   1000     }   , // 108   8556    F(P)功频响应速率
        {   0      ,   2000  ,   0        }   , // 109   8557    F(P)功频响应延时
        {   1      ,   50000 ,   1000     }   , // 110   8558    F(P)功频退出速率
        {   0      ,   2000  ,   0        }   , // 111   8559    F(P)功频退出延时
        {   65036  ,   500   ,   1        }   , // 112   8560    F(P)过频降额系数
        {   5000   ,   6500  ,   100      }   , // 113   8561    F(P)过频降额起点
        {   5000   ,   6500  ,   100      }   , // 114   8562    F(P)过频降额终点
        {   5000   ,   6500  ,   100      }   , // 115   8563    F(P)过频降额退出点
        {   0      ,   110   ,   100      }   , // 116   8564    F(P)过频降额限值
        {   65036  ,   500   ,   1        }   , // 117   8565    F(P)欠频升额系数
        {   4500   ,   6000  ,   100      }   , // 118   8566    F(P)欠频升额起点
        {   4500   ,   6000  ,   100      }   , // 119   8567    F(P)欠频升额终点
        {   4500   ,   6000  ,   100      }   , // 120   8568    F(P)欠频升额退出点
        {   0      ,   110   ,   1        }   , // 121   8569    F(P)欠频升额限值
        {   0      ,   1     ,   1        }   , // 122   8570    U(Q)工作模式
        {   100    ,   120   ,   1        }   , // 123   8571    U(Q)电压上升起点
        {   100    ,   120   ,   1        }   , // 124   8572    U(Q)电压上升终点
        {   65436  ,   100   ,   1        }   , // 125   8573    U(Q)无功上升起点
        {   0      ,   100   ,   1        }   , // 126   8574    U(Q)无功上升终点
        {   80     ,   100   ,   1        }   , // 127   8575    U(Q)电压下降起点
        {   80     ,   100   ,   1        }   , // 128   8576    U(Q)电压下降终点
        {   65436  ,   100   ,   1        }   , // 129   8577    U(Q)无功下降起点
        {   0      ,   100   ,   1        }   , // 130   8578    U(Q)无功下降终点
        {   65436  ,   100   ,   1        }   , // 131   8579    U(Q)无功PLock_IN
        {   65436  ,   100   ,   1        }   , // 132   8580    U(Q)无功PLock_OUT
        {   0      ,   1     ,   0        }   , // 133   8581    U(P)过压降额模式使能
        {   100    ,   140   ,   1        }   , // 134   8582    U(P)过压降额电压点A
        {   100    ,   140   ,   1        }   , // 135   8583    U(P)过压降额电压点B
        {   100    ,   140   ,   1        }   , // 136   8584    U(P)过压降额电压点C
        {   100    ,   140   ,   1        }   , // 137   8585    U(P)过压降额电压点D
        {   0      ,   110   ,   1        }   , // 138   8586    U(P)过压降额有功点A
        {   0      ,   110   ,   1        }   , // 139   8587    U(P)过压降额有功点B
        {   0      ,   110   ,   1        }   , // 140   8588    U(P)过压降额有功点C
        {   0      ,   110   ,   1        }   , // 141   8589    U(P)过压降额有功点D
        {   1      ,   50000 ,   10       }   , // 142   8590    U(P)过压降额滤波时间常数
        {   1      ,   50000 ,   10       }   , // 143   8591    P(Q)有功无功调节滤波时间常数
        {   0      ,   1     ,   1        }   , // 144   8592    P(Q)有功无功调节模式使能
        {   0      ,   100   ,   1        }   , // 145   8593    P(Q)有功点A
        {   0      ,   100   ,   1        }   , // 146   8594    P(Q)有功点B
        {   0      ,   100   ,   1        }   , // 147   8595    P(Q)有功点C
        {   0      ,   100   ,   1        }   , // 148   8596    P(Q)有功点D
        {   65436  ,   100   ,   1        }   , // 149   8597    P(Q)无功点A
        {   65436  ,   100   ,   1        }   , // 150   8598    P(Q)无功点B
        {   65436  ,   100   ,   1        }   , // 151   8599    P(Q)无功点C
        {   65436  ,   100   ,   1        }   , // 152   8600    P(Q)无功点D
        {   0      ,   1     ,   0        }   , // 153   8601    P(PF)有功功因使能
        {   0      ,   100   ,   20       }   , // 154   8602    P(PF)有功点A
        {   0      ,   100   ,   40       }   , // 155   8603    P(PF)有功点B
        {   0      ,   100   ,   60       }   , // 156   8604    P(PF)有功点C
        {   0      ,   100   ,   80       }   , // 157   8605    P(PF)有功点D
        {   65436  ,   100   ,   100      }   , // 158   8606    P(PF)功因点A
        {   65436  ,   100   ,   100      }   , // 159   8607    P(PF)功因点B
        {   65436  ,   100   ,   100      }   , // 160   8608    P(PF)功因点C
        {   65436  ,   100   ,   100      }   , // 161   8609    P(PF)功因点D
        {   0      ,   100   ,   1        }   , // 162   8610    P(PF)有功Lock_IN
        {   0      ,   100   ,   1        }   , // 163   8611    P(PF)有功Lock_OUT
        {   0      ,   1     ,   0        }   , // 164   8612    U(PF)电压功因模式使能
        {   0      ,   120   ,   1        }   , // 165   8613    U(PF)电压上升起点
        {   0      ,   120   ,   1        }   , // 166   8614    U(PF)电压上升终点
        {   65436  ,   100   ,   1        }   , // 167   8615    U(PF)功因下降起点
        {   65436  ,   100   ,   1        }   , // 168   8616    U(PF)功因下降终点
        {   0      ,   1     ,   0        }   , // 169   8617    F(G)电网适应性使能
        {   4500   ,   6000  ,   100      }   , // 170   8618    F(G)欠频转放电频率点
        {   0      ,   100   ,   1        }   , // 171   8619    F(G)欠频转放电限值
        {   5000   ,   6500  ,   100      }   , // 172   8620    F(G)过频转充电频率点
        {   65436  ,   0     ,   65535    }   , // 173   8621    F(G)过频转充电限值
        {   0      ,   150   ,   1        }   , // 174   8622    F(G)过压转充电电压点
        {   65426  ,   110   ,   1        }   , // 175   8623    F(G)过压转充电功率限值
        {   2200   ,   2900  ,   1        }   , // 176   8624    正常连接过压
        {   900    ,   2000  ,   1        }   , // 177   8625    正常连接欠压
        {   5000   ,   6500  ,   100      }   , // 178   8626    正常连接过频
        {   4000   ,   6000  ,   100      }   , // 179   8627    正常连接欠频
        {   2200   ,   2900  ,   1        }   , // 180   8628    重连过压
        {   900    ,   2000  ,   1        }   , // 181   8629    重连欠压
        {   5000   ,   6500  ,   100      }   , // 182   8630    重连过频
        {   4000   ,   6000  ,   100      }   , // 183   8631    重连欠频
        {   0      ,   1     ,   1        }   , // 184   8632    强制离网使能(SBU功能)
        {   0      ,   65535 ,   1        }   , // 185   8633    预留185
        {   0      ,   65535 ,   1        }   , // 186   8634    预留186
        {   0      ,   65535 ,   1        }   , // 187   8635    预留187
        {   0      ,   65535 ,   1        }   , // 188   8636    预留188
        {   0      ,   65535 ,   1        }   , // 189   8637    预留189
        {   0      ,   1     ,   1        }   , // 190   8638    低电压穿越使能
        {   0      ,   400   ,   1        }   , // 191   8639    LVRT动态无功Kf因子
        {   0      ,   1     ,   0        }   , // 192   8640    高电压穿越使能
        {   0      ,   400   ,   1        }   , // 193   8641    HVRT动态无功Kf因子
        {   5      ,   90    ,   1        }   , // 194   8642    LVRT电压1
        {   0      ,   65535 ,   1        }   , // 195   8643    LVRT_T1
        {   5      ,   90    ,   1        }   , // 196   8644    LVRT电压2
        {   0      ,   65535 ,   1        }   , // 197   8645    LVRT_T2
        {   5      ,   90    ,   1        }   , // 198   8646    LVRT电压3
        {   0      ,   65535 ,   1        }   , // 199   8647    LVRT_T3
        {   5      ,   90    ,   1        }   , // 200   8648    LVRT电压4
        {   0      ,   65535 ,   1        }   , // 201   8649    LVRT_T4
        {   5      ,   90    ,   1        }   , // 202   8650    LVRT电压5
        {   0      ,   65535 ,   1        }   , // 203   8651    LVRT_T5
        {   110    ,   140   ,   1        }   , // 204   8652    HVRT电压1
        {   0      ,   65535 ,   1        }   , // 205   8653    HVRT_T1
        {   110    ,   140   ,   1        }   , // 206   8654    HVRT电压2
        {   0      ,   65535 ,   1        }   , // 207   8655    HVRT_T2
        {   110    ,   140   ,   1        }   , // 208   8656    HVRT电压3
        {   0      ,   65535 ,   1        }   , // 209   8657    HVRT_T3
        {   110    ,   140   ,   1        }   , // 210   8658    HVRT电压4
        {   0      ,   65535 ,   1        }   , // 211   8659    HVRT_T4
        {   110    ,   140   ,   1        }   , // 212   8660    HVRT电压5
        {   0      ,   65535 ,   1        }   , // 213   8661    HVRT_T5
        {   0      ,   65535 ,   1        }   , // 214   8662    预留
        {   0      ,   65535 ,   1        }   , // 215   8663    预留
        {   0      ,   65535 ,   1        }   , // 216   8664    预留
        {   0      ,   65535 ,   1        }   , // 217   8665    预留
        {   2200   ,   2900  ,   1        }   , // 218   8666    电网过压1段(V)
        {   0      ,   65535 ,   1        }   , // 219   8667    电网过压1段时间(10ms)
        {   2200   ,   2640  ,   1        }   , // 220   8668    电网过压2段(V)
        {   0      ,   65535 ,   1        }   , // 221   8669    电网过压2段时间(10ms)
        {   105    ,   150   ,   1        }   , // 222   8670    电网过压3段(%)
        {   0      ,   65535 ,   1        }   , // 223   8671    电网过压3段时间(10ms)
        {   105    ,   150   ,   1        }   , // 224   8672    电网过压4段(%)
        {   0      ,   65535 ,   1        }   , // 225   8673    电网过压4段时间(10ms)
        {   105    ,   150   ,   1        }   , // 226   8674    电网过压5段(%)
        {   0      ,   65535 ,   1        }   , // 227   8675    电网过压5段时间(10ms)
        {   900    ,   2000  ,   1        }   , // 228   8676    电网欠压1段(V)
        {   0      ,   65535 ,   1        }   , // 229   8677    电网欠压1段时间(10ms)
        {   900    ,   2000  ,   1        }   , // 230   8678    电网欠压2段(V)
        {   0      ,   65535 ,   1        }   , // 231   8679    电网欠压2段时间(10ms)
        {   10     ,   95    ,   1        }   , // 232   8680    电网欠压3段(%)
        {   0      ,   65535 ,   1        }   , // 233   8681    电网欠压3段时间(10ms)
        {   10     ,   95    ,   1        }   , // 234   8682    电网欠压4段(%)
        {   0      ,   65535 ,   1        }   , // 235   8683    电网欠压4段时间(10ms)
        {   10     ,   95    ,   1        }   , // 236   8684    电网欠压5段(%)
        {   0      ,   65535 ,   1        }   , // 237   8685    电网欠压5段时间(10ms)
        {   3      ,   20    ,   1        }   , // 238   8686    电网电压不平衡保护值
        {   0      ,   65535 ,   1        }   , // 239   8687    电网电压不平衡保护时间
        {   4000   ,   6500  ,   1        }   , // 240   8688    电网过频1段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 241   8689    电网过频1段时间(10ms)
        {   4000   ,   6500  ,   1        }   , // 242   8690    电网过频2段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 243   8691    电网过频2段时间(10ms)
        {   5000   ,   6500  ,   1        }   , // 244   8692    电网过频3段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 245   8693    电网过频3段时间(10ms)
        {   5000   ,   6500  ,   1        }   , // 246   8694    电网过频4段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 247   8695    电网过频4段时间(10ms)
        {   5000   ,   6500  ,   1        }   , // 248   8696    电网过频5段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 249   8697    电网过频5段时间(1ms)
        {   4000   ,   6000  ,   1        }   , // 250   8698    电网欠频1段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 251   8699    电网欠频1段时间(10ms)
        {   4000   ,   6000  ,   1        }   , // 252   8700    电网欠频2段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 253   8701    电网欠频2段时间(10ms)
        {   4500   ,   6000  ,   1        }   , // 254   8702    电网欠频3段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 255   8703    电网欠频3段时间(10ms)
        {   4500   ,   6000  ,   1        }   , // 256   8704    电网欠频4段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 257   8705    电网欠频4段时间(10ms)
        {   4500   ,   6000  ,   1        }   , // 258   8706    电网欠频5段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 259   8707    电网欠频5段时间(10ms)
        {   0      ,   1     ,   0        }   , // 260   8708    电网10min过压使能
        {   105    ,   130   ,   0        }   , // 261   8709    电网10min过压阈值 unit:1%
        {   0      ,   600   ,   0        }   , // 262   8710    电网10min过压时间 unit:1s
        {   0      ,   1     ,   0        }   , // 263   8711    经济模式使能
        {   0      ,   65535 ,   1        }   , // 264   8712    生效星期
        {   0      ,   1     ,   1        }   , // 265   8713    规则1电网充电使能
        {   0      ,   1     ,   1        }   , // 266   8714    规则1油机充电使能
        {   0      ,   65535 ,   1        }   , // 267   8715    规则1起始时间
        {   0      ,   65535 ,   1        }   , // 268   8716    规则1结束时间
        {   400    ,   600   ,   10       }   , // 269   8717    规则1目标电压
        {   0      ,   100   ,   1        }   , // 270   8718    规则1目标SOC（BMS连接采用）
        {   0      ,   6000  ,   1        }   , // 271   8719    规则1放电功率
        {   0      ,   1     ,   1        }   , // 272   8720    规则2电网充电使能
        {   0      ,   1     ,   1        }   , // 273   8721    规则2油机充电使能
        {   0      ,   65535 ,   1        }   , // 274   8722    规则2起始时间
        {   0      ,   65535 ,   1        }   , // 275   8723    规则2结束时间
        {   400    ,   600   ,   10       }   , // 276   8724    规则2目标电压
        {   0      ,   100   ,   1        }   , // 277   8725    规则2目标SOC（BMS连接采用）
        {   0      ,   6000  ,   1        }   , // 278   8726    规则2放电功率
        {   0      ,   1     ,   1        }   , // 279   8727    规则3电网充电使能
        {   0      ,   1     ,   1        }   , // 280   8728    规则3油机充电使能
        {   0      ,   65535 ,   1        }   , // 281   8729    规则3起始时间
        {   0      ,   65535 ,   1        }   , // 282   8730    规则3结束时间
        {   400    ,   600   ,   10       }   , // 283   8731    规则3目标电压
        {   0      ,   100   ,   1        }   , // 284   8732    规则3目标SOC（BMS连接采用）
        {   0      ,   6000  ,   1        }   , // 285   8733    规则3放电功率
        {   0      ,   1     ,   0        }   , // 286   8734    规则4电网充电使能
        {   0      ,   1     ,   0        }   , // 287   8735    规则4油机充电使能
        {   0      ,   65535 ,   1        }   , // 288   8736    规则4起始时间
        {   0      ,   65535 ,   1        }   , // 289   8737    规则4结束时间
        {   400    ,   600   ,   10       }   , // 290   8738    规则4目标电压
        {   0      ,   100   ,   1        }   , // 291   8739    规则4目标SOC（BMS连接采用）
        {   0      ,   6000  ,   1        }   , // 292   8740    规则4放电功率
        {   0      ,   1     ,   1        }   , // 293   8741    规则5电网充电使能
        {   0      ,   1     ,   1        }   , // 294   8742    规则5油机充电使能
        {   0      ,   65535 ,   1        }   , // 295   8743    规则5起始时间
        {   0      ,   65535 ,   1        }   , // 296   8744    规则5结束时间
        {   400    ,   600   ,   10       }   , // 297   8745    规则5目标电压
        {   0      ,   100   ,   1        }   , // 298   8746    规则5目标SOC（BMS连接采用）
        {   0      ,   6000  ,   1        }   , // 299   8747    规则5放电功率
        {   0      ,   1     ,   1        }   , // 300   8748    规则6电网充电使能
        {   0      ,   1     ,   1        }   , // 301   8749    规则6油机充电使能
        {   0      ,   65535 ,   1        }   , // 302   8750    规则6起始时间
        {   0      ,   65535 ,   1        }   , // 303   8751    规则6结束时间
        {   400    ,   600   ,   10       }   , // 304   8752    规则6目标电压
        {   0      ,   100   ,   1        }   , // 305   8753    规则6目标SOC（BMS连接采用）
        {   0      ,   6000  ,   1        }   , // 306   8754    规则6放电功率
        {   0      ,   65535 ,   1        }   , // 307   8755    预留
        {   0      ,   65535 ,   1        }   , // 308   8756    预留
        {   0      ,   65535 ,   1        }   , // 309   8757    预留
        {   0      ,   65535 ,   1        }   , // 310   8758    预留
        {   0      ,   2     ,   1        }   , // 311   8759    油机模式
        {   500    ,   30000 ,   1        }   , // 312   8760    油机输入额定功率
        {   0      ,   1     ,   1        }   , // 313   8761    油机输入功率限制使能位
        {   0      ,   1     ,   1        }   , // 314   8762    油机接入电网端口使能位
        {   0      ,   1     ,   1        }   , // 315   8763    智能负载常闭使能位
        {   410    ,   600   ,   10       }   , // 316   8764    智能负载闭合电池电压点
        {   410    ,   600   ,   10       }   , // 317   8765    智能负载断开电池电压点
        {   0      ,   100   ,   1        }   , // 318   8766    智能负载闭合电池SOC点
        {   0      ,   100   ,   1        }   , // 319   8767    智能负载断开电池SOC点
        {   5000   ,   6500  ,   1        }   , // 320   8768    AC_Couple频率顶高值
        {   0      ,   1     ,   1        }   , // 321   8769    AC_Couple停止馈电使能
        {   0      ,   2     ,   1        }   , // 322   8770    AC_Couple到电网侧或者负载侧
        {   400    ,   600   ,   10       }   , // 323   8771    微逆闭合电池电压点
        {   400    ,   600   ,   10       }   , // 324   8772    微逆断开电池电压点
        {   0      ,   100   ,   1        }   , // 325   8773    微逆闭合电池SOC点
        {   0      ,   100   ,   1        }   , // 326   8774    微逆断开电池SOC点
        {   0      ,   5500  ,   1        }   , // 327   8775    智能负载闭合PV功率
        {   0      ,   1     ,   1        }   , // 328   8776    离网立即断开智能负载
        {   0      ,   65535 ,   1        }   , // 329   8777    预留329
        {   2200   ,   2900  ,   1        }   , // 330   8778    油机过压1段(V)
        {   0      ,   65535 ,   1        }   , // 331   8779    油机过压1段时间(10ms)
        {   2200   ,   2640  ,   1        }   , // 332   8780    油机过压2段(V)
        {   0      ,   65535 ,   1        }   , // 333   8781    油机过压2段时间(10ms)
        {   900    ,   2000  ,   1        }   , // 334   8782    油机欠压1段(V)
        {   0      ,   65535 ,   1        }   , // 335   8783    油机欠压1段时间(10ms)
        {   900    ,   2000  ,   1        }   , // 336   8784    油机欠压2段(V)
        {   0      ,   65535 ,   1        }   , // 337   8785    油机欠压2段时间(10ms)
        {   4000   ,   6500  ,   1        }   , // 338   8786    油机过频1段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 339   8787    油机过频1段时间(10ms)
        {   4000   ,   6500  ,   1        }   , // 340   8788    油机过频2段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 341   8789    油机过频2段时间(10ms)
        {   4000   ,   6000  ,   1        }   , // 342   8790    油机欠频1段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 343   8791    油机欠频1段时间(10ms)
        {   4000   ,   6000  ,   1        }   , // 344   8792    油机欠频2段(0.01Hz)
        {   0      ,   65535 ,   1        }   , // 345   8793    油机欠频2段时间(10ms)
        {   0      ,   65535 ,   1        }   , // 346   8794    Debug 模式使能位1
        {   0      ,   65535 ,   1        }   , // 347   8795    Debug 模式使能位2
        {   0      ,   65535 ,   1        }   , // 348   8796    Debug PWM驱动使能位
        {   0      ,   65535 ,   1        }   , // 349   8797    Debug 继电器驱动使能位
        {   0      ,   1     ,   1        }   , // 350   8798    电网最大输入电流限制使能
        {   100    ,   500   ,   10       }   , // 351   8799    电网最大输入电流峰值
        {   0      ,   65535 ,   1        }   , // 352   8800    智能负载启动时间
        {   0      ,   65535 ,   1        }   , // 353   8801    智能负载停止时间
        {   0      ,   0xFFFF,   1        }   , // 354   8802    智能负载最大输出时间
        {   500    ,   12000 ,   1        }   , // 355   8803    电网最大馈入功率限定
        {   100    ,   32000 ,   1        }   , // 356   8804    电网最大输入功率限定
        {   0      ,   1     ,   1        }   , // 357   8805    静音模式使能
        {   0      ,   1     ,   1        }   , // 358   8806    低功耗模式使能
        {   0      ,   1     ,   1        }   , // 359   8807    MPPT阴影扫描使能
        {   0      ,   65535 ,   1        }   , // 360   8808    预留360
        {   0      ,   65535 ,   1        }   , // 361   8809    预留361
        {   0      ,   65535 ,   1        }   , // 362   8810    预留362
        {   0      ,   65535 ,   1        }   , // 363   8811    预留363
        {   0      ,   65535 ,   1        }   , // 364   8812    预留364
        {   0      ,   65535 ,   1        }   , // 365   8813    预留365
        {   8000   ,   12000 ,   10000    }   , // 366   8814    PV1电压校准系数
        {   0      ,   65535 ,   1        }   , // 367   8815    PV1电压校准偏置
        {   8000   ,   12000 ,   10000    }   , // 368   8816    PV2电压校准系数
        {   0      ,   65535 ,   1        }   , // 369   8817    PV2电压校准偏置
        {   8000   ,   12000 ,   10000    }   , // 370   8818    PV3电压校准系数
        {   0      ,   65535 ,   1        }   , // 371   8819    PV3电压校准偏置
        {   8000   ,   12000 ,   10000    }   , // 372   8820    PV4电压校准系数
        {   0      ,   65535 ,   1        }   , // 373   8821    PV4电压校准偏置
        {   8000   ,   12000 ,   10000    }   , // 374   8822    PV1电流校准系数
        {   0      ,   65535 ,   1        }   , // 375   8823    PV1电流校准偏置
        {   8000   ,   12000 ,   10000    }   , // 376   8824    PV2电流校准系数
        {   0      ,   65535 ,   1        }   , // 377   8825    PV2电流校准偏置
        {   8000   ,   12000 ,   10000    }   , // 378   8826    PV3电流校准系数
        {   0      ,   65535 ,   1        }   , // 379   8827    PV3电流校准偏置
        {   8000   ,   12000 ,   10000    }   , // 380   8828    PV4电流校准系数
        {   0      ,   65535 ,   1        }   , // 381   8829    PV4电流校准偏置
        {   8000   ,   12000 ,   10000    }   , // 382   8830    电池电压1校准系数
        {   0      ,   65535 ,   1        }   , // 383   8831    电池电压1校准偏置
        {   8000   ,   12000 ,   10000    }   , // 384   8832    电池电压2校准系数
        {   0      ,   65535 ,   1        }   , // 385   8833    电池电压2校准偏置
        {   8000   ,   12000 ,   10000    }   , // 386   8834    BAT电流1校准系数
        {   0      ,   65535 ,   1        }   , // 387   8835    BAT电流1校准偏置
        {   8000   ,   12000 ,   10000    }   , // 388   8836    BAT电流2校准系数
        {   0      ,   65535 ,   1        }   , // 389   8837    BAT电流2校准偏置
        {   8000   ,   12000 ,   10000    }   , // 390   8838    PBUS电压校准系数
        {   0      ,   65535 ,   1        }   , // 391   8839    PBUS电压校准偏置
        {   8000   ,   12000 ,   10000    }   , // 392   8840    NBUS电压校准系数
        {   0      ,   65535 ,   1        }   , // 393   8841    NBUS电压校准偏置
        {   8000   ,   12000 ,   10000    }   , // 394   8842    U相油机电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 395   8843    V相油机电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 396   8844    W相油机电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 397   8845    U相电网电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 398   8846    V相电网电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 399   8847    W相电网电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 400   8848    A相逆变电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 401   8849    B相逆变电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 402   8850    C相逆变电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 403   8851    A相逆变电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 404   8852    B相逆变电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 405   8853    C相逆变电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 406   8854    U相电网电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 407   8855    V相电网电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 408   8856    W相电网电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 409   8857    U相外部CT电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 410   8858    V相外部CT电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 411   8859    W相外部CT电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 412   8860    R相发电机电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 413   8861    S相发电机电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 414   8862    T相发电机电流校准系数
        {   8000   ,   12000 ,   10000    }   , // 415   8863    放电量校准高位
        {   8000   ,   12000 ,   10000    }   , // 416   8864    放电量校准低位
        {   8000   ,   12000 ,   10000    }   , // 417   8865    充电量校准高位
        {   8000   ,   12000 ,   10000    }   , // 418   8866    充电量校准低位
        {   8000   ,   12000 ,   10000    }   , // 419   8867    R相负载电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 420   8868    S相负载电压校准系数
        {   8000   ,   12000 ,   10000    }   , // 421   8869    T相负载电压校准系数
        {   eSingleSeries      ,   eSingleSeries ,   1        }   , // 422   8870    设备子类
        {   0      ,   65535 ,   1        }   , // 423   8871    预留    母线电压给定
        {   0      ,   65535 ,   1        }   , // 424   8872    预留    BuckBoost电压环Kp
        {   0      ,   65535 ,   1        }   , // 425   8873    预留    BuckBoost电压环Ki
        {   0      ,   65535 ,   1        }   , // 426   8874    预留    BuckBoost电流环Kp
        {   0      ,   65535 ,   1        }   , // 427   8875    预留    BuckBoost电流环Ki
        {   0      ,   65535 ,   1        }   , // 428   8876    预留    输出电压给定
        {   0      ,   65535 ,   1        }   , // 429   8877    预留    有效值环Kp
        {   0      ,   65535 ,   1        }   , // 430   8878    预留    有效值环Ki
        {   0      ,   65535 ,   1        }   , // 431   8879    预留    瞬时电压环Kp
        {   0      ,   65535 ,   1        }   , // 432   8880    预留    瞬时电压环Ki
        {   0      ,   65535 ,   1        }   , // 433   8881    预留    瞬时电流环Kp
        {   0      ,   65535 ,   1        }   , // 434   8882    预留    瞬时电流环Ki
        {   0      ,   65535 ,   1        }   , // 435   8883    预留    电流前馈系数
        {   0      ,   65535 ,   1        }   , // 436   8884    预留    并网功率外环Kp
        {   0      ,   65535 ,   1        }   , // 437   8885    预留    并网功率外环Ki
        {   0      ,   65535 ,   1        }   , // 438   8886    预留    并网电流内环Kp
        {   0      ,   65535 ,   1        }   , // 439   8887    预留    平衡环路电压环Kp
        {   0      ,   65535 ,   1        }   , // 440   8888    预留    平衡环路电压环Ki
        {   0      ,   65535 ,   1        }   , // 441   8889    预留    平衡环路电流环Kp
        {   0      ,   65535 ,   1        }   , // 442   8890    预留    平衡环路电流环Ki
        {   0      ,   65535 ,   1        }   , // 443   8891    预留
        {   0      ,   65535 ,   1        }   , // 444   8892    预留
        {   0      ,   65535 ,   1        }   , // 445   8893    预留
        {   0      ,   65535 ,   1        }   , // 446   8894    预留
        {   0      ,   65535 ,   1        }   , // 447   8895    预留
        {   0      ,   65535 ,   1        }   , // 448   8896    预留
        {   0      ,   65535 ,   1        }   , // 449   8897    预留
        {   0      ,   65535 ,   1        }   , // 450   8898    预留
        {   0      ,   65535 ,   1        }   , // 451   8899    预留
        {   0      ,   65535 ,   1        }   , // 452   8900    预留
        {   0      ,   65535 ,   1        }   , // 453   8901    预留
        {   0      ,   65535 ,   1        }   , // 454   8902    预留
        {   0      ,   65535 ,   1        }   , // 455   8903    预留
        {   0      ,   65535 ,   1        }   , // 456   8904    预留
        {   0      ,   65535 ,   1        }   , // 457   8905    预留
        {   0      ,   1     ,   1        }   , // 458   8906    IVGM15048用来区分研发调试模式还是监控模式  eSciFuncSelectSetID
        {   0      ,   65535 ,   1        }   , // 459   8907    机器序列号1
        {   0      ,   65535 ,   1        }   , // 460   8908    机器序列号2
        {   0      ,   65535 ,   1        }   , // 461   8909    机器序列号3
        {   0      ,   65535 ,   1        }   , // 462   8910    机器序列号4
        {   0      ,   65535 ,   1        }   , // 463   8911    机器序列号5
        {   0      ,   65535 ,   1        }   , // 464   8912    机器序列号长度
        {   0      ,   65535 ,   1        }   , // 465   8913    ATE写显示板版本号
        {   0      ,   65535 ,   1        }   , // 466   8914    ATE写控制板版本号
        {   0      ,   65535 ,   1        }   , // 467   8915    ATE写功率板版本号
        {   0      ,   65535 ,   1        }   , // 468   8916    升级固件
        {   0      ,   65535 ,   1        }   , // 469   8917    复位重启
        {   0      ,   65535 ,   1        }   , // 470   8918    EE恢复默认值
        {   0      ,   65535 ,   1        }   , // 471   8919    老化模式
        {   0      ,   65535 ,   1        }   , // 472   8920    远程控制开关
        {   0      ,   65535 ,   1        }   , // 473   8921    EE恢复出厂设置
        {   0      ,   65535 ,   1        }   , // 474   8922    老化电池启动电压
        {   0      ,   65535 ,   1        }   , // 475   8923    老化电池放电电流
        {   0      ,   65535 ,   1        }   , // 476   8924    老化最大PV功率
        {   0      ,   65535 ,   1        }   , // 477   8925    老化最大逆变功率
        {   0      ,   65535 ,   1        }   , // 478   8926    MPPT电压点控制
        {   0      ,   65535 ,   1        }   , // 479   8927    发电量发电时间清零设置
        {   0      ,   65535 ,   1        }   , // 480   8928    安规设置
        {   0      ,   65535 ,   1        }   , // 481   8929    绝缘阻抗设置
        {   0      ,   65535 ,   1        }   , // 482   8930    电表协议选择
        {   0      ,   65535 ,   1        }   , // 483   8931    Wifi通讯地址和波特率
        {   0      ,   65535 ,   1        }   , // 484   8932    与电表通讯波特率和校验位
        {   0      ,   65535 ,   1        }   , // 485   8933    与电表通讯地址
        {   0      ,   65535 ,   1        }   , // 486   8934    电表使能写，禁止读
        {   0      ,   65535 ,   1        }   , // 487   8935    电表Modbus地址
        {   0      ,   65535 ,   1        }   , // 488   8936    电表数据
        {   0      ,   65535 ,   1        }   , // 489   8937    485通讯地址和波特率
        {   0      ,   1     ,   1        }   , // 490   8938    LCD背光
        {   0      ,   1     ,   1        }   , // 491   8939    蜂鸣器
        {   1      ,   15    ,   1        }   , // 492   8940    电池包地址
        {   0      ,   1     ,   1        }   , // 493   8941    清除事件记录
        {   0      ,   1     ,   1        }   , // 494   8942    事件记录功能
        {   0      ,   1     ,   1        }   , // 495   8943    故障记录功能
        {   0      ,   1     ,   1        }   , // 496   8944    Log查询类型
        {   0      ,   9     ,   1        }   , // 497   8945    Log索引

};

//------------------------------------------------------------------------------
//注：如实际应用为有符号的负数，则需先转成无符号型再填入下表中，如：-1为65535，-10为65526；
const Uint16 uiDefaultData[eSetDataEndAdd + 1] =
{
    1       , // 0     8448    机器地址设置
    0       , // 1     8449    Dsp并机使能
    1       , // 2     8450    主从机设置
    1       , // 3     8451    Eeprom自动写入
    0       , // 4     8452    并机相位选择
    0       , // 5     8453    电网类型  0-单相；1-3相；2-预留
    0       , // 6     8454    ATS功能
    0       , // 7     8455    ATS使能
    9600    , // 8     8456    PV最大输入功率
    0       , // 9     8457    PV并联使能
    90      , // 10    8458    PV1启动电压
    90      , // 11    8459    PV2启动电压
    90      , // 12    8460    PV3启动电压
    90      , // 13    8461    PV4启动电压
    0       , // 14    8462    PV_AFCI检测使能
    0       , // 15    8463    预留
    0       , // 16    8464    预留
    0       , // 17    8465    清除ARC故障
    4       , // 18    8466    电池1节数
    4       , // 19    8467    电池2节数
    0       , // 20    8468    电池AFCI检测使能
    0       , // 21    8469    电池模式
    300     , // 22    8470    电池1容量
    600     , // 23    8471    电池1最大充电电流限幅值
    1350    , // 24    8472    电池1最大放电电流限幅值
    1       , // 25    8473    电池1激活使能
    0       , // 26    8474    BMS通讯故障使能
    0       , // 27    8475    电池并联使能
    0       , // 28    8476    锂电BMS协议
    0       , // 29    8477    电网启动信号
    0       , // 30    8478    油机最小运行时间
    0       , // 31    8479    油机强制运行
    30      , // 32    8480    并网时电池自动启动充电SOC点
    95      , // 33    8481    并网时电池自动退出充电SOC点
    30      , // 34    8482    并油机时电池自动启动充电SOC点
    95      , // 35    8483    并油机时电池自动退出充电SOC点
    400     , // 36    8484    电网给电池充电电流
    400     , // 37    8485    油机给电池充电电流
    1       , // 38    8486    油机启动信号
    1       , // 39    8487    电网充电总使能
    0       , // 40    8488    油机充电总使能
    240     , // 41    8489    油机最大运行时间
    490     , // 42    8490    并网时电池1自动启动充电电压点
    552     , // 43    8491    并网时电池1自动退出充电电压点
    490     , // 44    8492    并油机时电池1自动启动充电电压点
    552     , // 45    8493    并油机时电池1自动退出充电电压点
    0       , // 46    8494    禁止浮充
    576     , // 47    8495    电池均衡充电电压
    0       , // 48    8496    电池均衡充电间隔天数
    0       , // 49    8497    电池均衡充电时间
    0       , // 50    8498    预留
    576     , // 51    8499    电池吸收电压 //铅酸单体额定2.0V, EOD为1.5V, 满充为2.4V
    552     , // 52    8500    电池1浮充电压
    0       , // 53    8501    电池温度系数
    1       , // 54    8502    电池阻抗
    520     , // 55    8503    电池1重启AC输出电压点
    475     , // 56    8504    电池1低压告警电压点
    460     , // 57    8505    电池1低压关机电压点
    40      , // 58    8506    电池重启AC输出SOC点
    20      , // 59    8507    电池低压告警SOC点
    10      , // 60    8508    电池低压关机SOC点
    500     , // 61    8509    电池2重启AC输出电压点
    0       , // 62    8510    电网相序类型
    0       , // 63    8511    IT系统
    1001    , // 64    8512    并网法规设置
    0       , // 65    8513    额定输出电压 0:230 1:220 2:240 3:200 4:120 5:127
    0       , // 66    8514    额定输出频率
    6000    , // 67    8515    机器额定容量
    1       , // 68    8516    工作模式
    0       , // 69    8517    防逆流 to Load卖电使能
    0       , // 70    8518    防逆流 to CT  卖电使能
    6000    , // 71    8519    电网最大卖电功率
    0       , // 72    8520    电网最大输入功率限制使能
    8000    , // 73    8521    电网最大输入功率
    20      , // 74    8522    防逆流功率回差
    0       , // 75    8523    防逆流方式选择
    0       , // 76    8524    调度模式有功功率给定
    0       , // 77    8525    能量优先级
    0       , // 78    8526    无功控制模式
    0       , // 79    8527    无功功率给定
    100     , // 80    8528    功率因数给定
    2       , // 81    8529    有功功率变化率
    2       , // 82    8530    无功功率变化率
    2       , // 83    8531    开机斜率
    2       , // 84    8532    重合闸斜率
    10      , // 85    8533    重合闸时间
    0       , // 86    8534    DRM使能
    3000    , // 87    8535    CT变比设置
    1       , // 88    8536    漏电流GFCI保护使能
    150     , // 89    8537    漏电流GFCI保护阀值
    1       , // 90    8538    绝缘阻抗检测使能
    25      , // 91    8539    绝缘阻抗检测阀值
    0       , // 92    8540    主动孤岛保护使能
    0       , // 93    8541    离网电压补偿
    0       , // 94    8542    不对称相馈电使能
    0       , // 95    8543    通讯信号保护选择
    0       , // 96    8544    BackUp延迟
    0       , // 97    8545    Signal island mode
    0       , // 98    8546    外部Meter作为CT
    0       , // 99    8547    黑启动使能
    0       , // 100   8548    负载继电器断开控制
    30      , // 101   8549    启动等待时间
    0       , // 102   8550    Meter Select
    0       , // 103   8551    电表波特率选择
    0       , // 104   8552    设置电表相位(根据系统中安装的电表选择相应的电表挂靠相位？) bit0:A bit1:B bit:C
    0       , // 105   8553    电网侧电表2(AC couple使用) 0：On Load Side 1：On Grid Side
    0       , // 106   8554    F(P)功频响应模式使能
    0       , // 107   8555    F(P)功频出力变化基准(暂时不使用)
    1000    , // 108   8556    F(P)功频响应速率
    0       , // 109   8557    F(P)功频响应延时
    1000    , // 110   8558    F(P)功频退出速率
    0       , // 111   8559    F(P)功频退出延时
    40      , // 112   8560    F(P)过频降额系数
    5020    , // 113   8561    F(P)过频降额起点
    5120    , // 114   8562    F(P)过频降额终点
    5010    , // 115   8563    F(P)过频降额退出点（新增）
    100     , // 116   8564    F(P)过频降额限值(暂时不使用)
    40      , // 117   8565    F(P)欠频升额系数
    4980    , // 118   8566    F(P)欠频升额起点
    4880    , // 119   8567    F(P)欠频升额终点
    4990    , // 120   8568    F(P)欠频升额退出点
    100     , // 121   8569    F(P)欠频升额限值(暂时不使用)
    0       , // 122   8570    U(Q)工作模式
    108     , // 123   8571    U(Q)电压上升起点
    110     , // 124   8572    U(Q)电压上升终点
    0       , // 125   8573    U(Q)无功上升起点
    50      , // 126   8574    U(Q)无功上升终点
    92      , // 127   8575    U(Q)电压下降起点
    90      , // 128   8576    U(Q)电压下降终点
    0       , // 129   8577    U(Q)无功下降起点
    50      , // 130   8578    U(Q)无功下降终点
    20      , // 131   8579    U(Q)无功PLock_IN
    5       , // 132   8580    U(Q)无功PLock_OUT
    0       , // 133   8581    U(P)过压降额模式使能(新增)
    108     , // 134   8582    U(P)过压降额电压点A
    110     , // 135   8583    U(P)过压降额电压点B
    112     , // 136   8584    U(P)过压降额电压点C
    114     , // 137   8585    U(P)过压降额电压点D
    100     , // 138   8586    U(P)过压降额有功点A
    80      , // 139   8587    U(P)过压降额有功点B
    60      , // 140   8588    U(P)过压降额有功点C
    40      , // 141   8589    U(P)过压降额有功点D
    10      , // 142   8590    U(P)过压降额滤波时间常数
    10      , // 143   8591    P(Q)有功无功调节滤波时间常数
    0       , // 144   8592    P(Q)有功无功调节模式使能
    0       , // 145   8593    P(Q)有功点A
    0       , // 146   8594    P(Q)有功点B
    0       , // 147   8595    P(Q)有功点C
    0       , // 148   8596    P(Q)有功点D
    0       , // 149   8597    P(Q)无功点A
    0       , // 150   8598    P(Q)无功点B
    0       , // 151   8599    P(Q)无功点C
    0       , // 152   8600    P(Q)无功点D
    0       , // 153   8601    P(PF)有功功因使能
    20      , // 154   8602    P(PF)有功点A
    40      , // 155   8603    P(PF)有功点B
    60      , // 156   8604    P(PF)有功点C
    80      , // 157   8605    P(PF)有功点D
    100     , // 158   8606    P(PF)功因点A
    100     , // 159   8607    P(PF)功因点B
    100     , // 160   8608    P(PF)功因点C
    100     , // 161   8609    P(PF)功因点D
    20      , // 162   8610    P(PF)有功Lock_IN
    5       , // 163   8611    P(PF)有功Lock_OUT
    0       , // 164   8612    U(PF)电压功因模式使能
    80      , // 165   8613    U(PF)电压上升起点
    100     , // 166   8614    U(PF)电压上升终点
    100     , // 167   8615    U(PF)功因下降起点
    50      , // 168   8616    U(PF)功因下降终点
    0       , // 169   8617    F(G)电网适应性使能
    4950    , // 170   8618    F(G)欠频转放电频率点
    1       , // 171   8619    F(G)欠频转放电限值
    5020    , // 172   8620    F(G)过频转充电频率点
    65535   , // 173   8621    F(G)过频转充电限值
    112     , // 174   8622    F(G)过压转充电电压点 unit:1%
    65456   , // 175   8623    F(G)过压转充电功率限值  unit:1% -80% (65536 - 80 = 65456)
    2640    , // 176   8624    正常连接过压 unit:1V
    900     , // 177   8625    正常连接欠压 unit:1V
    6500    , // 178   8626    正常连接过频 5050/6050
    4000    , // 179   8627    正常连接欠频 4750/5750
    2640    , // 180   8628    重连过压 unit:1V
    900     , // 181   8629    重连欠压 unit:1V
    6500    , // 182   8630    重连过频 5030/6030
    4000    , // 183   8631    重连欠频 4800/5800
    0       , // 184   8632    强制离网使能(SBU功能)
    0       , // 185   8633    预留185
    0       , // 186   8634    预留186
    0       , // 187   8635    预留187
    0       , // 188   8636    预留188
    0       , // 189   8637    预留189
    0       , // 190   8638    低电压穿越使能
    150     , // 191   8639    LVRT动态无功Kf因子
    0       , // 192   8640    高电压穿越使能
    150     , // 193   8641    HVRT动态无功Kf因子
    90      , // 194   8642    LVRT电压1
    300     , // 195   8643    LVRT_T1
    20      , // 196   8644    LVRT电压2
    100     , // 197   8645    LVRT_T2
    20      , // 198   8646    LVRT电压3
    100     , // 199   8647    LVRT_T3
    20      , // 200   8648    LVRT电压4
    100     , // 201   8649    LVRT_T4
    20      , // 202   8650    LVRT电压5
    100     , // 203   8651    LVRT_T5
    110     , // 204   8652    HVRT电压1
    100     , // 205   8653    HVRT_T1
    130     , // 206   8654    HVRT电压2
    50      , // 207   8655    HVRT_T2
    130     , // 208   8656    HVRT电压3
    50      , // 209   8657    HVRT_T3
    130     , // 210   8658    HVRT电压4
    50      , // 211   8659    HVRT_T4
    130     , // 212   8660    HVRT电压5
    50      , // 213   8661    HVRT_T5
    0       , // 214   8662    预留214
    0       , // 215   8663    预留215
    0       , // 216   8664    预留216
    0       , // 217   8665    预留217
    2640    , // 218   8666    电网过压1段(V)
    6       , // 219   8667    电网过压1段时间(10ms)
    2640    , // 220   8668    电网过压2段(V)
    6       , // 221   8669    电网过压2段时间(10ms)
    130     , // 222   8670    电网过压3段(%)
    10      , // 223   8671    电网过压3段时间(10ms)
    130     , // 224   8672    电网过压4段(%)
    10      , // 225   8673    电网过压4段时间(10ms)
    130     , // 226   8674    电网过压5段(%)
    10      , // 227   8675    电网过压5段时间(10ms)
    900     , // 228   8676    电网欠压1段(V)
    6       , // 229   8677    电网欠压1段时间(10ms)
    900     , // 230   8678    电网欠压2段(V)
    6       , // 231   8679    电网欠压2段时间(10ms)
    50      , // 232   8680    电网欠压3段(%)
    10      , // 233   8681    电网欠压3段时间(10ms)
    50      , // 234   8682    电网欠压4段(%)
    10      , // 235   8683    电网欠压4段时间(10ms)
    50      , // 236   8684    电网欠压5段(%)
    10      , // 237   8685    电网欠压5段时间(10ms)
    10      , // 238   8686    电网电压不平衡保护值  10%差不多23V
    3000    , // 239   8687    电网电压不平衡保护时间
    6500    , // 240   8688    电网过频1段(0.01Hz)
    6       , // 241   8689    电网过频1段时间(10ms)
    6500    , // 242   8690    电网过频2段(0.01Hz)
    6       , // 243   8691    电网过频2段时间(10ms)
    5150    , // 244   8692    电网过频3段(0.01Hz)
    16      , // 245   8693    电网过频3段时间(10ms)
    5100    , // 246   8694    电网过频4段(0.01Hz)
    16      , // 247   8695    电网过频4段时间(10ms)
    5100    , // 248   8696    电网过频5段(0.01Hz)
    16      , // 249   8697    电网过频5段时间(1ms)
    4000    , // 250   8698    电网欠频1段(0.01Hz)
    6       , // 251   8699    电网欠频1段时间(10ms)
    4000    , // 252   8700    电网欠频2段(0.01Hz)
    6       , // 253   8701    电网欠频2段时间(10ms)
    4700    , // 254   8702    电网欠频3段(0.01Hz)
    16      , // 255   8703    电网欠频3段时间(10ms)
    4700    , // 256   8704    电网欠频4段(0.01Hz)
    16      , // 257   8705    电网欠频4段时间(10ms)
    4700    , // 258   8706    电网欠频5段(0.01Hz)
    16      , // 259   8707    电网欠频5段时间(10ms)
    0       , // 260   8708    电网10min过压使能
    110     , // 261   8709    电网10min过压阈值 unit:1%
    600     , // 262   8710    电网10min过压时间 unit:1s
    0       , // 263   8711    经济模式使能
    0x007F  , // 264   8712    生效星期
    1       , // 265   8713    规则1电网充电使能
    1       , // 266   8714    规则1油机充电使能
    0x0001  , // 267   8715    规则1起始时间
    0x173B  , // 268   8716    规则1结束时间
    500     , // 269   8717    规则1目标电压
    50      , // 270   8718    规则1目标SOC（BMS连接采用）
    6000    , // 271   8719    规则1放电功率
    1       , // 272   8720    规则2电网充电使能
    1       , // 273   8721    规则2油机充电使能
    0x0001  , // 274   8722    规则2起始时间
    0x173B  , // 275   8723    规则2结束时间
    500     , // 276   8724    规则2目标电压
    50      , // 277   8725    规则2目标SOC（BMS连接采用）
    6000    , // 278   8726    规则2放电功率
    1       , // 279   8727    规则3电网充电使能
    1       , // 280   8728    规则3油机充电使能
    0x0001  , // 281   8729    规则3起始时间
    0x173B  , // 282   8730    规则3结束时间
    500     , // 283   8731    规则3目标电压
    50      , // 284   8732    规则3目标SOC（BMS连接采用）
    6000    , // 285   8733    规则3放电功率
    1       , // 286   8734    规则4电网充电使能
    1       , // 287   8735    规则4油机充电使能
    0x0001  , // 288   8736    规则4起始时间
    0x173B  , // 289   8737    规则4结束时间
    500     , // 290   8738    规则4目标电压
    50      , // 291   8739    规则4目标SOC（BMS连接采用）
    6000    , // 292   8740    规则4放电功率
    1       , // 293   8741    规则5电网充电使能
    1       , // 294   8742    规则5油机充电使能
    0x0001  , // 295   8743    规则5起始时间
    0x173B  , // 296   8744    规则5结束时间
    500     , // 297   8745    规则5目标电压
    50      , // 298   8746    规则5目标SOC（BMS连接采用）
    6000    , // 299   8747    规则5放电功率
    1       , // 300   8748    规则6电网充电使能
    1       , // 301   8749    规则6油机充电使能
    0x0001  , // 302   8750    规则6起始时间
    0x173B  , // 303   8751    规则6结束时间
    500     , // 304   8752    规则6目标电压
    50      , // 305   8753    规则6目标SOC（BMS连接采用）
    6000    , // 306   8754    规则6放电功率
    0       , // 307   8755    预留307
    0       , // 308   8756    预留308
    0       , // 309   8757    预留309
    0       , // 310   8758    预留310
    0       , // 311   8759    油机模式
    8000    , // 312   8760    油机输入额定功率
    0       , // 313   8761    油机输入功率限制使能位
    0       , // 314   8762    油机接入电网端口使能位
    0       , // 315   8763    智能负载常闭使能位
    540     , // 316   8764    智能负载闭合电池电压点
    510     , // 317   8765    智能负载断开电池电压点
    100     , // 318   8766    智能负载闭合电池SOC点
    95      , // 319   8767    智能负载断开电池SOC点
    5500    , // 320   8768    AC_Couple频率顶高值
    0       , // 321   8769    AC_Couple停止馈电使能
    0       , // 322   8770    AC_Couple到电网侧或者负载侧
    540     , // 323   8771    微逆闭合电池电压点
    560     , // 324   8772    微逆断开电池电压点
    80      , // 325   8773    微逆闭合电池SOC点
    90      , // 326   8774    微逆断开电池SOC点
    0       , // 327   8775    智能负载闭合PV功率
    0       , // 328   8776    离网立即断开智能负载
    0       , // 329   8777    预留329
    2640    , // 330   8778    油机过压1段(V)
    6       , // 331   8779    油机过压1段时间(10ms)
    2640    , // 332   8780    油机过压2段(V)
    6       , // 333   8781    油机过压2段时间(10ms)
    900     , // 334   8782    油机欠压1段(V)
    6       , // 335   8783    油机欠压1段时间(10ms)
    900     , // 336   8784    油机欠压2段(V)
    6       , // 337   8785    油机欠压2段时间(10ms)
    6500    , // 338   8786    油机过频1段(0.01Hz)
    6       , // 339   8787    油机过频1段时间(10ms)
    6500    , // 340   8788    油机过频2段(0.01Hz)
    6       , // 341   8789    油机过频2段时间(10ms)
    4000    , // 342   8790    油机欠频1段(0.01Hz)
    6       , // 343   8791    油机欠频1段时间(10ms)
    4000    , // 344   8792    油机欠频2段(0.01Hz)
    6       , // 345   8793    油机欠频2段时间(10ms)
    0       , // 346   8794    Debug 模式使能位1
    0       , // 347   8795    Debug 模式使能位2
    0       , // 348   8796    Debug PWM驱动使能位
    0       , // 349   8797    Debug 继电器驱动使能位
    1       , // 350   8798    电网最大输入电流限制使能
    355     , // 351   8799    电网最大输入电流峰值
    0x0001  , // 352   8800    智能负载启动时间
    0x173B  , // 353   8801    智能负载停止时间
    0xFFFF  , // 354   8802    智能负载最大输出时间
    6000    , // 355   8803    电网最大馈入功率限定
    8050    , // 356   8804    电网最大输出功率限定
    0       , // 357   8805    静音模式使能
    0       , // 358   8806    低功耗模式使能
    0       , // 359   8807    MPPT阴影扫描使能
    0       , // 360   8808    功率/电流显示类型设置
    3       , // 361   8809    故障使能设置
    0       , // 362   8810    预留362
    0       , // 363   8811    预留363
    0       , // 364   8812    预留364
    0       , // 365   8813    预留365
    10000   , // 366   8814    PV1电压校准系数
    0       , // 367   8815    PV1电压校准偏置
    10000   , // 368   8816    PV2电压校准系数
    0       , // 369   8817    PV2电压校准偏置
    10000   , // 370   8818    PV3电压校准系数
    0       , // 371   8819    PV3电压校准偏置
    10000   , // 372   8820    PV4电压校准系数
    0       , // 373   8821    PV4电压校准偏置
    10000   , // 374   8822    PV1电流校准系数
    0       , // 375   8823    PV1电流校准偏置
    10000   , // 376   8824    PV2电流校准系数
    0       , // 377   8825    PV2电流校准偏置
    10000   , // 378   8826    PV3电流校准系数
    0       , // 379   8827    PV3电流校准偏置
    10000   , // 380   8828    PV4电流校准系数
    0       , // 381   8829    PV4电流校准偏置
    10000   , // 382   8830    电池电压1校准系数
    0       , // 383   8831    电池电压1校准偏置
    10000   , // 384   8832    电池电压2校准系数
    0       , // 385   8833    电池电压2校准偏置
    10000   , // 386   8834    BAT电流1校准系数
    0       , // 387   8835    BAT电流1校准偏置
    10000   , // 388   8836    BAT电流2校准系数
    0       , // 389   8837    BAT电流2校准偏置
    10000   , // 390   8838    PBUS电压校准系数
    0       , // 391   8839    PBUS电压校准偏置
    10000   , // 392   8840    NBUS电压校准系数
    0       , // 393   8841    NBUS电压校准偏置
    10000   , // 394   8842    U相油机电压校准系数
    10000   , // 395   8843    V相油机电压校准系数
    10000   , // 396   8844    W相油机电压校准系数
    10000   , // 397   8845    U相电网电压校准系数
    10000   , // 398   8846    V相电网电压校准系数
    10000   , // 399   8847    W相电网电压校准系数
    10000   , // 400   8848    A相逆变电压校准系数
    10000   , // 401   8849    B相逆变电压校准系数
    10000   , // 402   8850    C相逆变电压校准系数
    10000   , // 403   8851    A相逆变电流校准系数
    10000   , // 404   8852    B相逆变电流校准系数
    10000   , // 405   8853    C相逆变电流校准系数
    10000   , // 406   8854    U相电网电流校准系数
    10000   , // 407   8855    V相电网电流校准系数
    10000   , // 408   8856    W相电网电流校准系数
    10000   , // 409   8857    U相外部CT电流校准系数
    10000   , // 410   8858    V相外部CT电流校准系数
    10000   , // 411   8859    W相外部CT电流校准系数
    10000   , // 412   8860    R相发电机电流校准系数
    10000   , // 413   8861    S相发电机电流校准系数
    10000   , // 414   8862    T相发电机电流校准系数
    10000   , // 415   8863    放电量校准高位
    10000   , // 416   8864    放电量校准低位
    10000   , // 417   8865    充电量校准高位
    10000   , // 418   8866    充电量校准低位
    10000   , // 419   8867    R相负载电压校准系数
    10000   , // 420   8868    S相负载电压校准系数
    10000   , // 421   8869    T相负载电压校准系数
    eSingleSeries , // 422   8870    设备子类  
    0       , // 423   8871    预留    母线电压给定(750)/作为故障告警码详情的显示
    1000    , // 424   8872    预留    BuckBoost电压环Kp
    750     , // 425   8873    预留    BuckBoost电压环Ki
    750     , // 426   8874    预留    BuckBoost电流环Kp
    1       , // 427   8875    预留    BuckBoost电流环Ki
    220     , // 428   8876    预留    输出电压给定
    7500    , // 429   8877    预留    有效值环Kp
    725     , // 430   8878    预留    有效值环Ki
    3500    , // 431   8879    预留    瞬时电压环Kp
    0       , // 432   8880    预留    瞬时电压环Ki
    1000    , // 433   8881    预留    瞬时电流环Kp
    0       , // 434   8882    预留    瞬时电流环Ki
    180     , // 435   8883    预留    电流前馈系数
    1000    , // 436   8884    预留    并网功率外环Kp
    50      , // 437   8885    预留    并网功率外环Ki
    5000    , // 438   8886    预留    并网电流内环Kp
    0       , // 439   8887    预留    平衡环路电压环Kp
    0       , // 440   8888    预留    平衡环路电压环Ki
    0       , // 441   8889    预留    平衡环路电流环Kp
    0       , // 442   8890    预留    平衡环路电流环Ki
    0       , // 443   8891    预留
    0       , // 444   8892    预留
    0       , // 445   8893    预留
    0       , // 446   8894    预留
    0       , // 447   8895    预留
    0       , // 448   8896    预留
    0       , // 449   8897    预留
    0       , // 450   8898    预留
    0       , // 451   8899    预留
    0       , // 452   8900    预留
    0       , // 453   8901    预留
    0       , // 454   8902    预留
    0       , // 455   8903    预留
    0       , // 456   8904    预留
    0       , // 457   8905    预留
    0       , // 458   8906    IVGM15048用来区分研发调试模式还是监控模式  eSciFuncSelectSetID
    0       , // 459   8907    机器序列号1
    0       , // 460   8908    机器序列号2
    0       , // 461   8909    机器序列号3
    0       , // 462   8910    机器序列号4
    0       , // 463   8911    机器序列号5
    0       , // 464   8912    机器序列号长度
    0       , // 465   8913    ATE写显示板版本号
    0       , // 466   8914    ATE写控制板版本号
    0       , // 467   8915    ATE写功率板版本号
    0       , // 468   8916    升级固件
    0       , // 469   8917    复位重启
    0       , // 470   8918    EE恢复默认值
    0       , // 471   8919    老化模式
    0       , // 472   8920    远程控制开关
    0       , // 473   8921    EE恢复出厂设置
    0       , // 474   8922    老化电池启动电压
    0       , // 475   8923    老化电池放电电流
    0       , // 476   8924    老化最大PV功率
    0       , // 477   8925    老化最大逆变功率
    0       , // 478   8926    MPPT电压点控制
    0       , // 479   8927    发电量发电时间清零设置
    0       , // 480   8928    安规设置
    0       , // 481   8929    绝缘阻抗设置
    0       , // 482   8930    电表协议选择
    0       , // 483   8931    Wifi通讯地址和波特率
    0       , // 484   8932    与电表通讯波特率和校验位
    0       , // 485   8933    与电表通讯地址
    0       , // 486   8934    电表使能写，禁止读
    0       , // 487   8935    电表Modbus地址
    0       , // 488   8936    电表数据
    0       , // 489   8937    485通讯地址和波特率
    0       , // 490   8938    LCD背光
    0       , // 491   8939    蜂鸣器
    1       , // 492   8940    电池包地址
    0       , // 493   8941    清除事件记录
    1       , // 494   8942    事件记录功能
    1       , // 495   8943    故障记录功能
    0       , // 496   8944    Log查询类型
    0       , // 497   8945    Log索引
};

const Uint16 uiCRCTable[] = {
    0X0000, 0XC0C1, 0XC181, 0X0140, 0XC301, 0X03C0, 0X0280, 0XC241,
    0XC601, 0X06C0, 0X0780, 0XC741, 0X0500, 0XC5C1, 0XC481, 0X0440,
    0XCC01, 0X0CC0, 0X0D80, 0XCD41, 0X0F00, 0XCFC1, 0XCE81, 0X0E40,
    0X0A00, 0XCAC1, 0XCB81, 0X0B40, 0XC901, 0X09C0, 0X0880, 0XC841,
    0XD801, 0X18C0, 0X1980, 0XD941, 0X1B00, 0XDBC1, 0XDA81, 0X1A40,
    0X1E00, 0XDEC1, 0XDF81, 0X1F40, 0XDD01, 0X1DC0, 0X1C80, 0XDC41,
    0X1400, 0XD4C1, 0XD581, 0X1540, 0XD701, 0X17C0, 0X1680, 0XD641,
    0XD201, 0X12C0, 0X1380, 0XD341, 0X1100, 0XD1C1, 0XD081, 0X1040,
    0XF001, 0X30C0, 0X3180, 0XF141, 0X3300, 0XF3C1, 0XF281, 0X3240,
    0X3600, 0XF6C1, 0XF781, 0X3740, 0XF501, 0X35C0, 0X3480, 0XF441,
    0X3C00, 0XFCC1, 0XFD81, 0X3D40, 0XFF01, 0X3FC0, 0X3E80, 0XFE41,
    0XFA01, 0X3AC0, 0X3B80, 0XFB41, 0X3900, 0XF9C1, 0XF881, 0X3840,
    0X2800, 0XE8C1, 0XE981, 0X2940, 0XEB01, 0X2BC0, 0X2A80, 0XEA41,
    0XEE01, 0X2EC0, 0X2F80, 0XEF41, 0X2D00, 0XEDC1, 0XEC81, 0X2C40,
    0XE401, 0X24C0, 0X2580, 0XE541, 0X2700, 0XE7C1, 0XE681, 0X2640,
    0X2200, 0XE2C1, 0XE381, 0X2340, 0XE101, 0X21C0, 0X2080, 0XE041,
    0XA001, 0X60C0, 0X6180, 0XA141, 0X6300, 0XA3C1, 0XA281, 0X6240,
    0X6600, 0XA6C1, 0XA781, 0X6740, 0XA501, 0X65C0, 0X6480, 0XA441,
    0X6C00, 0XACC1, 0XAD81, 0X6D40, 0XAF01, 0X6FC0, 0X6E80, 0XAE41,
    0XAA01, 0X6AC0, 0X6B80, 0XAB41, 0X6900, 0XA9C1, 0XA881, 0X6840,
    0X7800, 0XB8C1, 0XB981, 0X7940, 0XBB01, 0X7BC0, 0X7A80, 0XBA41,
    0XBE01, 0X7EC0, 0X7F80, 0XBF41, 0X7D00, 0XBDC1, 0XBC81, 0X7C40,
    0XB401, 0X74C0, 0X7580, 0XB541, 0X7700, 0XB7C1, 0XB681, 0X7640,
    0X7200, 0XB2C1, 0XB381, 0X7340, 0XB101, 0X71C0, 0X7080, 0XB041,
    0X5000, 0X90C1, 0X9181, 0X5140, 0X9301, 0X53C0, 0X5280, 0X9241,
    0X9601, 0X56C0, 0X5780, 0X9741, 0X5500, 0X95C1, 0X9481, 0X5440,
    0X9C01, 0X5CC0, 0X5D80, 0X9D41, 0X5F00, 0X9FC1, 0X9E81, 0X5E40,
    0X5A00, 0X9AC1, 0X9B81, 0X5B40, 0X9901, 0X59C0, 0X5880, 0X9841,
    0X8801, 0X48C0, 0X4980, 0X8941, 0X4B00, 0X8BC1, 0X8A81, 0X4A40,
    0X4E00, 0X8EC1, 0X8F81, 0X4F40, 0X8D01, 0X4DC0, 0X4C80, 0X8C41,
    0X4400, 0X84C1, 0X8581, 0X4540, 0X8701, 0X47C0, 0X4680, 0X8641,
    0X8201, 0X42C0, 0X4380, 0X8341, 0X4100, 0X81C1, 0X8081, 0X4040
};


/******************************************************************************
Function Name       :
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list :
ReturnTyp           :
Refer documents :
******************************************************************************/
void MonitorProtocol_Task_RealTime(void)
{

}

/******************************************************************************
Function Name       :
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list :
ReturnType          :
Refer documents :
******************************************************************************/
void MonitorProtocol_Task_1ms(void)
{

}

/******************************************************************************
Function Name       :
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list :
ReturnType          :
Refer documents :
******************************************************************************/
void MonitorProtocol_Task_5ms(void)
{

}

/******************************************************************************
Function Name       :
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list :
ReturnType          :
Refer documents :
******************************************************************************/
void MonitorProtocol_Task_20ms(void)
{
    MonitorProtocol_AlarmRenew();
    MonitorProtocol_PowerMsgShow();
    MonitorProtocol_AnologShowDeal();
    MonitorProtocol_ModuleStateShow();
    //MonitorProtocol_PowerCalc(fReal_Power(stPower.PGrid.PhaseA), fReal_Power(stPower.PGen.PhaseA), fReal_Power(-stPower.fPBatScale), fReal_Power(stPower.PInv.PhaseA),\
    //                          fReal_Power(stPower.POut.PhaseA), fReal_Power(stPower.SSmartLoad.PhaseA), strSlvAnalog.fPv1Power, strSlvAnalog.fPv2Power);
    MonitorProtocol_AnologUpdate();
}

/******************************************************************************
Function Name       :
-------------------------------------------------------------------------------
Function Descriptions:
Parameter Name list :
ReturnType          :
Refer documents :
******************************************************************************/
void MonitorProtocol_Task_100ms(void)
{
    static Uint16 uiGenaRecordClearCnt;

    // 发电量清零
    if(1 == uiSciCommandDataBag[eComGenaRecordClear])
    {
        if(++uiGenaRecordClearCnt > 9)
        {
            uiSciCommandDataBag[eComGenaRecordClear] = 0;
            uiGenaRecordClearCnt = 0;
        }
        //---------------------------------
        // 清空发电量、耗电量、馈电量
        stEnergyCal.Bat.fTotalCharge = 0;
        stEnergyCal.Bat.fTotalDisCharge = 0;

        stEnergyCal.Gen.fTotalCharge = 0;
        stEnergyCal.Gen.fTotalDisCharge = 0;

        stEnergyCal.Grid.fTotalCharge = 0;
        stEnergyCal.Grid.fTotalDisCharge = 0;

        stEnergyCal.Pv1.fTotalDisCharge = 0;
        stEnergyCal.Pv2.fTotalDisCharge = 0;

        stEnergyCal.Load.fTotalDisCharge = 0;
        stEnergyCal.HouseLoad.fTotalDisCharge = 0;
        stEnergyCal.MircoInv.fTotalDisCharge = 0;
        //---------------------------------
    }
    else
    {
        uiGenaRecordClearCnt = 0;
    }

    // 故障清零
    if(1 == uiSciCommandDataBag[eComFaultClear])
    {
        g_SysFault.ubFaultDc.fault.fault1 = 0;
        g_SysFault.ubFaultDc.fault.fault2 = 0;

        g_SysFault.ubFaultAc.fault.fault1 = 0;
        g_SysFault.ubFaultAc.fault.fault2 = 0;
        g_SysFault.ubFaultAc.fault.fault3 = 0;
        g_SysFault.ubFaultAc.fault.fault4 = 0;

        g_SysFault.ubFaultSys.fault.fault1 = 0;
        g_SysFault.ubFaultSys.fault.fault2 = 0;

        g_SysFault.ubFaultGen.all = 0;

        g_SysAlarm.unAlarmCode.Word.Word1 = 0;
        g_SysAlarm.unAlarmCode.Word.Word2 = 0;
        g_SysAlarm.unAlarmCode.Word.Word3 = 0;

        g_SysFault.unFaultCode.Word.Word1 = 0;
        g_SysFault.unFaultCode.Word.Word2 = 0;
        g_SysFault.unFaultCode.Word.Word3 = 0;

        if(uiMasterAnalogData[eM2SRealData_FctionEn] & 0x0010) // 确保已经告知从DSP清除故障
        { uiSciCommandDataBag[eComFaultClear] = 0; }
    }

	MonitorProtocol_AnologInfoDataUpdate();

}
/******************************************************************************
Function Name           : CanMonitorProtocol_AlarmRenew
------------------------------------------------------------------------------
Function Descriptions   :
Parameter Name list     :
ReturnType              :
Refer documents        :
******************************************************************************/
void MonitorProtocol_AlarmRenew(void)
{
    if(1 == uiSciSetDataBag[eSetRsvd423])  // 防止一开始乱码显示
    {
        g_unSysInitFlag.bit.FaultShowAll = 1;
    }
    else
    {
        g_unSysInitFlag.bit.FaultShowAll = 0;
    }

    // 0
//    unFaultFlag.bit.bTotalPV   = 0;
//    unFaultFlag.bit.bTotalBat  = 0;
//    unFaultFlag.bit.bTotalBus  = 0;
//    unFaultFlag.bit.bTotalINV  = 0;
//    unFaultFlag.bit.bTotalGrid = 0;
//    unFaultFlag.bit.bTotalLoad = 0;
//    unFaultFlag.bit.bTotalSYS  = 0;
//    unFaultFlag.bit.bTotalSafe = 0;
//    unFaultFlag.bit.bTotalPara = 0;

    // 1-6是故障
    // 1 故障开始
    unFaultFlag.bit.bPV1OV         = strSlvState.ubState2.bit.PV1VoltOver;
    unFaultFlag.bit.bPV2OV         = strSlvState.ubState2.bit.PV2VoltOver;
//    unFaultFlag.bit.bPV3OV         = 0;
//    unFaultFlag.bit.bPV4OV         = 0;
    unFaultFlag.bit.bPVOC          = strSlvState.ubState2.bit.PV1CurrOver;
    unFaultFlag.bit.bPV2OC         = strSlvState.ubState2.bit.PV2CurrOver;
//    unFaultFlag.bit.bPV3OC         = 0;
//    unFaultFlag.bit.bPV4OC         = 0;
    unFaultFlag.bit.bPV1Inverse    = strSlvState.ubState3.bit.Pv1Reverse;
    unFaultFlag.bit.bPV2Inverse    = strSlvState.ubState3.bit.Pv2Reverse;
//    unFaultFlag.bit.bPV3Inverse    = 0;
//    unFaultFlag.bit.bPV4Inverse    = 0;
//    unFaultFlag.bit.bPV1HallFault  = 0;// 需要新增
//    unFaultFlag.bit.bPV2HallFault  = 0;
//    unFaultFlag.bit.bPV3HallFault  = 0;
//    unFaultFlag.bit.bPV4HallFault  = 0;

    // 2
//    unFaultFlag.bit.bPVArc            = 0;
    unFaultFlag.bit.bPVShort          = strSlvState.ubState2.bit.PV1Short;
    unFaultFlag.bit.bPV2Short         = strSlvState.ubState2.bit.PV2Short;
//    unFaultFlag.bit.bPVRsvd4          = 0;
//    unFaultFlag.bit.bPVRsvd5          = 0;
//    unFaultFlag.bit.bPVRsvd6          = 0;
//    unFaultFlag.bit.bPVRsvd7          = 0;
    unFaultFlag.bit.bMdlIdentifyFail = (g_SysFault.ubFaultSys.bit.MdlIdentifyFail || strSlvState.ubState3.bit.MdlIdentifyFail);
    unFaultFlag.bit.bBat1SoftOV       = g_SysFault.ubFaultDc.bit.BatOVP;
    unFaultFlag.bit.bBat1HardOV       = g_SysFault.ubFaultDc.bit.BatHwOVP;
    unFaultFlag.bit.bBat1SoftOC       = g_SysFault.ubFaultDc.bit.BatOCP;
    unFaultFlag.bit.bBat1HardOC       = g_SysFault.ubFaultDc.bit.BatChgTz;
//    unFaultFlag.bit.bBat1Inverse      = 0;
//    unFaultFlag.bit.bLLCSoftOC        = 0;// g_SysFault.ubFaultDc.bit.LlcOcp;
    unFaultFlag.bit.bLLCHardOC        = g_SysFault.ubFaultDc.bit.LlcTz;
    unFaultFlag.bit.bBMS1CommuniFault = g_SysFault.ubFaultDc.bit.BMSCommErr;

    // 3
    // unFaultFlag.bit.bBkBsSoftOC           = 0;
//    unFaultFlag.bit.bBkBsHardOC           = 0;
    // unFaultFlag.bit.bBkBsHallFault        = g_SysFault.ubFaultAc.bit.HwADFaultIDcDc || g_SysFault.ubFaultDc.bit.BatSensorErr;
//    unFaultFlag.bit.bBatArc               = 0;
    unFaultFlag.bit.bBatLlcSoftFail       = g_SysFault.ubFaultDc.bit.LlcSoftStartFail;
//    unFaultFlag.bit.bBat1Rsvd3            = 0;
//    unFaultFlag.bit.bBat1Rsvd4            = 0;
    // unFaultFlag.bit.bBatShort             = g_SysFault.ubFaultDc.bit.BatShort;
    unFaultFlag.bit.bBusSoftOV            = g_SysFault.ubFaultDc.bit.BusOVP || strSlvState.ubState3.bit.BusVoltOver;// || strSlvState.ubState2.bit.PV1VoltOver || strSlvState.ubState2.bit.PV2VoltOver;
    unFaultFlag.bit.bBusHardOV            = g_SysFault.ubFaultDc.bit.BusHwOVP;
    unFaultFlag.bit.bBusUV                = g_SysFault.ubFaultAc.bit.BusUVP;
    unFaultFlag.bit.bBusUnbalance         = g_SysFault.ubFaultDc.bit.BusUnbalance;
    unFaultFlag.bit.bBusBalanBridgeSoftOC = 0;
//    unFaultFlag.bit.bBusBalanBridgeHardOC = 0;
//    unFaultFlag.bit.bBusRsv1              = 0;
//    unFaultFlag.bit.bBusRsv2              = 0;

    // 4
    unFaultFlag.bit.bInvSoftOC       = (g_SysFault.ubFaultAc.bit.AcRmsOCP || g_SysFault.ubFaultAc.bit.SwInvOcpFast);
    unFaultFlag.bit.bInvHardOC       = g_SysFault.ubFaultAc.bit.InvTz;
    unFaultFlag.bit.bInvSoftFault    = g_SysFault.ubFaultAc.bit.InvSoftStartFault;
    unFaultFlag.bit.bInvVoltDC       = g_SysFault.ubFaultAc.bit.DcvOVP;
    unFaultFlag.bit.bInvCurrDC       = g_SysFault.ubFaultAc.bit.DciOCP || g_SysFault.ubFaultAc.bit.HwADFaultInvDcI;
    unFaultFlag.bit.bInvVoltOV       = g_SysFault.ubFaultAc.bit.VinvOVP;
    unFaultFlag.bit.bInvVoltUV       = g_SysFault.ubFaultAc.bit.VinvUVP;
    unFaultFlag.bit.bInvShort        = (g_SysFault.ubFaultAc.bit.OutputShortFault || g_SysFault.ubFaultAc.bit.LLShortFault);
    unFaultFlag.bit.bGridOverLoad    = g_SysFault.ubFaultAc.bit.GridOverLoad;
    unFaultFlag.bit.bLoadOver        = g_SysFault.ubFaultAc.bit.LoadOver110;
//    unFaultFlag.bit.bLoadOver125     = 0;
//    unFaultFlag.bit.bLoadOver150     = 0;
//    unFaultFlag.bit.bLoadOver200     = 0;
    unFaultFlag.bit.bGridOverCurr    = g_SysFault.ubFaultAc.bit.GridOverCurr;
    // unFaultFlag.bit.bGridRsv2        = 0;
//    unFaultFlag.bit.bGridRsv3        = 0;

    // 5
    unFaultFlag.bit.bSysOverTemp          = (   strSlvState.ubState2.bit.LlcTempOver   || strSlvState.ubState2.bit.HsTempOver
                                             || g_SysFault.ubFaultSys.bit.PBACTempOver || strSlvState.ubState3.bit.PvTempOver );
    unFaultFlag.bit.bSysOverTempEnvi      = strSlvState.ubState2.bit.InnerTempOver;
    unFaultFlag.bit.bSysSlaveDSPComFault  = g_SysFault.ubFaultSys.bit.InnerCommErr;
    unFaultFlag.bit.bSysMCUComFault       = g_SysFault.ubFaultSys.bit.McuCommErr;
    unFaultFlag.bit.bSysEepromFault       = g_SysFault.ubFaultSys.bit.E2promFault;
    unFaultFlag.bit.bSafeLeakHallFault    = g_SysFault.ubFaultAc.bit.HwADFaultGfci;
    unFaultFlag.bit.bSafeLeakCurr         = (   (g_SysFault.ubFaultAc.bit.LeakCurrOver1)
											 || (g_SysFault.ubFaultAc.bit.LeakCurrOver2)
											 || (g_SysFault.ubFaultAc.bit.LeakCurrOver3)
											 || (g_SysFault.ubFaultAc.bit.LeakCurrOver4)
                                             || (g_SysFault.ubFaultAc.bit.GfciHardOCP) );
    unFaultFlag.bit.bSafeGridRelayOpen    = g_SysFault.ubFaultAc.bit.GridRelayOpenFault;
    unFaultFlag.bit.bSafeGridRelayShort   = g_SysFault.ubFaultAc.bit.GridRelayShortFault;
    unFaultFlag.bit.bSafeInvRelayFaul     = (g_SysFault.ubFaultAc.bit.InvRelayShortFault || g_SysFault.ubFaultAc.bit.InvRelayOpenFault);
//    unFaultFlag.bit.bSafeLoadRelayFault   = 0;
    unFaultFlag.bit.bSafeGenRelayFault    = g_SysFault.ubFaultSys.bit.GenRelayFault;
    unFaultFlag.bit.bSafeBusIso           = strSlvState.ubState2.bit.IsoCheckFail;
    unFaultFlag.bit.bInOutReversed        = g_SysFault.ubFaultSys.bit.InOutReverse;
    unFaultFlag.bit.bGenWiringErr         = g_SysFault.ubFaultSys.bit.GenSmartPortReverse;
//    unFaultFlag.bit.bSysEPO               = 0;// g_SysFault.ubFaultSys.bit.EpoFault || strSlvState.ubState3.bit.EpoFault;

    // 6 故障结束
    unFaultFlag.bit.bSys12VAuxiPower        = g_SysFault.ubFaultSys.bit.APS12V_Fault;
    unFaultFlag.bit.bSysNtcOpen             = strSlvState.ubState2.bit.NtcOpen;
    unFaultFlag.bit.bSysAfciCommFault       = strSlvState.ubState2.bit.AfciCommErr; // 改为AFCI故障
    unFaultFlag.bit.bSysDRMFault            = 0;
    unFaultFlag.bit.bSysCTHallOpen          = g_SysFault.ubFaultAc.bit.HwADFaultICTOut;  // CT采样故障
    unFaultFlag.bit.bSysParamChange         = g_SysFault.ubFaultSys.bit.SysParamChange;
    // unFaultFlag.bit.bSysRSDFault            = g_SysFault.ubFaultSys.bit.SysRSDFault;
    unFaultFlag.bit.bOtherMdlFault          = g_SysFault.Flag.bit.ParaMdlFault;
    unFaultFlag.bit.bParaCANComFault        = g_SysFault.ubFaultSys.bit.ParaCanFault;
    unFaultFlag.bit.bParaCANMasterLose      = g_SysFault.ubFaultSys.bit.ParaMasterLose;
    unFaultFlag.bit.bParaZeroSyncEcapFault  = g_SysFault.ubFaultSys.bit.ParaSyncSignalLoss;
    unFaultFlag.bit.eParaVersionDiff        = 0;
    unFaultFlag.bit.eParaCmdDiff            = g_SysFault.ubFaultSys.bit.ParaSysInfoConflict;
    unFaultFlag.bit.bParaCANMasterConflict  = g_SysFault.ubFaultSys.bit.ParaIDConflict || g_SysFault.ubFaultSys.bit.ParaMasterConflict;  // Id冲突
    unFaultFlag.bit.bParaPWMSyncEcapFault   = 0;
    unFaultFlag.bit.bParaWiringErr          = g_SysFault.ubFaultSys.bit.ParaLNReverse || g_SysFault.ubFaultSys.bit.ParaGenLNReverse;

    // 7-12是告警
    // 7
//    unFaultFlag.bit.bPV1UVAlarm            = 0; // strSlvState.ubState1.bit.Pv1Loss; 不显示
//    unFaultFlag.bit.bPV2UVAlarm            = 0; // strSlvState.ubState1.bit.Pv2Loss; 不显示
//    unFaultFlag.bit.bPV3UVAlarm            = 0;
//    unFaultFlag.bit.bPV4UVAlarm            = 0;
//    unFaultFlag.bit.bPV1InverseAlarm       = 0;
//    unFaultFlag.bit.bPV2InverseAlarm       = 0;
//    unFaultFlag.bit.bPV3InverseAlarm       = 0;
//    unFaultFlag.bit.bPV4InverseAlarm       = 0;
//    unFaultFlag.bit.bPVAlarm1              = 0;
//    unFaultFlag.bit.bPVAlarm2              = 0;
//    unFaultFlag.bit.bPVAlarm3              = 0;
//    unFaultFlag.bit.bPVAlarm4              = 0;
//    unFaultFlag.bit.bPVAlarm5              = 0;
//    unFaultFlag.bit.bPVAlarm6              = 0;
//    unFaultFlag.bit.bPVAlarm7              = 0;
//    unFaultFlag.bit.bPVAlarm8              = 0;

    // 8
//    unFaultFlag.bit.bBatOVAlarm         = 0;
    // unFaultFlag.bit.bBatUVAlarm         = g_SysAlarm.ubAlarmDc.bit.BatUVP;
    // if(eNoBatt == g_ComInfo.Com1.bit.BatMode) { unFaultFlag.bit.bBatOpenAlarm       = 0; }
    // else { unFaultFlag.bit.bBatOpenAlarm       = g_SysAlarm.ubAlarmDc.bit.BatOpen; }
    // unFaultFlag.bit.bBatSocLowAlarm     = g_SysAlarm.ubAlarmDc.bit.BatSocLow;
    unFaultFlag.bit.bBmsCommFailAlarm   = g_SysAlarm.ubAlarmSys.bit.BmsCommuniFault;
    unFaultFlag.bit.bBatWeakCutOffAc    = (g_SysAlarm.ubAlarmDc.bit.BatSocLowOffAc || g_SysAlarm.ubAlarmDc.bit.BatVoltLowOffAc);
//    unFaultFlag.bit.bBatAlarm3          = 0;
//    unFaultFlag.bit.bBatAlarm4          = 0;
//    unFaultFlag.bit.bBatAlarm5          = 0;
//    unFaultFlag.bit.bBatAlarm6          = 0;
//    unFaultFlag.bit.bBatAlarm7          = 0;
//    unFaultFlag.bit.bBatAlarm8          = 0;
//    unFaultFlag.bit.bBatAlarm9          = 0;
//    unFaultFlag.bit.bBatAlarm10         = 0;
//    unFaultFlag.bit.bBatAlarm11         = 0;
//    unFaultFlag.bit.bBatAlarm12         = 0;

    // 9
    if(eNoBatt == g_ComInfo.Com1.bit.BatMode && stValue.fRmsReal.VGridA > 50.0f) // 20250908--改为电网电压大于50V条件后再报出电网异常告警
    {
        unFaultFlag.bit.bGridOV           = g_SysFault.ubFaultAc.bit.GridOVP;
        unFaultFlag.bit.bGridUV           = g_SysFault.ubFaultAc.bit.GridUVP;
        unFaultFlag.bit.bGridOF           = g_SysFault.ubFaultAc.bit.GridOFP;
        unFaultFlag.bit.bGridUF           = g_SysFault.ubFaultAc.bit.GridUFP;
//        unFaultFlag.bit.bGridPhaseLose    = 0;// g_SysFault.ubFaultAc.bit.GridLosePhase;
        unFaultFlag.bit.bGridSeqInver     = g_SysFault.ubFaultAc.bit.GridPhaseSeqInvert;
//        unFaultFlag.bit.bGridLoseN        = 0;// g_SysFault.ubFaultAc.bit.GridLoseN;       不显示
//        unFaultFlag.bit.bGridUnbalance    = 0;// g_SysFault.ubFaultAc.bit.GridUnbalance;   不显示
//        unFaultFlag.bit.bGridPllFail      = 0;// g_SysFault.ubFaultAc.bit.PhaselockFail;   不显示
    //    unFaultFlag.bit.bGridVoltLoss     =  g_SysFault.ubFaultAc.bit.GridDqFastFault; //不显示
    }
    else
    {
        unFaultFlag.bit.bGridOV           = 0;// g_SysFault.ubFaultAc.bit.GridOVP; 不显示
        unFaultFlag.bit.bGridUV           = 0;// g_SysFault.ubFaultAc.bit.GridUVP; 不显示
        unFaultFlag.bit.bGridOF           = 0;// g_SysFault.ubFaultAc.bit.GridOFP; 不显示
        unFaultFlag.bit.bGridUF           = 0;// g_SysFault.ubFaultAc.bit.GridUFP; 不显示
//        unFaultFlag.bit.bGridPhaseLose    = 0;// g_SysFault.ubFaultAc.bit.GridLosePhase; 不显示
        unFaultFlag.bit.bGridSeqInver     = g_SysFault.ubFaultAc.bit.GridPhaseSeqInvert;
//        unFaultFlag.bit.bGridLoseN        = 0;// g_SysFault.ubFaultAc.bit.GridLoseN;      不显示
//        unFaultFlag.bit.bGridUnbalance    = 0;// g_SysFault.ubFaultAc.bit.GridUnbalance;  不显示
//        unFaultFlag.bit.bGridPllFail      = 0;// g_SysFault.ubFaultAc.bit.PhaselockFail;  不显示
//        unFaultFlag.bit.bGridVoltLoss     = 0;// g_SysFault.ubFaultAc.bit.GridDqFastFault;不显示
    }

    // unFaultFlag.bit.bGridIsLand       = g_SysFault.ubFaultAc.bit.IslandFault;
    unFaultFlag.bit.bLVRTAlarm        = g_SysAlarm.ubAlarmAc.bit.LVRT; // 高低穿做为告警
//    unFaultFlag.bit.bUFDerateAlarm    = 0;// g_SysAlarm.ubAlarmAc.bit.UFDerateAlarm; 不显示
//    unFaultFlag.bit.bOFDerateAlarm    = 0;// g_SysAlarm.ubAlarmAc.bit.OFDerateAlarm; 不显示
//    unFaultFlag.bit.bUFUprateAlarm    = 0;// g_SysAlarm.ubAlarmAc.bit.UFUprateAlarm; 不显示
    unFaultFlag.bit.bOverLoadAlarm    = g_SysAlarm.ubAlarmAc.bit.LoadOver;

    // 10
//    unFaultFlag.bit.bGridOverLoadAlarm = 0;
//    unFaultFlag.bit.bGridLineLoss      = 0;// g_SysFault.ubFaultAc.bit.VGridLineFault; 不显示
    unFaultFlag.bit.bHVRTAlarm         = g_SysAlarm.ubAlarmAc.bit.OVRT;
//    unFaultFlag.bit.bGridRsvd3         = 0;
//    unFaultFlag.bit.bGridRsvd4         = 0;
//    unFaultFlag.bit.bGridRsvd5         = 0;
//    unFaultFlag.bit.bGridRsvd6         = 0;
//    unFaultFlag.bit.bGridRsvd7         = 0;

    if(eNoBatt == g_ComInfo.Com1.bit.BatMode && g_ComInfo.Com1.bit.GenConnectEn) // 20250822--改为满足油机检测条件后再报出油机异常告警
    {
        unFaultFlag.bit.bGenOV             = g_SysFault.ubFaultGen.bit.GenOVP || g_SysFault.ubFaultGen.bit.GenDCOVP;
        unFaultFlag.bit.bGenUV             = g_SysFault.ubFaultGen.bit.GenUVP;
        unFaultFlag.bit.bGenOF             = g_SysFault.ubFaultGen.bit.GenOFP;
        unFaultFlag.bit.bGenUF             = g_SysFault.ubFaultGen.bit.GenUFP;
//        unFaultFlag.bit.bGenLossPhase      = 0; // g_SysFault.ubFaultGen.bit.GenLosePhase;
        unFaultFlag.bit.bGenSeqInver       = g_SysFault.ubFaultGen.bit.GenPhaseSeqInvert;
//        unFaultFlag.bit.bGenUnBlc          = 0;
//        unFaultFlag.bit.bGenPllFail        = 0;
    }
    else
    {
        unFaultFlag.bit.bGenOV             = 0; // g_SysFault.ubFaultGen.bit.GenOVP;
        unFaultFlag.bit.bGenUV             = 0; // g_SysFault.ubFaultGen.bit.GenUVP;
        unFaultFlag.bit.bGenOF             = 0; // g_SysFault.ubFaultGen.bit.GenOFP;
        unFaultFlag.bit.bGenUF             = 0; // g_SysFault.ubFaultGen.bit.GenUFP;
//        unFaultFlag.bit.bGenLossPhase      = 0; // g_SysFault.ubFaultGen.bit.GenLosePhase;
        unFaultFlag.bit.bGenSeqInver       = 0;
//        unFaultFlag.bit.bGenUnBlc          = 0;
//        unFaultFlag.bit.bGenPllFail        = 0;
    }

    // 11
//    unFaultFlag.bit.bGenVoltLoss    = 0; // g_SysFault.ubFaultGen.bit.GenDqFastFault; 不显示
//    unFaultFlag.bit.bGenLineLoss    = 0; // g_SysFault.ubFaultGen.bit.VGenLineFault;  不显示
    unFaultFlag.bit.bGenOverLoad    = g_SysFault.ubFaultGen.bit.GenOverLoad;
//    unFaultFlag.bit.bGenRsvd04      = 0;
//    unFaultFlag.bit.bGenRsvd05      = 0;
//    unFaultFlag.bit.bGenRsvd06      = 0;
//    unFaultFlag.bit.bGenRsvd07      = 0;
    unFaultFlag.bit.bCurrSenserFault  = (g_SysFault.ubFaultAc.bit.HwADFaultIInv || g_SysFault.ubFaultAc.bit.HwADFaultIGrid || g_SysFault.ubFaultAc.bit.HwADFaultIGen);// || strSlvState.ubState3.bit.ADFaultVGrid);
    unFaultFlag.bit.bParaOutPhaseLoss = 0;
    unFaultFlag.bit.bParaOutUnBlcAlarm = g_SysFault.ubFaultAc.bit.IacUnbalance;
//    unFaultFlag.bit.bGenRsvd11      = 0;
//    unFaultFlag.bit.bGenRsvd12      = 0;
//    unFaultFlag.bit.bGenRsvd13      = 0;
//    unFaultFlag.bit.bGenRsvd14      = 0;
//    unFaultFlag.bit.bGenRsvd15      = 0;
//    unFaultFlag.bit.bGenRsvd16      = 0;

    // 12
//    unFaultFlag.bit.bDCLightAlarm        = 0;
//    unFaultFlag.bit.bACLightAlarm        = 0;
    // unFaultFlag.bit.bHeatTempDerateAlarm = g_SysAlarm.ubAlarmAc.bit.HeatTempOvDerate || g_SysAlarm.ubAlarmAc.bit.EnviTempOvDerate;
//    unFaultFlag.bit.bEnviTempDerateAlarm = 0;// g_SysAlarm.ubAlarmAc.bit.EnviTempOvDerate;
//    unFaultFlag.bit.bAFCIComAlarm        = 0;
    unFaultFlag.bit.bSysFANAlarm1        = strSlvState.ubState2.bit.Fan1Err || strSlvState.ubState2.bit.Fan2Err;
//    unFaultFlag.bit.bSysFANAlarm2        = 0;// strSlvState.ubState2.bit.Fan2Err;
//    unFaultFlag.bit.bSysFANAlarm3        = 0;
//    unFaultFlag.bit.bSysFANAlarm4        = 0;
//    unFaultFlag.bit.bSysFANAlarmInner    = 0;
    // unFaultFlag.bit.bKeyOffAlarm         = g_SysAlarm.ubAlarmSys.bit.EPOAlarm;// || strSlvState.ubState3.bit.EpoFault;
    // unFaultFlag.bit.bRemoteOffAlarm      = g_SysAlarm.ubAlarmSys.bit.RemoteOff;
//    unFaultFlag.bit.bSysRsvd1Alarm       = g_SysAlarm.ubAlarmSys.bit.ParaL2Lose || g_SysAlarm.ubAlarmSys.bit.ParaL3Lose;
//    unFaultFlag.bit.bSysRsvd2Alarm       = 0;
//    unFaultFlag.bit.bSysRsvd3Alarm       = 0;
//    unFaultFlag.bit.bSysRsvd4Alarm       = 0;



// 故障模拟
// unFaultFlag.uiFaultArray[1] = uiSciCommandDataBag[eComRsvd18];
// unFaultFlag.uiFaultArray[2] = uiSciCommandDataBag[eComRsvd19];
// unFaultFlag.uiFaultArray[3] = uiSciCommandDataBag[eComRsvd20];
// unFaultFlag.uiFaultArray[4] = uiSciCommandDataBag[eComRsvd21];
// unFaultFlag.uiFaultArray[5] = uiSciCommandDataBag[eComBatteyAddr];
// unFaultFlag.uiFaultArray[6] = uiSciCommandDataBag[eComNotSaveRsvd1];
// unFaultFlag.uiFaultArray[7] = uiSciCommandDataBag[eComNotSaveRsvd2];
// unFaultFlag.uiFaultArray[8] = uiSciCommandDataBag[eComNotSaveRsvd3];
// unFaultFlag.uiFaultArray[9] = uiSciCommandDataBag[eComNotSaveRsvd4];
// unFaultFlag.uiFaultArray[10] = uiSciCommandDataBag[eComNotSaveRsvd5];
// unFaultFlag.uiFaultArray[11] = uiSciCommandDataBag[eComNotSaveRsvd6];
// unFaultFlag.uiFaultArray[12] = uiSciCommandDataBag[eComNotSaveRsvd7];


}

/******************************************************************************
Function Name           : MonitorProtocol_PowerMsgShow
------------------------------------------------------------------------------
Function Descriptions   : 更新功率信息
Parameter Name list     :
ReturnType              :
Refer documents         : 20ms Task
******************************************************************************/
void MonitorProtocol_PowerMsgShow(void)
{
    //========================================================
    //NO1.源存在条件：PV、Bat、Grid 都是电压，Load是继电器
    //NO2.流动：PV折算功率不为0，Bat、Grid、Gen、Load、Smartload都是继电器
    //NO3.流动方向：PV、Gen、Load、Smartload只有单个方向，Bat、Grid双向流动
    //========================================================

    //--------------------------
    // 1. Grid
    //--------------------------
    if(stValue.fRmsReal.VGridA >= 89) // 大于89V才可能点亮
    {
        //Step1:源是否有电压
        unPowerFlowMsg.BIT.bLine = 1;
        //Step2:源正常
        if(g_SysFault.ubFaultAc.fault.fault1) { unPowerFlowMsg2.BIT.bLineFlash = 1; }
        else                                  { unPowerFlowMsg2.BIT.bLineFlash = 0; }
        //Step3:功率折算不为0，流动，负值为馈电
        if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GridRlySta)
        {
            unPowerFlowMsg.BIT.bLineFlow = 1;
            // if(ARPToCTMode == uiSciSetDataBag[eSetWorkMode])
            // {
            //     if(stPower.fGridCtPowerAll > 0.005f) // 0.005大概是30W
            //     {
            //         // unPowerFlowMsg.BIT.bLineFlow = 1;
            //         // if(stPower.fGridCtPowerAll < 0)
            //         // {
            //         //     unPowerFlowMsg.BIT.bLinePowerDire = 0;
            //         // }
            //         // else if(stPower.fGridCtPowerAll > 0)  // CT功率大于0是馈电
            //         // {
            //         //     unPowerFlowMsg.BIT.bLinePowerDire = 1;//馈电
            //         // }
            //         unPowerFlowMsg.BIT.bLinePowerDire = 1; //馈电
            //     }
            //     else
            //     {
            //         unPowerFlowMsg.BIT.bLinePowerDire = 0; //CT功率小于30W，都判定为取电(取电为负)
            //     }
            // }
            // else
            // {
                // if(fabs(stPower.fPGridTotal) > 0.005)
                // {
                //     // unPowerFlowMsg.BIT.bLineFlow = 1;
                //     if(stPower.fPGridTotal > 0)
                //     {
                //         unPowerFlowMsg.BIT.bLinePowerDire = 0;
                //     }
                //     else if(stPower.fPGridTotal < 0)  // 电网功率大于0是取电
                //     {
                //         unPowerFlowMsg.BIT.bLinePowerDire = 1;//馈电
                //     }
                // }
                // else
                // {
                // 	unPowerFlowMsg.BIT.bLinePowerDire = 0;
                // }
                if(stPower.fPGridTotal < -0.005f)
                {
                    unPowerFlowMsg.BIT.bLinePowerDire = 1;  // 馈电
                }
                else
                {
                    unPowerFlowMsg.BIT.bLinePowerDire = 0;  // 电网功率小于30W，都判定为取电(取电为负)
                }
            // }
        }
        else//Step4:功率折算为0，不流动，默认取电
        {
            unPowerFlowMsg.BIT.bLineFlow = 0;
            unPowerFlowMsg.BIT.bLinePowerDire = 0;
        }
    }
    else
    {
        unPowerFlowMsg.BIT.bLine = 0;
        unPowerFlowMsg.BIT.bLinePowerDire = 0;
        unPowerFlowMsg.BIT.bLineFlow = 0;
        unPowerFlowMsg2.BIT.bLineFlash = 0;
    }

    //--------------------------
    // 2. Gen
    // 需要考虑智能负载这个因素的显示
    //--------------------------
    if(eGenPortMode_Generator == g_ComInfo.Com1.bit.GenModeSet) // 311 油机模式
    {
        if(   (stValue.fRmsReal.VGenA > 60)
        //    || (stValue.fRmsReal.VGenB > 60)
            )
        {
            //Step1:源是否有电压
            unPowerFlowMsg.BIT.bGen = 1;
            //Step2:源是否正常
            if(g_SysFault.ubFaultGen.all) { unPowerFlowMsg2.BIT.bGenFlash = 1; }
            else                          { unPowerFlowMsg2.BIT.bGenFlash = 0; }
            //Step3:功率折算不为0，流动，负值为馈电
            if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta)
            {
                unPowerFlowMsg.BIT.bGenFlow = 1;
                unPowerFlowMsg.BIT.bGenPowerDire = 0;//油机只能取电
            }
            else//Step2:功率折算为0，不流动，默认取电
            {
                unPowerFlowMsg.BIT.bGenFlow = 0;
                unPowerFlowMsg.BIT.bGenPowerDire = 0;
            }
        }
        else
        {
            unPowerFlowMsg.BIT.bGen = 0;
            unPowerFlowMsg.BIT.bGenPowerDire = 0;
            unPowerFlowMsg.BIT.bGenFlow = 0;
            unPowerFlowMsg2.BIT.bGenFlash = 0;
        }

        unPowerFlowMsg.BIT.bSmartLoad = 0;
        unPowerFlowMsg.BIT.bSmartLoadFlow = 0;
    }
    else if(eGenPortMode_SmartLoad == g_ComInfo.Com1.bit.GenModeSet) // 311 油机模式 选择智能负载
    {
        unPowerFlowMsg.BIT.bGen = 0;
        unPowerFlowMsg.BIT.bGenPowerDire = 0;
        unPowerFlowMsg.BIT.bGenFlow = 0;
        unPowerFlowMsg2.BIT.bGenFlash = 0;
        // if(   (   (g_InvVar.InvFlag.bit.bInvMainSts == eInvMainState_SoftStart)
        //        || (g_InvVar.InvFlag.bit.bInvMainSts == eInvMainState_OffGrid)
        //        || (g_InvVar.InvFlag.bit.bInvMainSts == eInvMainState_OnGrid) ) // 逆变器工作：旁路、离网、并网输出 且 油机继电器吸合
        //    && (fabs(stPower.fPGenTotal) > 0.005f) //Step3:功率折算不为0，流动，负值为馈电
        //    && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta) )
        if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta)
        {
            unPowerFlowMsg.BIT.bSmartLoad = 1;
            unPowerFlowMsg.BIT.bSmartLoadFlow = 1; // 空载下也默认流动流出
            // if(fabs(stPower.fPGenTotal) > 0.005f) //Step3:功率折算不为0，流动，负值为馈电
            // {
            //     unPowerFlowMsg.BIT.bSmartLoadFlow = 1;//流动
            // }
            // else
            // {
            //     unPowerFlowMsg.BIT.bSmartLoadFlow = 0;//流动
            // }
        }
        else
        {
            unPowerFlowMsg.BIT.bSmartLoad = 0;
            unPowerFlowMsg.BIT.bSmartLoadFlow = 0;
        }
    }
    else
    {
        unPowerFlowMsg.BIT.bGen = 0;
        unPowerFlowMsg.BIT.bGenPowerDire = 0;
        unPowerFlowMsg.BIT.bGenFlow = 0;
        unPowerFlowMsg2.BIT.bGenFlash = 0;
        unPowerFlowMsg.BIT.bSmartLoad = 0;
        unPowerFlowMsg.BIT.bSmartLoadFlow = 0;
    }

    //--------------------------
    // 3. Load
    //--------------------------
    /*if(   (eRelayStateClose == g_RelayVar.CtrlSta.bit.InvRlySta)
        || (   (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridRlySta)
            && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridSlaveRlySta) )
        )//Step1:继电器闭合*/
    if(    eRelayStateClose == g_RelayVar.CtrlSta.bit.InvRlySta 
        || eRelayStateClose == g_RelayVar.CtrlSta.bit.GridRlySta
        || (eGenPortMode_Generator == g_ComInfo.Com1.bit.GenModeSet && eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta)
        )
    {
        unPowerFlowMsg.BIT.bLoad = 1;
        unPowerFlowMsg.BIT.bLoadFlow = 1;
        unPowerFlowMsg.BIT.bLoadPowerDire = 0; // 流向负载
        // if(uiFrameParallelEnable)
        // {
        //     if(   (fabs(stPower.POut.PhaseA) > 0.01)
        //     //    || (fabs(stPower.POut.PhaseB) > 0.01)
        //        || (fabs(stPower.PHomeLoad.PhaseA) > 0.01)
        //     //    || (fabs(stPower.PHomeLoad.PhaseB) > 0.01)
        //        )
        //     {
        //         unPowerFlowMsg.BIT.bLoadFlow = 1;//流动
        //         if(   (stPower.POut.PhaseA < 0)
        //         //    || (stPower.POut.PhaseB < 0)
        //            || (stPower.PHomeLoad.PhaseA < 0)
        //         //    || (stPower.PHomeLoad.PhaseB < 0)
        //            )
        //         {
        //             unPowerFlowMsg.BIT.bLoadPowerDire = 1; // 负载流向外面
        //         }
        //         else
        //         {
        //             unPowerFlowMsg.BIT.bLoadPowerDire = 0; // 流向负载
        //         }
        //     }
        //     else
        //     {
        //         unPowerFlowMsg.BIT.bLoadFlow = 0;
        // 		unPowerFlowMsg.BIT.bLoadPowerDire = 0; // 流向负载
        //     }
        // }
        // else
        // {
        //     if(   (stPower.POut.PhaseA > 0.01)
        //     //    || (stPower.POut.PhaseB > 0.01)
        //        || (stPower.PHomeLoad.PhaseA > 0.01)
        //     //    || (stPower.PHomeLoad.PhaseB > 0.01)
        //        )
        //     {
        //         unPowerFlowMsg.BIT.bLoadFlow = 1;//流动
        //     }
        //     else
        //     {
        //         unPowerFlowMsg.BIT.bLoadFlow = 0;
        //     }
        //     unPowerFlowMsg.BIT.bLoadPowerDire = 0; // 流向负载
        // }
    }
    else
    {
        unPowerFlowMsg.BIT.bLoad = 0;
        unPowerFlowMsg.BIT.bLoadFlow = 0;
        unPowerFlowMsg.BIT.bLoadPowerDire = 0; // 流向负载
    }
    //--------------------------
    // 4. PV 90V是工作电压
    //--------------------------
    // if((strSlvAnalog.fVoltPv1 > 90) || (strSlvAnalog.fVoltPv2 > 90))
    if((!strSlvState.ubState1.bit.Pv1Loss) || (!strSlvState.ubState1.bit.Pv2Loss))
    {
        unPowerFlowMsg.BIT.bPV = 1;
        if(   (ePvMainState_Running == strSlvState.ubState1.bit.PvStateMachine)
        //    && (strSlvAnalog.fPvPowerAll > 50)
            )//Power Flow
        {
            unPowerFlowMsg.BIT.bPVFlow = 1;
        }
        else
        {
            unPowerFlowMsg.BIT.bPVFlow = 0;
        }
    }
    else
    {
        unPowerFlowMsg.BIT.bPV = 0;
        unPowerFlowMsg.BIT.bPVFlow = 0;
    }

    //--------------------------
    // 5. BAT
    //--------------------------
/*
    if(eNoBatt == g_ComInfo.Com1.bit.BatMode)
    {
        unPowerFlowMsg.BIT.bBattery = 0;
        unPowerFlowMsg.BIT.bBatteryEnerDire = 0;
        unPowerFlowMsg.BIT.bBatteryFlow = 0;
        unPowerFlowMsg2.BIT.bBatteryFlash = 0;
    }
    else
    {
        //Step1:源
        unPowerFlowMsg.BIT.bBattery = 1;

        if(eBatNormal == g_SystemInfo.Source.bit.BatSource)
        {
            unPowerFlowMsg.BIT.bBatteryFlow = 1;
            if(   (0 != stPower.fPBatReal)//Step3:功率折算不为0，流动，正值为放电
               && (eDcDcRunState_Boost == g_DcDcVar.DcDcFlag.bit.bDcDcRunSts) )
            //    && (eDcDcRunState_Boost == g_DcDcVar.DcDcFlag.bit.bDcDcRunSts || g_ComInfo.Com1.bit.LiActLLCWork) )
            {
                if(stPower.fPBatReal < -20)//充电  //对于逆变器内部来说放电为正,充电为负
                {
                    unPowerFlowMsg.BIT.bBatteryEnerDire = 0;
                }
                else if(stPower.fPBatReal > 20)//放电
                {
                    unPowerFlowMsg.BIT.bBatteryEnerDire = 1;
                }
            }
            else//Step2:功率折算为0，不流动，默认放电
            {
                if(    (   ((g_InvVar.InvFlag.bit.bInvMainSts == eInvMainState_OnGrid) && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridRlySta)) 
                        || ((g_InvVar.InvFlag.bit.bInvMainSts == eInvMainState_OnGen)  && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta)) )
                    && (eDcDcRunState_Boost == g_DcDcVar.DcDcFlag.bit.bDcDcRunSts)
                    // && (eDcDcRunState_Boost == g_DcDcVar.DcDcFlag.bit.bDcDcRunSts || g_ComInfo.Com1.bit.LiActLLCWork) // 并网、并油机下，LLC开启或锂电激活，功率为0也判定为充电
                    )
                {
                    unPowerFlowMsg.BIT.bBatteryEnerDire = 0; //charge
                }
                else
                {
                    unPowerFlowMsg.BIT.bBatteryEnerDire = 1; //discharge
                }
            }
        }
        else
        {
            unPowerFlowMsg.BIT.bBatteryEnerDire = 0;
            unPowerFlowMsg.BIT.bBatteryFlow = 0;
        }

        // 非无电池模式下，电池开路/踢电池/电池激活，电池图标闪烁
        if(    (eBatNormal != g_SystemInfo.Source.bit.BatSource)
            || (eBat_Normal != g_uiBatAbnormalFlg)
            || (eActiveByNull != g_ComInfo.Com1.bit.LiActiveSource)
            )
        {
            unPowerFlowMsg2.BIT.bBatteryFlash = 1;
        }
        else
        {
            unPowerFlowMsg2.BIT.bBatteryFlash = 0;
        }
    }
*/

    int16 i16BatPowerTemp = 0;
    i16BatPowerTemp = ((int16)uiSciAnalogDataBag[eAnalogBat1Power]);  // 显示充电是正

    if(eNoBatt == g_ComInfo.Com1.bit.BatMode)
    {
        unPowerFlowMsg.BIT.bBattery = 0;
        unPowerFlowMsg.BIT.bBatteryEnerDire = 0;
        unPowerFlowMsg.BIT.bBatteryFlow = 0;
        unPowerFlowMsg2.BIT.bBatteryFlash = 0;
    }
    else
    {
        //Step1:源
        unPowerFlowMsg.BIT.bBattery = 1;

        if(   (eBatNormal == g_SystemInfo.Source.bit.BatSource)
           || (eActiveByNull != g_ComInfo.Com1.bit.LiActiveSource) )
        {
            if(   (0 != i16BatPowerTemp)//Step3:功率折算不为0，流动，正值为放电
               && (   (eDcDcRunState_Boost == g_DcDcVar.DcDcFlag.bit.bDcDcRunSts)
                   || (eActiveByNull != g_ComInfo.Com1.bit.LiActiveSource) )
                )
            {
                unPowerFlowMsg.BIT.bBatteryFlow = 1;
                if(i16BatPowerTemp > 20) //充电
                {
                    unPowerFlowMsg.BIT.bBatteryEnerDire = 0; //charge
                }
                else if(i16BatPowerTemp < -20) //放电
                {
                    unPowerFlowMsg.BIT.bBatteryEnerDire = 1; //discharge
                }
            }
            else//Step2:功率折算为0，不流动，默认放电
            {
                unPowerFlowMsg.BIT.bBatteryFlow = 0;
                unPowerFlowMsg.BIT.bBatteryEnerDire = 1; //discharge
            }
        }
        else
        {
            unPowerFlowMsg.BIT.bBattery = 0;
            unPowerFlowMsg.BIT.bBatteryEnerDire = 0;
            unPowerFlowMsg.BIT.bBatteryFlow = 0;
        }

        // 非无电池模式下，电池开路/踢电池/电池激活，电池图标闪烁
        if(    (eBatNormal != g_SystemInfo.Source.bit.BatSource)
            || (eBat_Normal != g_uiBatAbnormalFlg)
            || (eActiveByNull != g_ComInfo.Com1.bit.LiActiveSource)
            )
        {
            unPowerFlowMsg2.BIT.bBatteryFlash = 1;
        }
        else
        {
            unPowerFlowMsg2.BIT.bBatteryFlash = 0;
        }
    }

    //--------------------------
    // 6. Mirco Inv
    //--------------------------
    if(   (eGenPortMode_MicroInv == g_ComInfo.Com1.bit.GenModeSet)      //
       && (FALSE == uiFrameParallelEnable)                              // 油机模式选择AC CUP 只允许单机
       && (g_InvVar.InvFlag.bit.bInvMainSts >= eInvMainState_OffGrid) ) // 等机器运行起来后，再判断
    {
        if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta)        // 微逆继电器已经闭合
        {
            //Step1:源
            unPowerFlowMsg2.BIT.bMicroInv = 1;
            // 离网：微逆给逆变器强行灌能量，发电机口功率是负数
            // 并网：微逆可能馈电到电网也可能对电池充电 逆变器可能工作在整流 也可能逆变
            if(   (g_InvVar.InvFlag.bit.bInvMainSts == eInvMainState_OffGrid)
               || (g_InvVar.InvFlag.bit.bInvMainSts == eInvMainState_OnGrid) )
            {
                // 微逆只有发电给逆变器  方向只有取电方向
                if(stPower.fPGenReal < -60)  // 硬件采样馈电是正数
                {
                    unPowerFlowMsg2.BIT.bMicroInvFlow = 1;
                }
                else
                {
                    unPowerFlowMsg2.BIT.bMicroInvFlow = 0;
                }
            }
            else
            {
                unPowerFlowMsg2.BIT.bMicroInv = 0;
                unPowerFlowMsg2.BIT.bMicroInvFlow = 0;
            }
        }
        else
        {
            unPowerFlowMsg2.BIT.bMicroInv = 0;
            unPowerFlowMsg2.BIT.bMicroInvFlow = 0;
        }
    }
    else
    {
        unPowerFlowMsg2.BIT.bMicroInv = 0;
        unPowerFlowMsg2.BIT.bMicroInvFlow = 0;
    }

}

/******************************************************************************
Function Name           :
------------------------------------------------------------------------------
Function Descriptions   : 更新模拟量
Parameter Name list     :
ReturnType              :
Refer documents         : 100ms
******************************************************************************/
void MonitorProtocol_AnologShowDeal(void)  // 显示参数更新
{
    if(g_SystemInfo.SysFlag.bit.InvWorkStart)
    {
        g_SystemInfo.uiInvFreq = g_StrEcap.FreqFilt.Inv * 100;
    }
    else
    {
        g_SystemInfo.uiInvFreq = 0;
    }

    if(eGenPortMode_Generator == g_ComInfo.Com1.bit.GenModeSet && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta))
    {
        g_SystemInfo.uiOutFreq = g_StrEcap.FreqFilt.Gen * 100;
    }
    else if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GridRlySta)
    {
        g_SystemInfo.uiOutFreq = g_StrEcap.FreqFilt.Grid * 100;
    }
    else if((g_SystemInfo.SysFlag.bit.InvWorkStart) && (eRelayStateClose == g_RelayVar.CtrlSta.bit.InvRlySta))
    {
        g_SystemInfo.uiOutFreq = g_StrEcap.FreqFilt.Inv * 100;
    }
    else
    {
        g_SystemInfo.uiOutFreq = 0;
    }

    // 电压大于50V就可以显示频率
    // if(	 ((stValue.fRmsReal.VGridA > fRealVolt50V)&&(stValue.fRmsReal.VGridB > fRealVolt50V))
	//  //  ||(stValue.fRmsReal.VLineAB > fRealVolt50V) )
    if(stValue.fRmsReal.VGridA > fRealVolt50V)
    {
        g_SystemInfo.uiGridFreq = g_StrEcap.FreqFilt.Grid * 100;
    }
    else
    {
        g_SystemInfo.uiGridFreq = 0;
    }

//     if(  ((stValue.fRmsReal.VGenA > fRealVolt50V)&&(stValue.fRmsReal.VGenB > fRealVolt50V))
// //	   ||(stValue.fRmsReal.VGenAB > fRealVolt50V)
// 	  )
    if(stValue.fRmsReal.VGenA > fRealVolt50V)
    {
        if(eGenPortMode_Generator == g_ComInfo.Com1.bit.GenModeSet)     // 发电机模式
        {
            g_SystemInfo.uiGenFreq = g_StrEcap.FreqFilt.Gen * 100;
        }
        else if(   (eGenPortMode_SmartLoad == g_ComInfo.Com1.bit.GenModeSet)
                && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta)
                // && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GenNRlySta)
                )  // 智能负载模式且智能负载继电器已经闭合
        {
            if(   (eInvMainState_OnGrid == g_InvVar.InvFlag.bit.bInvMainSts)          // 并网模式
               || (   (eInvMainState_SoftStart == g_InvVar.InvFlag.bit.bInvMainSts)   // 旁路模式
                   && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridRlySta)
                   && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridNRlySta)
                //    && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridSlaveRlySta)
                //    && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridNSlaveRlySta)
                    )
                )
            {
                g_SystemInfo.uiGenFreq = g_StrEcap.FreqFilt.Grid * 100;
            }
            else if(eInvMainState_OffGrid == g_InvVar.InvFlag.bit.bInvMainSts)
            {
                g_SystemInfo.uiGenFreq = g_StrEcap.FreqFilt.Inv * 100;
            }
            else
            {
                g_SystemInfo.uiGenFreq = 0;
            }
        }
        else
        {
            g_SystemInfo.uiGenFreq = 0;
        }
    }
    else
    {
        g_SystemInfo.uiGenFreq = 0;
    }

}

/******************************************************************************
Function Name           :
------------------------------------------------------------------------------
Function Descriptions   : 更新模块状态信息
Parameter Name list     :
ReturnType              :
Refer documents         : 20ms
******************************************************************************/
void MonitorProtocol_ModuleStateShow(void)
{
    // Pv1 状态显示
    if(eSystemInitAllSuccess > g_SystemVar.SysRunFlag.bit.bSystemInitState)
    {
        g_SystemInfo.unSystemState1.bit.bPv1State = ePvState_Init;
    }
    else if(g_SysFault.ubFaultSys.bit.SChip_Fault)
    {
        g_SystemInfo.unSystemState1.bit.bPv1State = ePvState_Fault;
    }
    else if(ePvMainState_Init == strSlvState.ubState1.bit.PvStateMachine)
    {
        g_SystemInfo.unSystemState1.bit.bPv1State = ePvState_StandBy;
    }
    else if(   (ePvMainState_Running == strSlvState.ubState1.bit.PvStateMachine)
            && (strSlvState.ubState1.bit.Pv1Work) )
    {
        g_SystemInfo.unSystemState1.bit.bPv1State = ePvState_Run;
    }

    // Pv2 状态显示
    if(eSystemInitAllSuccess > g_SystemVar.SysRunFlag.bit.bSystemInitState)
    {
        g_SystemInfo.unSystemState1.bit.bPv2State = ePvState_Init;
    }
    else if(g_SysFault.ubFaultSys.bit.SChip_Fault)
    {
        g_SystemInfo.unSystemState1.bit.bPv2State = ePvState_Fault;
    }
    else if(ePvMainState_Init == strSlvState.ubState1.bit.PvStateMachine)
    {
        g_SystemInfo.unSystemState1.bit.bPv2State = ePvState_StandBy;
    }
    else if(   (ePvMainState_Running == strSlvState.ubState1.bit.PvStateMachine)
            && (strSlvState.ubState1.bit.Pv2Work) )
    {
        g_SystemInfo.unSystemState1.bit.bPv2State = ePvState_Run;
    }

    // Bat 状态显示
    if(eDcDcMainState_Running != g_DcDcVar.DcDcFlag.bit.bMainSts)
    {
        g_SystemInfo.unSystemState1.bit.bBat1State = eBatState_StandBy;
    }
    else
    {
        if(stPower.fPBatReal < -20)
        {
            g_SystemInfo.unSystemState1.bit.bBat1State = eBatState_Charge;
        }
        else if(stPower.fPBatReal > 20)
        {
            g_SystemInfo.unSystemState1.bit.bBat1State = eBatState_DisCharge;
        }
    }

    // Bat 充电状态显示
    if(strBMSLogicInfo.uiBMS1Connect)
    {
        if(stValue.fAveReal.IDcDc > 1.5) // 放电大于1.5A
        {
            g_SystemInfo.unSystemState1.bit.bBat1CharState = eBatManage_DisCharge;
        }
        else
        {
            if((1000 == strBMSLogicInfo.uiBMS1BatSOC) || (1 == strBMSLogicInfo.uiBMS1BatStopChargeFlag)) // 锂电SOC=100% 或 停止充电 判定为充满
            {
                g_SystemInfo.unSystemState1.bit.bBat1CharState = eBatManage_FlotCharg;
            }
            else
            {
                g_SystemInfo.unSystemState1.bit.bBat1CharState = eBatManage_VoltCharge;
            }
        }
    }
    else
    {
        if(eBatManage_VoltCharge == strBatChgState.unFlag.bit.bChgMode)
        {
            g_SystemInfo.unSystemState1.bit.bBat1CharState = eBatManage_VoltCharge;
        }
        else if(eBatManage_FlotCharg == strBatChgState.unFlag.bit.bChgMode)
        {
            g_SystemInfo.unSystemState1.bit.bBat1CharState = eBatManage_FlotCharg;
        }
        else
        {
            g_SystemInfo.unSystemState1.bit.bBat1CharState = eBatManage_DisCharge;
        }
    }
    // Inv状态显示
    if(eInvMainState_Fault == g_InvVar.InvFlag.bit.bInvMainSts)
    {
        g_SystemInfo.unSystemState2.bit.bInvState = eInvState_Fault;
    }
    else if(eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts)
    {
        g_SystemInfo.unSystemState2.bit.bInvState = eInvState_StandBy;
    }
    else if(eInvMainState_SelfCheck == g_InvVar.InvFlag.bit.bInvMainSts)
    {
        g_SystemInfo.unSystemState2.bit.bInvState = eInvState_SelfCheck;
    }
    else if(eInvMainState_SoftStart == g_InvVar.InvFlag.bit.bInvMainSts)
    {
        if(   (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridRlySta)
           && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridNRlySta)
        //    && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridSlaveRlySta)
        //    && (eRelayStateClose == g_RelayVar.CtrlSta.bit.GridNSlaveRlySta)
            )
        {
            g_SystemInfo.unSystemState2.bit.bInvState = eInvState_Bypass;
        }
        else
        {
            g_SystemInfo.unSystemState2.bit.bInvState = eInvState_SoftStart;
        }
    }
    else if(eInvMainState_OffGrid == g_InvVar.InvFlag.bit.bInvMainSts)
    {
        g_SystemInfo.unSystemState2.bit.bInvState = eInvState_OffGrid;
    }
    else if(eInvMainState_OnGen == g_InvVar.InvFlag.bit.bInvMainSts)
    {
        g_SystemInfo.unSystemState2.bit.bInvState = eInvState_OnGen;
    }
    else if(eInvMainState_OnGrid == g_InvVar.InvFlag.bit.bInvMainSts)
    {
        g_SystemInfo.unSystemState2.bit.bInvState = eInvState_OnGrid;
    }

    // 逆变继电器
    g_SystemInfo.unSystemState2.bit.bMasterSlaver = 0;  // 主机
    if(eRelayStateClose == g_RelayVar.CtrlSta.bit.InvRlySta)
    {
        g_SystemInfo.unSystemState2.bit.bInvRelay = eRelayStateShowClose;
    }
    else if(eRelayStateOpen == g_RelayVar.CtrlSta.bit.InvRlySta)
    {
        g_SystemInfo.unSystemState2.bit.bInvRelay = eRelayStateShowOpen;
    }

    // if(eRelayStateClose == g_RelayVar.CtrlSta.bit.InvNRlySta)
    // {
    //     g_SystemInfo.unSystemState2.bit.bInvNRelay = eRelayStateShowClose;
    // }
    // else if(eRelayStateOpen == g_RelayVar.CtrlSta.bit.InvRlySta)
    // {
    //     g_SystemInfo.unSystemState2.bit.bInvNRelay = eRelayStateShowOpen;
    // }

    // 电网继电器
    if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GridRlySta)
    {
        g_SystemInfo.unSystemState2.bit.bGridRelay = eRelayStateShowClose;
    }
    else if(eRelayStateOpen == g_RelayVar.CtrlSta.bit.GridRlySta)
    {
        g_SystemInfo.unSystemState2.bit.bGridRelay = eRelayStateShowOpen;
    }

    if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GridNRlySta)
    {
        g_SystemInfo.unSystemState2.bit.bGridNRelay = eRelayStateShowClose;
    }
    else if(eRelayStateOpen == g_RelayVar.CtrlSta.bit.GridNRlySta)
    {
        g_SystemInfo.unSystemState2.bit.bGridNRelay = eRelayStateShowOpen;
    }

    // if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GridSlaveRlySta)
    // {
    //     g_SystemInfo.unSystemState2.bit.bGridSlaveRelay = eRelayStateShowClose;
    // }
    // else if(eRelayStateOpen == g_RelayVar.CtrlSta.bit.GridSlaveRlySta)
    // {
    //     g_SystemInfo.unSystemState2.bit.bGridSlaveRelay = eRelayStateShowOpen;
    // }

    // if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GridNSlaveRlySta)
    // {
    //     g_SystemInfo.unSystemState2.bit.bGridSlaveNRelay = eRelayStateShowClose;
    // }
    // else if(eRelayStateOpen == g_RelayVar.CtrlSta.bit.GridNSlaveRlySta)
    // {
    //     g_SystemInfo.unSystemState2.bit.bGridSlaveNRelay = eRelayStateShowOpen;
    // }

    // 发电机继电器
    if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GenRlySta)
    {
        g_SystemInfo.unSystemState2.bit.bGenRelay = eRelayStateShowClose;
    }
    else if(eRelayStateOpen == g_RelayVar.CtrlSta.bit.GenRlySta)
    {
        g_SystemInfo.unSystemState2.bit.bGenRelay = eRelayStateShowOpen;
    }

    // if(eRelayStateClose == g_RelayVar.CtrlSta.bit.GenNRlySta)
    // {
    //     g_SystemInfo.unSystemState2.bit.bGenNRelay = eRelayStateShowClose;
    // }
    // else if(eRelayStateOpen == g_RelayVar.CtrlSta.bit.GenNRlySta)
    // {
    //     g_SystemInfo.unSystemState2.bit.bGenNRelay = eRelayStateShowOpen;
    // }

    // 负载继电器 15k没有负载继电器
    g_SystemInfo.unSystemState2.bit.bLoadRelay = g_SystemInfo.unSystemState2.bit.bInvRelay;
    // 干接点
//    if(  (eGenPortMode_Generator == g_ComInfo.Com1.bit.GenModeSet)
//      && (g_SystemInfo.SysFlag.bit.GenStartSignal)
//      && (FALSE == g_SysFault.Flag.bit.GenFault) )
    if(   g_SystemInfo.SysFlag.bit.GenStartSignal
        && g_ComInfo.Com1.bit.GenConnectEn )
    {
        g_SystemInfo.unSystemState2.bit.bDryIO = eRelayStateShowClose;
    }
    else
    {
        g_SystemInfo.unSystemState2.bit.bDryIO = eRelayStateShowOpen;
    }
}

/******************************************************************************
Function Name           :
------------------------------------------------------------------------------
Function Descriptions   : 更新模拟量
Parameter Name list     :
ReturnType              :
Refer documents         : 100ms  特别注意：上传负的浮点数时，要将浮点数先转成有符号整数，再赋给无符号数组,否则会出错！
******************************************************************************/
// #define AnologUpdateForDebug 1
void MonitorProtocol_AnologUpdate(void)
{
    static Uint16 uiRenewStep = 0;
    // float32 ftemp = 0;

    //-----------------------------------------------------------------------------------------
    switch(uiRenewStep++)
    {
        case 0:
        {
            uiSciAnalogDataBag[ eAnalogWorkMode           ] = g_SystemInfo.usSystemMode; // g_SystemVar.SysRunFlag.all;//
            uiSciAnalogDataBag[ eAnalogState1             ] = g_SystemInfo.unSystemState1.all;
            uiSciAnalogDataBag[ eAnalogState2             ] = g_SystemInfo.unSystemState2.all;//cVerDate;
            uiSciAnalogDataBag[ eAnalogState3             ] = g_SystemInfo.unSystemState3.all;//cDSPVersion;
            uiSciAnalogDataBag[ eAnalogState4             ] = g_SystemInfo.Source.all;//g_SystemInfo.unSystemState4.all;//

            uiSciAnalogDataBag[ eAnalogYearMonth          ] = ((g_ComInfo.uiSystemClock1YearCount & 0x00FF) << 8) + (g_ComInfo.uiSystemClock1MonthCount & 0x00FF);
            uiSciAnalogDataBag[ eAnalogDayHour            ] = ((g_ComInfo.uiSystemClock1DayCount & 0x00FF) << 8)  + (g_ComInfo.uiSystemClock1hourCount & 0x00FF);
            uiSciAnalogDataBag[ eAnalogMinuteSecond       ] = ((g_ComInfo.uiSystemClock1minCount & 0x00FF) << 8)  + (g_ComInfo.uiSystemClock1sCount & 0x00FF);
            uiSciAnalogDataBag[ eAnalogWeek               ] = g_ComInfo.uiSystemClockWeekCount;

            uiSciAnalogDataBag[ eAnalogWarnCode           ] = uiWarnCode;    //  9   告警码
            uiSciAnalogDataBag[ eAnalogFaultCode          ] = uiFaultCode;   //  10  故障码
            uiSciAnalogDataBag[ eAnalogWarnState1         ] = unFaultFlag.uiFaultArray[7]   ;   //  11  警告标志 1
            uiSciAnalogDataBag[ eAnalogWarnState2         ] = unFaultFlag.uiFaultArray[8]   ;   //  12  警告标志 2
            uiSciAnalogDataBag[ eAnalogWarnState3         ] = unFaultFlag.uiFaultArray[9]   ;   //  13  警告标志 3
            uiSciAnalogDataBag[ eAnalogWarnState4         ] = unFaultFlag.uiFaultArray[10]  ;   //  14  警告标志 4
            uiSciAnalogDataBag[ eAnalogFaultCode1         ] = unFaultFlag.uiFaultArray[11]  ;   //  15  警告标志 5
            uiSciAnalogDataBag[ eAnalogFaultCode2         ] = unFaultFlag.uiFaultArray[12]  ;   //  16  警告标志 6
            uiSciAnalogDataBag[ eAnalogFaultCode3         ] = unFaultFlag.uiFaultArray[0]   ;   //  17  故障码1
            uiSciAnalogDataBag[ eAnalogFaultCode4         ] = unFaultFlag.uiFaultArray[1]   ;   //  18  故障码2
            uiSciAnalogDataBag[ eAnalogFaultCode5         ] = unFaultFlag.uiFaultArray[2]   ;   //  19  故障码3
            uiSciAnalogDataBag[ eAnalogFaultCode6         ] = unFaultFlag.uiFaultArray[3]   ;   //  20  故障码4
            uiSciAnalogDataBag[ eAnalogFaultCode7         ] = unFaultFlag.uiFaultArray[4]   ;   //  21  故障码5
            uiSciAnalogDataBag[ eAnalogFaultCode8         ] = unFaultFlag.uiFaultArray[5]   ;   //  22  故障码6
            uiSciAnalogDataBag[ eAnalogFaultCode9         ] = unFaultFlag.uiFaultArray[6]   ;   //  23  故障码7

            if(strSlvAnalog.fVoltPv1 > 50)
            {
                uiSciAnalogDataBag[ eAnalogPV1Volt            ] = strSlvAnalog.fVoltPv1 * 10;//  24  PV1电压
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogPV1Volt            ] = 0;//  24  PV1电压
            }

            if(strSlvAnalog.fVoltPv2 > 50)
            {
                uiSciAnalogDataBag[ eAnalogPV2Volt            ] = strSlvAnalog.fVoltPv2 * 10;//  25  PV2电压
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogPV2Volt            ] = 0;//  25  PV2电压
            }
            uiSciAnalogDataBag[ eAnalogPV3Volt            ] = strSlvAnalog.fPosBusVolt;//0;//  26  PV3电压 --从DSP--BUS电压
            uiSciAnalogDataBag[ eAnalogPV4Volt            ] = strBatChgState.unFlag.all;//0;//  27  PV4电压
            if(strSlvAnalog.fVoltPv1 > 50)
            {
                uiSciAnalogDataBag[ eAnalogPV1IndCurr         ] = strSlvAnalog.fCurrPv1 * 10;//  28  PV1电感电流
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogPV1IndCurr		  ] = 0 ;//  28  PV1电感电流
            }

            if(strSlvAnalog.fVoltPv2 > 50)
            {
                uiSciAnalogDataBag[ eAnalogPV2IndCurr         ] = strSlvAnalog.fCurrPv2 * 10;//  29  PV2电感电流
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogPV2IndCurr		  ] = 0 ;//  29  PV2电感电流
            }
            uiSciAnalogDataBag[ eAnalogPV3IndCurr         ] = g_SysFault.ubFaultGen.all;//0;  30  PV3电感电流
            uiSciAnalogDataBag[ eAnalogPV4IndCurr         ] = uiSlaveAnalogData[eS2MRealData_SlveState4];//0;  31  PV4电感电流
            //家庭负载

            // if(eSingle == g_ComInfo.MachinePhase)
            // {
                if(eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts)
                {
                    uiSciAnalogDataBag[ eAnalogHomeLoadA     ] = 0;//  32  PV1_1输入电流n
                    uiSciAnalogDataBag[ eAnalogHomeLoadB     ] = 0;//  33  PV1_2输入电流n
                    uiSciAnalogDataBag[ eAnalogHomeLoadC     ] = 0;//  34  PV2_1输入电流n
                }
                else
                {
                    uiSciAnalogDataBag[ eAnalogHomeLoadA     ] = ((int16)(stPower.PHomeLoad.PhaseA * cSinglePRated));//  32  PV1_1输入电流n
                    uiSciAnalogDataBag[ eAnalogHomeLoadB     ] = 0;//  33  PV1_2输入电流n
                    uiSciAnalogDataBag[ eAnalogHomeLoadC     ] = g_ComInfo.Com1.Word.word2;//0;//  34  PV2_1输入电流n
                }
            // }
            // else
            // {
            //     if(eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts)
            //     {
            //         uiSciAnalogDataBag[ eAnalogHomeLoadA     ] = 0;//  32  PV1_1输入电流n
            //         uiSciAnalogDataBag[ eAnalogHomeLoadB     ] = 0;//  33  PV1_2输入电流n
            //         uiSciAnalogDataBag[ eAnalogHomeLoadC     ] = 0;//  34  PV2_1输入电流n
            //     }
            //     else
            //     {
            //         uiSciAnalogDataBag[ eAnalogHomeLoadA     ] = ((int16)(stPower.PHomeLoad.PhaseA * cSinglePRated));//  32  PV1_1输入电流n
            //         uiSciAnalogDataBag[ eAnalogHomeLoadB     ] = 0;//  33  PV1_2输入电流n
            //         uiSciAnalogDataBag[ eAnalogHomeLoadC     ] = 0;//  34  PV2_1输入电流n
            //     }
            // }

            uiSciAnalogDataBag[ eAnalogPV2_2InputCurr     ] = g_ComInfo.Com1.Word.word0;//0; // g_SysFault.Flag.bit.DcDcFault;//  35  PV2_2输入电流
            uiSciAnalogDataBag[ eAnalogPV3_1InputCurr     ] = g_ComInfo.Com1.Word.word1;//0; // g_SysFault.Flag.bit.BatFault;//  36  PV3_1输入电流
            uiSciAnalogDataBag[ eAnalogPV3_2InputCurr     ] = g_InvVar.InvFlag.Word.Word0;//0; // g_SysFault.Flag.bit.SysFault;//  37  PV3_2输入电流
            uiSciAnalogDataBag[ eAnalogDcDcCurr           ] = g_InvVar.InvFlag.Word.Word1;//0; // g_SysFault.Flag.bit.GridFault;//0; // (int16)(strBusVoltUpLmtRegu.Out * cPowerRated);  //  38  PV4_1输入电流n
            uiSciAnalogDataBag[ eAnalogLlcCurr            ] = g_InvVar.InvFlag.Word.Word2;//0; // (int16)(strBusVoltDownLmtRegu.Out * cPowerRated);//  39  PV4_2输入电流
            if(strSlvAnalog.fVoltPv1 > 50)
            {
                uiSciAnalogDataBag[ eAnalogPV1Power 		  ] = (int16)(strSlvAnalog.fPv1Power); //  40  PV1功率
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogPV1Power 		  ] = 0; //  40  PV1功率
            }
            if(strSlvAnalog.fVoltPv2 > 50)
            {
                uiSciAnalogDataBag[ eAnalogPV2Power 		  ] = (int16)(strSlvAnalog.fPv2Power); //  41  PV2功率
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogPV2Power 		  ] = 0; //  41  PV2功率
            }

            uiSciAnalogDataBag[ eAnalogPV3Power           ] = (int16)(fReal_Power(g_SystemInfo.PowerBalance.PInvRef)); // 0; //  42  PV3功率 
            uiSciAnalogDataBag[ eAnalogPV4Power           ] = (int16)(fReal_Power(g_InvVar.fPInvTotalRef)); // 0; //  43  PV4功率

            // uiSciAnalogDataBag[ eAnalogBat1RlyForwardVolt ] = stValue.fAveReal.VBat * 10;//  44  Bat1继电器前端电压
            if(stValue.fAveReal.VBat > 10)
            {
                uiSciAnalogDataBag[ eAnalogBat1RlyForwardVolt ] = stValue.fAveReal.VBat * 10;//  44  Bat1继电器前端电压
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogBat1RlyForwardVolt ] = 0;//  44  Bat1继电器前端电压(低于10V，显示为0V)
            }
            uiSciAnalogDataBag[ eAnalogBat2RlyForwardVolt ] = (int16)(fReal_Power(strOnGridPaRegu.Ref));//0;                         //  45  Bat2继电器前端电压
            uiSciAnalogDataBag[ eAnalogBat1RlyBackwardVolt] = (int16)(stValue.fBatChargeCurrAveReal * 10);//(int16)(fReal_Power(strOnGridIdRef.fphaseA));//0;                         //  46  Bat1继电器后端电压
            uiSciAnalogDataBag[ eAnalogBat2RlyBackwardVolt] = (int16)(-stValue.fAveReal.ILlc * 10);// 47  Bat2继电器后端电压
            if(   (eDcDcRunState_Boost == g_DcDcVar.DcDcFlag.bit.bDcDcRunSts && (fabs(stValue.fBatChargeCurrAveReal) > 1) ) // 正常运行或锂电激活时显示
               || (eActiveByNull != g_ComInfo.Com1.bit.LiActiveSource) )
            {
                uiSciAnalogDataBag[ eAnalogIBat1Curr          ] = (int16)(-stValue.fAveReal.IDcDc * 10);// 48  Bat1电流
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogIBat1Curr          ] = 0;// 48  Bat1电流
            }

            if(   (eDcDcRunState_Boost == g_DcDcVar.DcDcFlag.bit.bDcDcRunSts && (fabs(stPower.fPBatReal) > 20))
               || (eActiveByNull != g_ComInfo.Com1.bit.LiActiveSource) )
            {
                uiSciAnalogDataBag[ eAnalogBat1Power          ] = (int16)(-stPower.fPBatReal);// 49  Bat1功率  对于机器来说
            }
            else
            {
                uiSciAnalogDataBag[ eAnalogBat1Power		  ] = 0;// 49  Bat1功率
            }

            uiSciAnalogDataBag[ eAnalogIBat2Curr          ] = 0; // 50  Bat2电流
            uiSciAnalogDataBag[ eAnalogBat2Power          ] = 0; // 51  Bat2功率
/*
//内部调试 AFCI
uiSciAnalogDataBag[ eAnalogFaultCode2         ] = uiSlaveAnalogData[eS2MRealData_GfciCurr];//  16  通道 1 电流值,单位mA
uiSciAnalogDataBag[ eAnalogFaultCode3         ] = uiSlaveAnalogData[eS2MRealData22];//  17  通道 2 电流值,单位mA
uiSciAnalogDataBag[ eAnalogFaultCode4         ] = uiSlaveAnalogData[eS2MRealData23];//  18  通道 3 电流值,单位mA
uiSciAnalogDataBag[ eAnalogFaultCode5         ] = uiSlaveAnalogData[eS2MRealData24];//  19  通道 4 电流值,单位mA
uiSciAnalogDataBag[ eAnalogFaultCode6         ] = uiSlaveAnalogData[eS2MRealData25];//  20  电弧报警信息;0 表示正常,1 表示有报警
uiSciAnalogDataBag[ eAnalogFaultCode7         ] = uiSlaveAnalogData[eS2MRealData26];//  21  通道1~通道4自检结果; 1自检失败(或没有自检)，0自检成功。
uiSciAnalogDataBag[ eAnalogFaultCode8         ] = uiSlaveAnalogData[eS2MRealData27];//  22  自检使能
uiSciAnalogDataBag[ eAnalogFaultCode9         ] = uiSlaveAnalogData[eS2MRealData28];//  23  可设定的电弧报警阈值
*/
/*
//内部调试 故障
uiSciAnalogDataBag[ eAnalogPV3Volt            ] = g_SystemInfo.SysFlag.word.word1;//g_SysFault.ubFaultAc.fault.fault1;//(int16)(stPower.SInv.PhaseA * cSinglePRated);//g_InvVar.InvFlag.Word.Word0;//  26  PV3电压
uiSciAnalogDataBag[ eAnalogPV4Volt            ] = stateTest[2];//g_FanVar.uiFanDutySet;//g_SystemInfo.SysFlag.word.word2;//g_ComInfo.fBat1ChgCurrLimit;//g_SysFault.ubFaultAc.fault.fault2;//(int16)(stValue.fRmsScale.IInvA * 1000);//uiMasterAnalogData[eM2SRealData_State1];//g_InvVar.InvFlag.Word.Word1;//  27  PV4电压

uiSciAnalogDataBag[ eAnalogPV3IndCurr         ] = strBMSLogicInfo.uiBMS1BatSOC;//g_RelayVar.CtrlSta.Word.word1;//  30  PV3电感电流
uiSciAnalogDataBag[ eAnalogPV4IndCurr         ] = (g_ComInfo.uiEcoModeStopSoc * 10);//g_RelayVar.CtrlSta.Word.word2;//  31  PV4电感电流

uiSciAnalogDataBag[ eAnalogPV2_2InputCurr     ] = g_SysFault.Flag.Word.word0;//  35  PV2_2输入电流
uiSciAnalogDataBag[ eAnalogPV3_1InputCurr     ] = g_SysFault.Flag.Word.word1;//  36  PV3_1输入电流
uiSciAnalogDataBag[ eAnalogPV3_2InputCurr     ] = g_InvVar.InvFlag.Word.Word0;//  37  PV3_2输入电流
uiSciAnalogDataBag[ eAnalogDcDcCurr           ] = stateTest[8];//g_InvVar.InvFlag.Word.Word1;  //  38  PV4_1输入电流n
uiSciAnalogDataBag[ eAnalogLlcCurr            ] = g_ComInfo.Com1.bit.LiActiveSource;//stateTest[9];//g_InvVar.InvFlag.Word.Word2;

// uiSciAnalogDataBag[ eAnalogBat1Power          ] = g_InvVar.InvFlag.Word.Word1;//g_SystemVar.SysRunFlag.all;//stateTest[2];//g_SysFault.ubFaultDc.all;
uiSciAnalogDataBag[ eAnalogIBat2Curr          ] = g_ParaVar.ParaFlag.Word.WordL;// g_SysFault.ubFaultAc.fault.fault3;//(int16)(stValue.fRmsScale.ISmLoadA * 100);//g_SystemVar.SysLogicJump.all;
uiSciAnalogDataBag[ eAnalogBat2Power          ] = g_ParaVar.ParaFlag.Word.WordH;//g_SysFault.ubFaultAc.fault.fault4;//(int16)(stPower.PSmartLoad.PhaseA * 100);
*/
           break;
        }

        case 1:
        {
            uiSciAnalogDataBag[ eAnalogBat1PosIso  ] = (int16)(strSlvAnalog.fPvIsoVolt * 10);//  52  Bat1正对地绝缘阻抗n
            uiSciAnalogDataBag[ eAnalogBat1NegIso  ] = strSlvState.ubState1.all;//0; // 53  Bat1负对地绝缘阻抗
            uiSciAnalogDataBag[ eAnalogBat2PosIso  ] = strSlvState.ubState2.all;//0; // 54  Bat2正对地绝缘阻抗
            uiSciAnalogDataBag[ eAnalogBat2NegIso  ] = strSlvState.ubState3.all;//0; // 55  Bat2负对地绝缘阻抗
            uiSciAnalogDataBag[ eAnalogBat1SOC     ] = (int16)(strBMSLogicInfo.uiBMS1BatSOC);// 56  Bat1SOC
            uiSciAnalogDataBag[ eAnalogBat1SOH     ] = (int16)(strBMSLogicInfo.uiBMS1BatSOH);// 57  Bat1SOH
            uiSciAnalogDataBag[ eAnalogBat1Cap     ] = (int16)(strDeratedPercent.fTmpSumOrder * 100);//0; // 58  Bat1容量
            uiSciAnalogDataBag[ eAnalogBat2SOC     ] = (int16)(fReal_Power(strBusVoltUpLmtRegu.Out));//strSlvAnalog.fPvTemp;//0; // 59  Bat2SOCn
            uiSciAnalogDataBag[ eAnalogBat2SOH     ] = (int16)(fReal_Power(strBusVoltDownLmtRegu.Out));//strSlvAnalog.fInvTemp;//0; // 60  Bat2SOHn
            uiSciAnalogDataBag[ eAnalogBat2Cap     ] = (int16)(fReal_Power(g_InvVar.fGridOutLoopOut));//strSlvAnalog.fLLCTemp;//0; // 61  Bat2容量n
            uiSciAnalogDataBag[ eAnalogBusVolt     ] = (int16)(stValue.fAveReal.VBus * 10);    //  62  Bus总电压
            uiSciAnalogDataBag[ eAnalogPosBusVolt  ] = (int16)(stValue.fAveReal.VPBus * 10);   //  63  Bus正电压
            uiSciAnalogDataBag[ eAnalogNegBusVolt  ] = (int16)(strPvPowerDerate.fTmpSumOrder * 6000);//0;  //  64  Bus负电压
            uiSciAnalogDataBag[ eAnalogBalanceCurr ] = (int16)(strPvPowerDerate.fInnerTmpOrder * 6000);//0;  //  65  平衡板电流
            uiSciAnalogDataBag[ eAnalogBusPosIso   ] = (int16)(strSlvAnalog.fIsoChkRes);   //  66  Bus正对地绝缘阻抗
            uiSciAnalogDataBag[ eAnalogBusNegIso   ] = uiSlaveAnalogData[eS2MRealData_IsoRes];   //  67  Bus负对地绝缘阻抗

            uiSciAnalogDataBag[ eAnalogBoostTempe  ] = (int16)(strSlvAnalog.fLLCTemp * 0.1f);    // 68  Boost温度 15k作为LLC温度
            uiSciAnalogDataBag[ eAnalogInvTempe    ] = g_FanVar.uiFanDutySet;//0;  // 69  逆变温度 15k作为Boost和逆变温度
            uiSciAnalogDataBag[ eAnalogEnviTempe   ] = (int16)(strSlvAnalog.fInnelTemp * 0.1f);    // 70  环境温度
            if(   ((int16)(uiSlaveAnalogData[eS2MRealData_LeadAcidTemp]) < -250)
               || ((int16)(uiSlaveAnalogData[eS2MRealData_LeadAcidTemp]) > 1200) ) // Temp < -25℃ 或者 Temp > 120℃
            {
                uiSciAnalogDataBag[eAnalogLeadAcidTempe    ] = 250; // 25℃
            }
            else
            {
                uiSciAnalogDataBag[eAnalogLeadAcidTempe    ] = (int16)uiSciCommand_BMSDataBag[eLeadAcidTempeTemp];    // 71  铅酸电池温度
            }
            uiSciAnalogDataBag[eAnalogPCB2Tempe    ] = g_uiBatAbnormalFlg;//0;     // 72  PCB温度2
            uiSciAnalogDataBag[eAnalogLeakCurr     ] = (int16)(stValue.fRmsReal.IGfci);    // 73  漏电流
            if(eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts || stValue.fRmsReal.VGenA < 50 || (eGenPortMode_Generator != g_ComInfo.Com1.bit.GenModeSet))
            {
                uiSciAnalogDataBag[eAnalogGen_ACurr    ] = 0;    // 74  A相油机电流
                uiSciAnalogDataBag[eAnalogGen_BCurr    ] = 0;    // 75  B相油机电流
                uiSciAnalogDataBag[eAnalogGen_CCurr    ] = 0;    // 76  C相油机电流
            }
            else
            {
                uiSciAnalogDataBag[eAnalogGen_ACurr    ] = stValue.fRmsReal.IGenA * 10;    // 74  A相油机电流
                if(uiSciAnalogDataBag[eAnalogGen_ACurr ] < 3) { uiSciAnalogDataBag[eAnalogGen_ACurr ] = 0; }   // 74  A相油机电流
                uiSciAnalogDataBag[eAnalogGen_BCurr    ] = 0;                              // 75  B相油机电流
                uiSciAnalogDataBag[eAnalogGen_CCurr    ] = 0;                              // 76  C相油机电流
            }
            //市电/油机/逆变/输出电压
            // if(eSingle == g_ComInfo.MachinePhase)
            // {
	        //     uiSciAnalogDataBag[eAnalogGen_AVolt    ] = stValue.fRmsReal.VGenA * 10;    // 77  A相油机电压
	        //     uiSciAnalogDataBag[eAnalogGen_BVolt    ] = 0;                              // 78  B相油机电压
	        //     uiSciAnalogDataBag[eAnalogGen_CVolt    ] = 0;                              // 79  C相油机电压
	        //     uiSciAnalogDataBag[eAnalogGrid_AVolt   ] = stValue.fRmsReal.VGridA * 10;   // 80  A相电网电压
	        //     uiSciAnalogDataBag[eAnalogGrid_BVolt   ] = 0;                              // 81  B相电网电压
	        //     uiSciAnalogDataBag[eAnalogGrid_CVolt   ] = 0;                              // 82  C相电网电压
	        //     uiSciAnalogDataBag[eAnalogInv_AVolt    ] = stValue.fRmsReal.VInvA * 10;    // 83  A相逆变电压
	        //     uiSciAnalogDataBag[eAnalogInv_BVolt    ] = 0;                              // 84  B相逆变电压
	        //     uiSciAnalogDataBag[eAnalogInv_CVolt    ] = 0;                              // 85  C相逆变电压	            
            //     uiSciAnalogDataBag[eAnalogLoad_AVolt   ] = stValue.fRmsReal.VOutA * 20;    // 86  A相负载电压
            //     uiSciAnalogDataBag[eAnalogLoad_BVolt   ] = 0;                              // 87  B相负载电压
            //     uiSciAnalogDataBag[eAnalogLoad_CVolt   ] = 0;                              // 88  C相负载电压
            // }
            // else
            // {
                if(stValue.fRmsReal.VGenA < 50 || (eGenPortMode_Generator != g_ComInfo.Com1.bit.GenModeSet))
                {
                    uiSciAnalogDataBag[eAnalogGen_AVolt    ] = 0;   // 77  A相油机电压
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogGen_AVolt    ] = stValue.fRmsReal.VGenA  * 10;   // 77  A相油机电压
                }
                uiSciAnalogDataBag[eAnalogGen_BVolt    ] = 0;                              // 78  B相油机电压
                uiSciAnalogDataBag[eAnalogGen_CVolt    ] = 0;                              // 79  C相油机电压
                if(stValue.fRmsReal.VGridA < 50)
                {
                    uiSciAnalogDataBag[eAnalogGrid_AVolt    ] = 0;   // 80  A相电网电压
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogGrid_AVolt    ] = stValue.fRmsReal.VGridA * 10;   // 80  A相电网电压
                }
                uiSciAnalogDataBag[eAnalogGrid_BVolt   ] = 0;                              // 81  B相电网电压
                uiSciAnalogDataBag[eAnalogGrid_CVolt   ] = 0;                              // 82  C相电网电压
                if(stValue.fRmsReal.VInvA < 50)
                {
                    uiSciAnalogDataBag[eAnalogInv_AVolt    ] = 0;   // 83  A相逆变电压
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogInv_AVolt    ] = stValue.fRmsReal.VInvA * 10;   // 83  A相逆变电压
                }
                uiSciAnalogDataBag[eAnalogInv_BVolt    ] = 0;                              // 84  B相逆变电压
                uiSciAnalogDataBag[eAnalogInv_CVolt    ] = 0;                              // 85  C相逆变电压
                if(stValue.fRmsReal.VOutA < 50)
                {
                    uiSciAnalogDataBag[eAnalogLoad_AVolt    ] = 0;   // 86  A相负载电压
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogLoad_AVolt    ] = stValue.fRmsReal.VOutA * 10;   // 86  A相负载电压
                }
                uiSciAnalogDataBag[eAnalogLoad_BVolt   ] = 0;                              // 87  B相负载电压
                uiSciAnalogDataBag[eAnalogLoad_CVolt   ] = 0;                              // 88  C相负载电压
            // }
            if(eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts)
            {
                uiSciAnalogDataBag[eAnalogOutCT_ACurr  ] = 0;   // 89  A相外部CT电流
                uiSciAnalogDataBag[eAnalogOutCT_BCurr  ] = 0;   // 90  B相外部CT电流
                uiSciAnalogDataBag[eAnalogOutCT_CCurr  ] = 0;   // 91  C相外部CT电流
                uiSciAnalogDataBag[eAnalogGrid_ACurr   ] = 0;   // 92  A相电网电流
                uiSciAnalogDataBag[eAnalogGrid_BCurr   ] = 0;   // 93  B相电网电流
                uiSciAnalogDataBag[eAnalogGrid_CCurr   ] = 0;   // 94  C相电网电流
                uiSciAnalogDataBag[eAnalogInv_ACurr    ] = 0;   // 95  A相逆变电流
                uiSciAnalogDataBag[eAnalogInv_BCurr    ] = 0;   // 96  B相逆变电流
                uiSciAnalogDataBag[eAnalogInv_CCurr    ] = 0;   // 97  C相逆变电流
                uiSciAnalogDataBag[eAnalogLoad_ACurr   ] = 0;   // 98  A相负载电流
                uiSciAnalogDataBag[eAnalogLoad_BCurr   ] = 0;   // 99  B相负载电流
                uiSciAnalogDataBag[eAnalogLoad_CCurr   ] = 0;   // 100 C相负载电流
            }
            else
            {
                uiSciAnalogDataBag[eAnalogOutCT_ACurr  ] = stValue.fRmsReal.CurrCtA * 10;   // 89  A相外部CT电流
                if(uiSciAnalogDataBag[eAnalogOutCT_ACurr ] < 3) { uiSciAnalogDataBag[eAnalogOutCT_ACurr ] = 0; }   // 89  A相外部CT电流
                uiSciAnalogDataBag[eAnalogOutCT_BCurr  ] = 0;                               // 90  B相外部CT电流
                uiSciAnalogDataBag[eAnalogOutCT_CCurr  ] = 0;                               // 91  C相外部CT电流

                if(stValue.fRmsReal.VGridA < 50)
                {
                    uiSciAnalogDataBag[eAnalogGrid_ACurr   ] = 0;                               // 92  A相电网电流
                    uiSciAnalogDataBag[eAnalogGrid_BCurr   ] = 0;                               // 93  B相电网电流
                    uiSciAnalogDataBag[eAnalogGrid_CCurr   ] = 0;                               // 94  C相电网电流
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogGrid_ACurr   ] = stValue.fRmsReal.IGridA * 10;    // 92  A相电网电流
                    if(uiSciAnalogDataBag[eAnalogGrid_ACurr ] < 3) { uiSciAnalogDataBag[eAnalogGrid_ACurr ] = 0; }   // 92  A相电网电流
                    uiSciAnalogDataBag[eAnalogGrid_BCurr   ] = 0;                               // 93  B相电网电流
                    uiSciAnalogDataBag[eAnalogGrid_CCurr   ] = 0;                               // 94  C相电网电流
                }

                uiSciAnalogDataBag[eAnalogInv_ACurr    ] = stValue.fRmsReal.IInvA * 10;     // 95  A相逆变电流
                if(uiSciAnalogDataBag[eAnalogInv_ACurr ] < 3) { uiSciAnalogDataBag[eAnalogInv_ACurr ] = 0; }   // 95  A相逆变电流
                uiSciAnalogDataBag[eAnalogInv_BCurr    ] = 0;                               // 96  B相逆变电流
                uiSciAnalogDataBag[eAnalogInv_CCurr    ] = 0;                               // 97  C相逆变电流

                if(stValue.fRmsReal.VOutA < 50)
                {
                    uiSciAnalogDataBag[eAnalogLoad_ACurr   ] = 0;                               // 98  A相负载电流
                    uiSciAnalogDataBag[eAnalogLoad_BCurr   ] = 0;                               // 99  B相负载电流
                    uiSciAnalogDataBag[eAnalogLoad_CCurr   ] = 0;                               // 100 C相负载电流
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogLoad_ACurr   ] = stValue.fRmsReal.IOutA * 10;     // 98  A相负载电流
                    if(uiSciAnalogDataBag[eAnalogLoad_ACurr ] < 3) { uiSciAnalogDataBag[eAnalogLoad_ACurr ] = 0; }   // 98  A相负载电流
                    uiSciAnalogDataBag[eAnalogLoad_BCurr   ] = g_SysFault.ubFaultGen.all;//0;                               // 99  B相负载电流
                    uiSciAnalogDataBag[eAnalogLoad_CCurr   ] = g_InvVar.InvChkFlag.all;//0;                               // 100 C相负载电流
                }
            }
            break;
        }

        case 2:
        {
            uiSciAnalogDataBag[eAnalogInvDc_AVolt  ] = (int16)(stValue.fAveScale.VInvDcR);  // 101 A相逆变电压直流分量
            uiSciAnalogDataBag[eAnalogInvDc_BVolt  ] = (int16)stateTest[0];//0;                                   // 102 B相逆变电压直流分量
            uiSciAnalogDataBag[eAnalogInvDc_CVolt  ] = (int16)stateTest[1];//0;                                   // 103 C相逆变电压直流分量
            uiSciAnalogDataBag[eAnalogInvDc_ACurr  ] = (int16)(stValue.fAveScale.IInvDcR);  // 104 A相逆变电流直流分量
            uiSciAnalogDataBag[eAnalogInvDc_BCurr  ] = (int16)stateTest[2];//0;                                   // 105 B相逆变电流直流分量
            uiSciAnalogDataBag[eAnalogInvDc_CCurr  ] = (int16)stateTest[3];//0;//g_InvVar.InvFlag.Word.WordL;     // 106 C相逆变电流直流分量
            uiSciAnalogDataBag[eAnalogInvN_Volt    ] = stValue.fRmsReal.VNE * 10;           // 107 N相逆变电压
            if(stValue.fRmsReal.VGenA < 50.0f || (eGenPortMode_Generator != g_ComInfo.Com1.bit.GenModeSet))   // 大概是 50W
            {
                uiSciAnalogDataBag[eAnalogGenFreq  ] = 0;      // 108 油机频率
            }
            else
            {
                uiSciAnalogDataBag[eAnalogGenFreq      ] = g_SystemInfo.uiGenFreq;              // 108 油机频率
            }

            uiSciAnalogDataBag[eAnalogGridFreq     ] = g_SystemInfo.uiGridFreq;             // 109 电网频率
            uiSciAnalogDataBag[eAnalogInvFreq      ] = g_SystemInfo.uiInvFreq;              // 110 逆变频率
            uiSciAnalogDataBag[eAnalogLoadFreq     ] = g_SystemInfo.uiOutFreq;              // 111 负载频率

            if((fabs(stPower.PGen.PhaseA) < 0.01f) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts) || (eGenPortMode_Generator != g_ComInfo.Com1.bit.GenModeSet))   // 大概是 50W
            {
                uiSciAnalogDataBag[eAnalogGen_APhaseP  ] = 0;      // 112 A相油机有功功率
            }
            else
            {
                uiSciAnalogDataBag[eAnalogGen_APhaseP  ] = (int16)(-stPower.PGen.PhaseA * cSinglePRated);       // 112 A相油机有功功率
            }

            // if((fabs(stPower.PGen.PhaseB) < 0.01)  || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))   // 大概是 50W
            // {
            //     uiSciAnalogDataBag[eAnalogGen_BPhaseP  ] = 0;      // 113 B相油机有功功率
            // }
            // else
            // {
            //     uiSciAnalogDataBag[eAnalogGen_BPhaseP  ] = (int16)(-stPower.PGen.PhaseB * cSinglePRated);      // 113 B相油机有功功率
            // }
            uiSciAnalogDataBag[eAnalogGen_BPhaseP  ] = 0;      // 113 B相油机有功功率
            uiSciAnalogDataBag[eAnalogGen_CPhaseP  ] = 0;      // 114 C相油机有功功率


            if((fabs(stPower.PGrid.PhaseA) < 0.01f) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))   // 大概是 50W
            {
                uiSciAnalogDataBag[eAnalogGrid_APhaseP ] = 0;      // 115 A相电网有功功率
            }
            else
            {
                uiSciAnalogDataBag[eAnalogGrid_APhaseP ] = (int16)(stPower.PGrid.PhaseA * cSinglePRated);      // 115 A相电网有功功率
            }

            // if((fabs(stPower.PGrid.PhaseB) < 0.01) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))   // 大概是 50W
            // {
            //     uiSciAnalogDataBag[eAnalogGrid_BPhaseP ] = 0;      // 116 B相电网有功功率
            // }
            // else
            // {
            //     uiSciAnalogDataBag[eAnalogGrid_BPhaseP ] = (int16)(stPower.PGrid.PhaseB * cSinglePRated) ;      // 116 B相电网有功功率
            // }
            uiSciAnalogDataBag[eAnalogGrid_BPhaseP ] = 0;      // 116 B相电网有功功率
            uiSciAnalogDataBag[eAnalogGrid_CPhaseP ] = 0;      // 116 B相电网有功功率

            if((fabs(stPower.PInv.PhaseA) < 0.01f) || (eInv_NoOutputMode == g_InvVar.InvFlag.bit.InvWorkMode))   // 大概是 50W
            {
                uiSciAnalogDataBag[eAnalogInv_APhaseP  ] = 0;    // 118 A相逆变有功功率
            }
			else
			{
                uiSciAnalogDataBag[eAnalogInv_APhaseP  ] = (int16)(stPower.PInv.PhaseA * cSinglePRated);      // 118 A相逆变有功功率
			}

			// if((fabs(stPower.PInv.PhaseB) < 0.01) || (eInv_NoOutputMode == g_InvVar.InvFlag.bit.InvWorkMode))   // 大概是 50W
            // {
            //     uiSciAnalogDataBag[eAnalogInv_BPhaseP  ] = 0;    // 119 B相逆变有功功率
            // }
			// else
			// {
            //     uiSciAnalogDataBag[eAnalogInv_BPhaseP  ] = (int16)(stPower.PInv.PhaseB * cSinglePRated) ;      // 119 B相逆变有功功率
			// }
            uiSciAnalogDataBag[eAnalogInv_BPhaseP  ] = 0;    // 119 B相逆变有功功率
            uiSciAnalogDataBag[eAnalogInv_CPhaseP  ] = 0;    // 120 C相逆变有功功率

			// 并机显示负功率
			/*if(uiFrameParallelEnable)
			{
	            if((fabs(stPower.POut.PhaseA) < 0.01f) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))   // 非待机下，限定要大于60W才显示功率
	            {
	                uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = 0;      // 121 A相负载有功功率
	            }
	            else
	            {
	                uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = (int16)(stPower.POut.PhaseA * cSinglePRated);      // 121 A相负载有功功率
	            }
			}
			else
			{
	            if((stPower.POut.PhaseA < 0.01f) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))   // 非待机下，限定要大于60W才显示功率
	            {
	                uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = 0;      // 121 A相负载有功功率
	            }
	            else
	            {
	                uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = (int16)(stPower.POut.PhaseA * cSinglePRated);      // 121 A相负载有功功率
	            }
			}
            
            if(uiFrameParallelEnable)
            {
                if((fabs(stPower.POut.PhaseB) < 0.01) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))
                {
                    uiSciAnalogDataBag[eAnalogLoad_BPhaseP ] = 0;      // 122 B相负载有功功率
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogLoad_BPhaseP ] = (int16)(stPower.POut.PhaseB * cSinglePRated) ;      // 122 B相负载有功功率
                }
            }
            else
            {
                if((stPower.POut.PhaseB < 0.01) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))
                {
                    uiSciAnalogDataBag[eAnalogLoad_BPhaseP ] = 0;      // 122 B相负载有功功率
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogLoad_BPhaseP ] = (int16)(stPower.POut.PhaseB * cSinglePRated) ;      // 122 B相负载有功功率
                }
            }
            */
            if((fabs(stPower.POut.PhaseA) < 0.01f) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))   // 非待机下，限定要大于60W才显示功率
            {
                uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = 0;      // 121 A相负载有功功率
            }
            else
            {
                uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = (int16)(stPower.POut.PhaseA * cSinglePRated);      // 121 A相负载有功功率
            }
            uiSciAnalogDataBag[eAnalogLoad_BPhaseP ] = 0;      // 122 B相负载有功功率
            uiSciAnalogDataBag[eAnalogLoad_CPhaseP ] = 0;      // 123 C相负载有功功率

            if((fabs(stPower.SOut.PhaseA) < 0.01f) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))
            {
                uiSciAnalogDataBag[eAnalogLoad_APhaseS ] = 0;      // 124 A相负载视在功率
                uiSciAnalogDataBag[eAnalogLoad_APersent] = 0;      // 127 A相负载百分比n
            }
            else
            {
                uiSciAnalogDataBag[eAnalogLoad_APhaseS ] = (int16)(stPower.SOut.PhaseA * cSinglePRated);      // 124 A相负载视在功率
                // uiSciAnalogDataBag[eAnalogLoad_APersent] = (int16)(stPower.SOut.PhaseA * 100); // 127 A相负载百分比n
                uiSciAnalogDataBag[eAnalogLoad_APersent] = (int16)(stPower.fSLoad_Conver * 100); // 127 A相负载百分比n
			}
            /*
            if((stPower.SOut.PhaseB < 0.01) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))
            {
                uiSciAnalogDataBag[eAnalogLoad_BPhaseS ] = 0; // 125 B相负载视在功率
				uiSciAnalogDataBag[eAnalogLoad_BPersent] = 0; // 128 B相负载百分比n
			}
            else
            {
                uiSciAnalogDataBag[eAnalogLoad_BPhaseS ] = (int16)(stPower.SOut.PhaseB * cSinglePRated) ;      // 125 B相负载视在功率
				uiSciAnalogDataBag[eAnalogLoad_BPersent] = (int16)(stPower.SOut.PhaseB * 100) ; // 128 B相负载百分比n
			}
            */
            uiSciAnalogDataBag[eAnalogLoad_BPhaseS ] = 0; // 125 B相负载视在功率
            uiSciAnalogDataBag[eAnalogLoad_BPersent] = 0; // 128 B相负载百分比n
            uiSciAnalogDataBag[eAnalogLoad_CPhaseS ] = 0; // 126 C相负载视在功率
            uiSciAnalogDataBag[eAnalogLoad_CPersent] = 0; // 129 C相负载百分比n

            if((fabs(stPower.PGridCt.PhaseA) < 0.01f) || eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts)
            {
                uiSciAnalogDataBag[eAnalogGridCT_APhaseP] = 0;
                uiSciAnalogDataBag[eAnalogGridCT_BPhaseP] = 0;
                uiSciAnalogDataBag[eAnalogGridCT_CPhaseP] = 0;
            }
            else
            {
                uiSciAnalogDataBag[eAnalogGridCT_APhaseP] = -((int16)(stPower.PGridCt.PhaseA * cSinglePRated));
                // uiSciAnalogDataBag[eAnalogGridCT_BPhaseP] = -((int16)(stPower.PGridCt.PhaseB * cSinglePRated) );
                uiSciAnalogDataBag[eAnalogGridCT_BPhaseP] = 0;
                uiSciAnalogDataBag[eAnalogGridCT_CPhaseP] = 0;
            }

            // if(eSingle == g_ComInfo.MachinePhase)
            // {
            //     if(eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts)
            //     {
            //         uiSciAnalogDataBag[eAnalogGen_APhaseP   ] = 0;
            //         uiSciAnalogDataBag[eAnalogGrid_APhaseP  ] = 0;
            //         uiSciAnalogDataBag[eAnalogInv_APhaseP   ] = 0;
            //         uiSciAnalogDataBag[eAnalogLoad_APhaseP  ] = 0;
            //         uiSciAnalogDataBag[eAnalogLoad_APhaseS  ] = 0;
            //         uiSciAnalogDataBag[eAnalogGridCT_APhaseP] = 0;
            //     }
            //     else
            //     {
            //         uiSciAnalogDataBag[eAnalogGen_APhaseP   ] = uiSciAnalogDataBag[eAnalogGen_APhaseP  ] + uiSciAnalogDataBag[eAnalogGen_BPhaseP    ];
            //         uiSciAnalogDataBag[eAnalogGrid_APhaseP  ] = uiSciAnalogDataBag[eAnalogGrid_APhaseP  ] + uiSciAnalogDataBag[eAnalogGrid_BPhaseP  ];
            //         uiSciAnalogDataBag[eAnalogInv_APhaseP   ] = uiSciAnalogDataBag[eAnalogInv_APhaseP  ] + uiSciAnalogDataBag[eAnalogInv_BPhaseP    ];
            //         uiSciAnalogDataBag[eAnalogLoad_APhaseP  ] = uiSciAnalogDataBag[eAnalogLoad_APhaseP  ] + uiSciAnalogDataBag[eAnalogLoad_BPhaseP  ];
            //         uiSciAnalogDataBag[eAnalogLoad_APhaseS  ] = uiSciAnalogDataBag[eAnalogLoad_APhaseS ] + uiSciAnalogDataBag[eAnalogLoad_BPhaseS   ];
            //         uiSciAnalogDataBag[eAnalogGridCT_APhaseP] = uiSciAnalogDataBag[eAnalogGridCT_APhaseP] + uiSciAnalogDataBag[eAnalogGridCT_BPhaseP];
            //     }
            // }

            // if(eRelayStateClose != g_RelayVar.CtrlSta.bit.GridRlySta)
            //     ftemp = 0;
            // else if(stPower.SGrid.PhaseA != 0)
            //     ftemp = stPower.PGrid.PhaseA * 100/ stPower.SGrid.PhaseA;
            // if(ftemp > 0) ftemp += 0.5;
            // else ftemp -= 0.5;
            // UpDownLimit(ftemp,100,-100);
            // uiSciAnalogDataBag[eAnalogGrid_APF     ] = (int16)(ftemp);      // 133 A相电网功率因数（0.01）

            // if(eRelayStateClose != g_RelayVar.CtrlSta.bit.GridRlySta)
            //     ftemp = 0;
            // else if(stPower.SGrid.PhaseB != 0)
            //     ftemp = stPower.PGrid.PhaseB * 100/ stPower.SGrid.PhaseB;
            // if(ftemp > 0) ftemp += 0.5;
            // else ftemp -= 0.5;
            // UpDownLimit(ftemp,100,-100);
            // uiSciAnalogDataBag[eAnalogGrid_BPF     ] = (int16)(ftemp);      // 134 B相电网功率因数（0.01）
            // uiSciAnalogDataBag[eAnalogGrid_BPF     ] = 0;      // 134 B相电网功率因数（0.01）

            // if(eRelayStateClose != g_RelayVar.CtrlSta.bit.InvRlySta)
            //     ftemp = 0;
            // else if(stPower.SInv.PhaseA != 0)
            //     ftemp = stPower.PInv.PhaseA * 100 / stPower.SInv.PhaseA;
            // if(ftemp > 0) ftemp += 0.5;
            // else ftemp -= 0.5;
            // UpDownLimit(ftemp,100,-100);
            // uiSciAnalogDataBag[eAnalogInv_APF      ] = (int16)(ftemp);      // 136 A相逆变功率因数（0.01）
            /*
            if(eRelayStateClose != g_RelayVar.CtrlSta.bit.InvRlySta)
                ftemp = 0;
            else if(stPower.SInv.PhaseB != 0)
                ftemp = stPower.PInv.PhaseB * 100 / stPower.SInv.PhaseB;
            if(ftemp > 0) ftemp += 0.5;
            else ftemp -= 0.5;
            UpDownLimit(ftemp,100,-100);
            uiSciAnalogDataBag[eAnalogInv_BPF      ] = (int16)(ftemp);      // 137 B相逆变功率因数（0.01）
            */
            // uiSciAnalogDataBag[eAnalogInv_BPF      ] = 0;       // 137 B相逆变功率因数（0.01）
            // uiSciAnalogDataBag[eAnalogInv_CPF      ] = 0;       // 138 C相逆变功率因数（0.01）

            // uiSciAnalogDataBag[eAnalogMircoInvLoaction       ] = 0; // g_SystemInfo.PowerBalance.BatDisChargeMax;//(Uint16)(g_SystemInfo.lLinePowerWattCversion/100) ;   // 139 总市电折算功率高位
            // uiSciAnalogDataBag[eAnalogMircoInvTotalGenEnergyH] = stEnergyCal.MircoInv.iTotalDisChargeH; // (int16)g_SystemInfo.ComInfo.fEcoModeStopVolt ;   // 140 总油机折算功率
            // uiSciAnalogDataBag[eAnalogMircoInvTotalGenEnergyL] = stEnergyCal.MircoInv.iTotalDisChargeL; // g_SystemInfo.ComInfo.iEcoModePower;// (Uint16)(g_SystemInfo.lLoadPowerConversion/100);   // 141 负载用电折算功率
            // uiSciAnalogDataBag[eAnalogRsvd142      ] = 0; // g_SystemInfo.PowerBalance.BatChargeMax; //(Uint16)(g_SystemInfo.lBatPowerConversion/100);//g_SystemInfo.ComInfo.iEcoModeChgDisChgEn ;   // 142 电池折算功率
            if(   eGenPortMode_SmartLoad == g_ComInfo.Com1.bit.GenModeSet
               && stValue.fRmsReal.VSmLoadA > 50
               && (   eInvMainState_OffGrid == g_InvVar.InvFlag.bit.bInvMainSts
                   || eInvMainState_OnGrid == g_InvVar.InvFlag.bit.bInvMainSts
                   || eInvMainState_SoftStart == g_InvVar.InvFlag.bit.bInvMainSts )
                )
            {
                uiSciAnalogDataBag[eAnalogSLoad_AVolt]    = stValue.fRmsReal.VSmLoadA * 10;    // 133 A相智能负载电压
                uiSciAnalogDataBag[eAnalogSLoad_ACurr ]   = stValue.fRmsReal.ISmLoadA * 10;    // 136 A相智能负载电流
                if(uiSciAnalogDataBag[eAnalogSLoad_ACurr ] < 3) { uiSciAnalogDataBag[eAnalogSLoad_ACurr ] = 0; }   // 136 A相智能负载电流
                uiSciAnalogDataBag[eAnalogSLoad_Freq]     = g_SystemInfo.uiGenFreq;             // 139 智能负载频率
                if(fabs(stPower.SSmartLoad.PhaseA) < 0.01f) { uiSciAnalogDataBag[eAnalogSLoad_APhaseP ] = 0; }          // 140 A相智能负载有功功率
                else { uiSciAnalogDataBag[eAnalogSLoad_APhaseP ] = (int16)(stPower.SSmartLoad.PhaseA * cSinglePRated); }
            }
            else
            {
                uiSciAnalogDataBag[eAnalogSLoad_AVolt]    = 0;  // 133 A相智能负载电压
                uiSciAnalogDataBag[eAnalogSLoad_ACurr ]   = 0;  // 136 A相智能负载电流
                uiSciAnalogDataBag[eAnalogSLoad_Freq]     = 0;  // 139 智能负载频率
                uiSciAnalogDataBag[eAnalogSLoad_APhaseP ] = 0;  // 140 A相智能负载有功功率
            }

            uiSciAnalogDataBag[eAnalogPowerFlowMsg2]  = unPowerFlowMsg2.uiPowerFlowMsg;  // 143 能流信息2
            uiSciAnalogDataBag[eAnalogPowerFlowMsg ]  = unPowerFlowMsg.uiPowerFlowMsg;   // 144 能流信息

            //正常情况下，不启动油机
            uiSciAnalogDataBag[eAnalogGenStartSignal] = g_SystemInfo.SysFlag.bit.GenStartSignal;// 145 油机启动信号

            if((eGenPortMode_SmartLoad == g_ComInfo.Com1.bit.GenModeSet) || (eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts))
            {
                uiSciAnalogDataBag[eAnalogGenTotalPower] = 0;  // 146 总油机功率
            }
            else
            {
                if(fabs(stPower.fPGenReal) < 60.0f || eRelayStateClose != g_RelayVar.CtrlSta.bit.GenRlySta)
                {
                    uiSciAnalogDataBag[eAnalogGenTotalPower] = 0;  // 146 总油机功率
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogGenTotalPower] = (int16)(-stPower.fPGenReal);  // 146 总油机功率
                }
            }

            if(eInvMainState_Idle == g_InvVar.InvFlag.bit.bInvMainSts)
            {
                uiSciAnalogDataBag[eAnalogLoadTotalPower] = 0;  // 147 总负载功率
                uiSciAnalogDataBag[eAnalogGridTotalPower] = 0;  // 148 总电网功率
            }
            else
            {
                if(fabs(stPower.fPOutReal) < 60.0f)
                {
                    uiSciAnalogDataBag[eAnalogLoadTotalPower] = 0;  // 147 总负载功率
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogLoadTotalPower] = (int16)(stPower.fPOutReal);  // 147 总负载功率
                }
                
                if(fabs(stPower.fPGridReal) < 60.0f || eRelayStateClose != g_RelayVar.CtrlSta.bit.GridRlySta)
                {
                    uiSciAnalogDataBag[eAnalogGridTotalPower] = 0; // 148 总电网功率
                }
                else
                {
                    uiSciAnalogDataBag[eAnalogGridTotalPower] = (int16)(stPower.fPGridReal); // 148 总电网功率
                }
            }

//内部测试
/*
#ifdef AnologUpdateForDebug
uiSciAnalogDataBag[eAnalogInvDc_AVolt  ] = (Uint16)(fReal_BatCurr(g_DcDcVar.fBatMaxChrCurrSet));
uiSciAnalogDataBag[eAnalogInvDc_BVolt  ] = (Uint16)(fReal_BatCurr(g_DcDcVar.fBatMaxDisChrCurrSet));
uiSciAnalogDataBag[eAnalogInvDc_CVolt  ] = (Uint16)(g_ComInfo.Com1.bit.BatDisChgLimitFlg);
uiSciAnalogDataBag[eAnalogInvDc_ACurr  ] = (int16)(-strBusVoltUpLmtRegu.integrator * cPowerRated);//g_ComInfo.Com1.bit.GridShavingEn;
uiSciAnalogDataBag[eAnalogInvDc_BCurr  ] = 0;
uiSciAnalogDataBag[eAnalogInvDc_CCurr  ] = fReal_BusVolt(strOnGridDeltaUpBusRef.Out);//(int16)((stPower.PGridCt.PhaseA * cSinglePRated));//外部CT_A
uiSciAnalogDataBag[eAnalogInvN_Volt   ] = (int16)(strBatPowerDerate.fBatDisVoltOrder);//电池放电电压降载

uiSciAnalogDataBag[eAnalogGenFreq ] = fReal_Power(g_SystemInfo.PowerBalance.PvMaxPower);     // 132 C相油机功率因数（0.01）
uiSciAnalogDataBag[eAnalogGridFreq    ] = strBatPowerDerate.fBatDisBmsOrder ;    // 132 C相油机功率因数（0.01）
uiSciAnalogDataBag[eAnalogInvFreq     ] = strBatPowerDerate.fBatChrCmdOrder ;    // 132 C相油机功率因数（0.01）
uiSciAnalogDataBag[eAnalogLoadFreq] = (int16)(fReal_Power(g_ComInfo.fInvChrPowerLmt));//电网给电池充电限制

//uiSciAnalogDataBag[eAnalogInv_CPhaseP ] = g_SysFault.ubFaultAc.fault.fault1;//(int16)(fReal_Power(g_InvVar.fPInvSoftStart));//功率环基准
//uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = g_SysFault.ubFaultAc.fault.fault2;//(int16)(-strBusVoltUpLmtRegu.Out * cPowerRated);//BUS高压触发环输出
//uiSciAnalogDataBag[eAnalogLoad_BPhaseP] = g_SysFault.ubFaultAc.fault.fault3;//(int16)(-strBusVoltDownLmtRegu.Out * cPowerRated);//BUS低压触发环输出
//uiSciAnalogDataBag[eAnalogLoad_CPhaseP] = g_SysFault.ubFaultAc.fault.fault4;//(int16)(fPinvLoopOutputRef * cPowerRated);//BUS高低压环总触发输出
uiSciAnalogDataBag[eAnalogInv_CPhaseP ] = (int16)(fReal_Power(g_InvVar.fPInvSoftStart));//功率环基准
// uiSciAnalogDataBag[eAnalogLoad_APhaseP ] = (int16)(-strBusVoltUpLmtRegu.Out * cPowerRated);//BUS高压触发环输出
uiSciAnalogDataBag[eAnalogLoad_BPhaseP] = (int16)(-strBusVoltUpLmtRegu.Out * cPowerRated);//BUS高压触发环输出;(int16)(-strBusVoltDownLmtRegu.Out * cPowerRated);//BUS低压触发环输出
uiSciAnalogDataBag[eAnalogLoad_CPhaseP] = (int16)(fPinvLoopOutputRef * cPowerRated);//BUS高低压环总触发输出

uiSciAnalogDataBag[eAnalogLoad_APhaseS] =  (int16)fReal_Power(strPVInvCtrlBatChgPRegu.Out);//电池充电限制环
uiSciAnalogDataBag[eAnalogLoad_BPhaseS] = (int16)fReal_Power(strInvCtrlBatDisChgPRegu.Out);//电池放电限制环
uiSciAnalogDataBag[eAnalogLoad_CPhaseS] = (int16)(fReal_Power(g_InvVar.fPInvTotalRefTemp));//功率环第二基准
uiSciAnalogDataBag[eAnalogLoad_APersent] = (int16)(fReal_Power(g_InvVar.fRefluxLoopOut));//防逆流输出
uiSciAnalogDataBag[eAnalogLoad_BPersent] = (int16)(fReal_Power(g_InvVar.fGridOutLoopOut));//电网减峰输出
uiSciAnalogDataBag[eAnalogLoad_CPersent] = (int16)(fReal_Power(g_InvVar.fPInvTotalRef));//功率环第三基准
uiSciAnalogDataBag[eAnalogGridCT_APhaseP] = fReal_BusVolt(strOnGridDeltaUpBusRef.Out);
uiSciAnalogDataBag[eAnalogGridCT_BPhaseP] = fReal_BusVolt(strOnGridDeltaDownBusRef.Out);

uiSciAnalogDataBag[eAnalogGridCT_CPhaseP] = (int16)(fReal_BusVolt(g_InvVar.fInvBusVoltSet));//母线给定// 139 总市电折算功率高位
uiSciAnalogDataBag[eAnalogSLoad_AVolt ] = (int16)(fReal_BusVolt(g_SystemInfo.fPvBusVoltSet));//PV母线给定// 140 总油机折算功率
uiSciAnalogDataBag[eAnalogSLoad_BVolt] = (int16)(mVBusRealCalc(strBusVoltUpLmtRegu.Ref) * 10);//BUS高压值 // 141 负载用电折算功率
uiSciAnalogDataBag[eAnalogSLoad_CVolt ] = (int16)(mVBusRealCalc(strBusVoltDownLmtRegu.Ref) * 10);//BUS低压值	// 142 电池折算功率
uiSciAnalogDataBag[eAnalogSLoad_ACurr  ] = (int16)(mVBusRealCalc(g_InvVar.fInvBusVoltRef) * 10);//g_FanVar.fPowerforFan;//从Dsp正母线电压// 143 PV输入折算功率
// uiSciAnalogDataBag[eAnalogPowerFlowMsg] = g_FanVar.fTempforFan;// 144 能流信息
#endif
*/
           break;
        }
        case 3:
        {
            // 以下暂时用来显示从DSP的数据  以下的数据经过了MCU处理 所以与DSP传的数据不一样
           uiSciAnalogDataBag[eAnalogPV1TotalGenEnergyH   ] = stEnergyCal.Pv1.iTotalDisChargeH;// 149 PV1总发电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogPV1TotalGenEnergyL   ] = stEnergyCal.Pv1.iTotalDisChargeL;// 150 PV1总发电量低位
           uiSciAnalogDataBag[eAnalogPV2TotalGenEnergyH   ] = stEnergyCal.Pv2.iTotalDisChargeH;// 151 PV2总发电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogPV2TotalGenEnergyL   ] = stEnergyCal.Pv2.iTotalDisChargeL;// 152 PV2总发电量低位
           uiSciAnalogDataBag[eAnalogPV3TotalGenEnergyH   ] = 0;                               // 153 PV3总发电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogPV3TotalGenEnergyL   ] = 0;                               // 154 PV3总发电量低位n
           uiSciAnalogDataBag[eAnalogPV4TotalGenEnergyH   ] = 0;                               // 155 PV4总发电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogPV4TotalGenEnergyL   ] = 0;                               // 156 PV4总发电量低位
           uiSciAnalogDataBag[eAnalogBat1TotalChargeH     ] = stEnergyCal.Bat.iTotalChargeH;   // 157 Bat1总充电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogBat1TotalChargeL     ] = stEnergyCal.Bat.iTotalChargeL;   // 158 Bat1总充电量低位（0.1KWh）
           uiSciAnalogDataBag[eAnalogBat1TotalDisChargeH  ] = stEnergyCal.Bat.iTotalDisChargeH;// 159 Bat1总放电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogBat1TotalDisChargeL  ] = stEnergyCal.Bat.iTotalDisChargeL;// 160 Bat1总放电量低位（0.1KWh）
           uiSciAnalogDataBag[eAnalogBat2TotalChargeH     ] = 0;                               // 161 Bat2总充电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogBat2TotalChargeL     ] = 0;                               // 162 Bat2总充电量低位（0.1KWh）
           uiSciAnalogDataBag[eAnalogBat2TotalDisChargeH  ] = 0;                               // 163 Bat2总放电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogBat2TotalDisChargeL  ] = 0;                               // 164 Bat2总放电量低位（0.1KWh）
           uiSciAnalogDataBag[eAnalogGridTotalCostEnergyH ] = stEnergyCal.Grid.iTotalChargeH;      // 165 电网总取电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogGridTotalCostEnergyL ] = stEnergyCal.Grid.iTotalChargeL;      // 166 电网总取电量低位（0.1KWh）
           uiSciAnalogDataBag[eAnalogGridTotalGenEnergyH  ] = stEnergyCal.Grid.iTotalDisChargeH;   // 167 电网总馈电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogGridTotalGenEnergyL  ] = stEnergyCal.Grid.iTotalDisChargeL;   // 168 电网总馈电量低位（0.1KWh）
           uiSciAnalogDataBag[eAnalogLoadTotalCostEnergyH ] = stEnergyCal.Load.iTotalDisChargeH;   // 169 负载总耗电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogLoadTotalCostEnergyL ] = stEnergyCal.Load.iTotalDisChargeL;   // 170 负载总耗电量低位（0.1KWh）

           uiSciAnalogDataBag[eAnalogGenTotalCostEnergyH ]  = stEnergyCal.Gen.iTotalChargeH;       // 171 油机总取电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogGenTotalCostEnergyL ]  = stEnergyCal.Gen.iTotalChargeL;       // 172 油机总取电量低位（0.1KWh）

           uiSciAnalogDataBag[eAnalogSmartLoadTotalCostEnergyH ] = stEnergyCal.Gen.iTotalDisChargeH;  // 173 智能负载总耗电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogSmartLoadTotalCostEnergyL ] = stEnergyCal.Gen.iTotalDisChargeL;  // 174 智能负载总耗电量低位（0.1KWh）
           uiSciAnalogDataBag[eAnalogHomeLoadTotalCostEnergyH  ] = stEnergyCal.HouseLoad.iTotalDisChargeH;  // 175 家庭负载总耗电量高位（0.1KWh）
           uiSciAnalogDataBag[eAnalogHomeLoadTotalCostEnergyL  ] = stEnergyCal.HouseLoad.iTotalDisChargeL;  // 176 家庭负载总耗电量低位（0.1KWh）
/**/
//内部测试
#ifdef AnologUpdateForDebug
            uiSciAnalogDataBag[eAnalogPV1TotalGenEnergyH  ] = g_ComInfo.unSBUModeEn.all;// g_InvVar.InvFlag.bit.bPllLockGenOKFlag;
            uiSciAnalogDataBag[eAnalogPV1TotalGenEnergyL  ] = uiSysMdlTurnOnNum;// g_ComInfo.Com1.bit.GenConnectEn;
            uiSciAnalogDataBag[eAnalogPV2TotalGenEnergyH  ] = g_InvVar.InvFlag.bit.bInvFollowGenPllOKFlag;
            uiSciAnalogDataBag[eAnalogPV2TotalGenEnergyL  ] = g_SystemInfo.Source.bit.GenSource;
            uiSciAnalogDataBag[eAnalogPV3TotalGenEnergyH  ] = cRadToFreq(g_SystemInfo.fSysPhaseErr) * 100;
            uiSciAnalogDataBag[eAnalogPV3TotalGenEnergyL  ] = cRadToFreq(g_SystemInfo.fSysFreqErr) * 100;

            uiSciAnalogDataBag[eAnalogPV4TotalGenEnergyH  ] = (g_ParaVar.fDroopQaAveOut * g_GridManager.Rated.f32VOut * 10);//(int16)((stPower.PGridCt.PhaseA * cSinglePRated));//外部CT_A
            uiSciAnalogDataBag[eAnalogPV4TotalGenEnergyL  ] = (g_ParaVar.fDroopQbAveOut * g_GridManager.Rated.f32VOut * 10);//fReal_Power(strInvCtrlBatDisChgPRegu.integrator);//g_ComInfo.Com1.bit.LoadFirstEn;//(int16)((stPower.PGridCt.PhaseB * cSinglePRated));//外部CT_B
            uiSciAnalogDataBag[eAnalogBat1TotalChargeH    ] = (int16)(fInvActivePowerFilt * 6000);//(int16)(g_ComInfo.Com1.bit.BatForceChar);//总CT

            uiSciAnalogDataBag[eAnalogBat1TotalChargeL	  ] = (int16)(fReal_Power(g_InvVar.fGridInPowerLoopOut));//strBatPowerDerate.fBatDisVoltOrder ;//电池放电电压降载
            uiSciAnalogDataBag[eAnalogBat1TotalDisChargeH ] = (int16)(stBasicPower.InvPa.fBasicWaveScale * cSinglePRated);//(int16)(fInvActivePowerReal * 6000);////strBatPowerDerate.fBatDisSocOrder ;// 132 C相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogBat1TotalDisChargeL ] = (int16)(fInvReactivePowerReal * 6000);//(int16)(stBasicPower.InvPb.fBasicWaveScale * cSinglePRated); 	 // 132 C相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogBat2TotalChargeH    ] = (int16)(stBasicPower.InvQa.fBasicWaveScale * cSinglePRated);//(int16)(fInvActivePowerFilt * 6000);// 	 // 132 C相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogBat2TotalChargeL    ] = (int16)(fInvReactivePowerFilt * 6000);//(int16)(stBasicPower.InvQb.fBasicWaveScale * cSinglePRated); 	 // 132 C相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogBat2TotalDisChargeH ] = g_ComInfo.Com1.Word.word0;	   // 132 C相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogBat2TotalDisChargeL ] = g_ComInfo.Com1.Word.word1; //strBatPowerDerate.fBatChrSocOrder  ;	  // 132 C相油机功率因数（0.01）
            uiSciAnalogDataBag[eAnalogGridTotalCostEnergyH] = g_ComInfo.fBat1VoltUpLimit;//strBatPowerDerate.fBatChrBmsOrder;

            uiSciAnalogDataBag[eAnalogGridTotalCostEnergyL] = (int16)(fReal_Power(g_ComInfo.fInvChrPowerLmt));//电网给电池充电限制
            uiSciAnalogDataBag[eAnalogGridTotalGenEnergyH ] = (int16)(fReal_Power(g_InvVar.fPInvSoftStart));//功率环基准
            uiSciAnalogDataBag[eAnalogGridTotalGenEnergyL ] = (int16)(-strBusVoltUpLmtRegu.Out * cPowerRated);//BUS高压触发环输出
            uiSciAnalogDataBag[eAnalogLoadTotalCostEnergyH] = (int16)(-strBusVoltDownLmtRegu.Out * cPowerRated);//BUS低压触发环输出
            uiSciAnalogDataBag[eAnalogLoadTotalCostEnergyL] = (int16)(fPinvLoopOutputRef * cPowerRated);//BUS高低压环总触发输出
            uiSciAnalogDataBag[eAnalogGenTotalCostEnergyH ] = (int16)fReal_Power(strPVInvCtrlBatChgPRegu.Out);//电池充电限制环
            uiSciAnalogDataBag[eAnalogGenTotalCostEnergyL ] = (int16)fReal_Power(strInvCtrlBatDisChgPRegu.Out);//电池放电限制环
            uiSciAnalogDataBag[eAnalogSmartLoadTotalCostEnergyH] = (int16)(fReal_Power(g_InvVar.fPInvTotalRefTemp));//功率环第二基准
            uiSciAnalogDataBag[eAnalogSmartLoadTotalCostEnergyL] = (int16)(fReal_Power(g_InvVar.fRefluxLoopOut));//防逆流输出
            uiSciAnalogDataBag[eAnalogHomeLoadTotalCostEnergyH] = (int16)(fReal_Power(g_InvVar.fGridOutLoopOut));//电网减峰输出
            uiSciAnalogDataBag[eAnalogHomeLoadTotalCostEnergyL] = (int16)(fReal_Power(g_InvVar.fPInvTotalRef));//功率环第三基准

            //  以下都不要赋值
            uiSciAnalogDataBag[eAnaPV1DayGenEnergy     ] = unRxSysStaFlag.all ;                     // 177 PV1日发电量（0.1KWh），移至GD处计算
            uiSciAnalogDataBag[eAnaPV1MonthGenEnergyH  ] = unRxSysStaFlag.bit.bUPMTurnOn        ;   // 178 PV1月发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV1MonthGenEnergyL  ] = unRxSysStaFlag.bit.bUPMTurnToOnGrid  ;   // 179 PV1月发电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV1YearGenEnergyH   ] = unRxSysStaFlag.bit.bUPMTurnToOnGen   ;   // 180 PV1年发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV1YearGenEnergyL   ] = unRxSysStaFlag.bit.bUPMTurnToOffGrid ;   // 181 PV1年发电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV2DayGenEnergy     ] = unRxSysStaFlag.bit.bUPMInvKM_ON ;        // 182 PV2日发电量（0.1KWh）
            uiSciAnalogDataBag[eAnaPV2MonthGenEnergyH  ] = unRxSysStaFlag.bit.bSysInvState ;        // 183 PV2月发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV2MonthGenEnergyL  ] = unRxSysStaFlag.bit.bSysGridNormal ;      // 184 PV2月发电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV2YearGenEnergyH   ] = unRxSysStaFlag.bit.bSysGenNormal ; //unRxSysStaFlag.bit.bUPMOffLineMultiNum ; // 185 PV2年发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV2YearGenEnergyL   ] = unRxSysStaFlag.bit.bUPMInStateNum ;      // 186 PV2年发电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV3DayGenEnergy     ] = (int16)(fRxFromSysAnalog_Omega * cKParaDeltaStepRadTx);        // 187 PV3日发电量（0.1KWh）
            uiSciAnalogDataBag[eAnaPV3MonthGenEnergyH  ] = (int16)(fRxFromSysAnalog_OutRmsAVolt * 10000);        // 188 PV3月发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV3MonthGenEnergyL  ] = (int16)(fRxFromSysAnalog_GridAvgPa * 10000);        // 189 PV3月发电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV3YearGenEnergyH   ] = (int16)(fRxFromSysAnalog_OutAvgQa * 10000);        // 190 PV3年发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV3YearGenEnergyL   ] = (int16)(fRxFromSysAnalog_OutDerarPCT * 10000);        // 191 PV3年发电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV4DayGenEnergy     ] = (int16)(fRxFromSysAnalog_BatCurrPCT * 100);        // 192 PV4日发电量（0.1KWh）
            uiSciAnalogDataBag[eAnaPV4MonthGenEnergyH  ] = (int16)(fRxFromSysAnalog_PLoadPCT * 100);        // 193 PV4月发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV4MonthGenEnergyL  ] = (int16)(fRxFromSysAnalog_PPvPCT * 100);        // 194 PV4月发电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV4YearGenEnergyH   ] = (int16)(uiRxFromSysState_MdlBaseFlag);        // 195 PV4年发电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaPV4YearGenEnergyL   ] = (int16)(uiSelfFrameFlagData_MdlBaseFlag);        // 196 PV4年发电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaPVTotalGenEnergyH   ] = (int16)(g_ParaVar.fDroopDeltaFreq * 1000);        // 197 PV发电量查询：总-高32位
            uiSciAnalogDataBag[eAnaPVTotalGenEnergyL   ] = (int16)(g_ParaVar.fDroopDeltaVolt * g_GridManager.Rated.f32VOut);        // 198 PV发电量查询：总-低32位
            uiSciAnalogDataBag[eAnaBat1DayCharge       ] = (int16)(g_ParaVar.fDroopQaAveOut * g_GridManager.Rated.f32VOut);        // 199 Bat1日充电量（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1MonthChargeH    ] = uiSysInvRlyReadyNum;   // 200 Bat1月充电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1MonthChargeL    ] = uiSysComOkNum	  ;   // 201 Bat1月充电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1YearChargeH     ] = uiSysNoFaultNum    ;   // 202 Bat1年充电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1YearChargeL     ] = uiSysGridNormalNum ;   // 203 Bat1年充电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1DayDisCharge    ] = uiSysGenNormalNum  ;   // 204 Bat1日放电量（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1MonthDisChargeH ] = uiSysOffGridRunNum ;   // 205 Bat1月放电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1MonthDisChargeL ] = uiSysOnGridRunNum  ;   // 206 Bat1月放电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1YearDisChargeH  ] = uiSysOnGenRunNum   ;   // 207 Bat1年放电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat1YearDisChargeL  ] = uiSysGridRlyReadyNum ;        // 208 Bat1年放电量低位（0.1KWh）
#endif
            break;
        }
        case 4:
        {
/**/
#ifdef AnologUpdateForDebug
            uiSciAnalogDataBag[eAnaBat2DayCharge        ] = uiSelfFrameFlagData_AllMdlFlag ;		// 208 Bat1年放电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2MonthChargeH     ] = uiSysUpmInvStateSum ;// 210 Bat2月充电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2MonthChargeL     ] = uiSysUpmInvStateNum ;// 211 Bat2月充电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2YearChargeH      ] = uiFrameFlagData_Sys2UpmFlag(uiSelfFrameCanID) ;       // 212 Bat2年充电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2YearChargeL      ] = uiMFrameFlagData_Sys2UpmFlag(uiFrameParaPhaseSeq) ;       // 213 Bat2年充电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2DayDisCharge     ] = cRadToFreq(g_SystemInfo.fSysFreStepRad) * 100 ;       // 214 Bat2日放电量（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2MonthDisChargeH  ] = cRadToFreq(strPllToInv.fFreStepRad) * 100 ;       // 215 Bat2月放电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2MonthDisChargeL  ] = cRadToFreq(strPllToInv.fFinalStepRad) * 100 ;       // 216 Bat2月放电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2YearDisChargeH   ] = (int16)fReal_Power(g_SystemInfo.PowerBalance.Load);//uiSlaveAnalogData[eS2MRealData07];//217 ;       // 217 Bat2年放电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaBat2YearDisChargeL   ] = (int16)fReal_Power(g_SystemInfo.PowerBalance.PV);//uiSlaveAnalogData[eS2MRealData08];//218 ;       // 218 Bat2年放电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaGridDayCostEnergy    ] = (int16)fReal_Power(g_SystemInfo.PowerBalance.BatChargeMax);//uiSlaveAnalogData[eS2MRealData09];//219 ;       // 219 Grid日取电量（0.1KWh）    移至GD处计算
            uiSciAnalogDataBag[eAnaGridMonthCostEnergyH ] = (int16)fReal_Power(g_SystemInfo.PowerBalance.BatDisChargeMax);//uiSlaveAnalogData[eS2MRealData10];//220 ;       // 220 Grid月取电量高位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaGridMonthCostEnergyL ] = (int16)fReal_Power(g_SystemInfo.PowerBalance.PInvRefTemp);//uiSlaveAnalogData[eS2MRealData11];//221 ;       // 221 Grid月取电量低位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaGridYearCostEnergyH  ] = (int16)fReal_Power(g_SystemInfo.PowerBalance.QInvRefTemp);//uiSlaveAnalogData[eS2MRealData12];//222 ;       // 222 Grid年取电量高位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaGridYearCostEnergyL  ] = (int16)fReal_Power(stPower.fPOutTotal);//uiSlaveAnalogData[eS2MRealData13];//223 ;       // 223 Grid年取电量低位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaGridDayGenEnergy     ] = (int16)fReal_Power(stPower.fPGenTotal);//uiSlaveAnalogData[eS2MRealData14];//224 ;       // 224 Grid日馈电量（0.1KWh）    移至GD处计算
            uiSciAnalogDataBag[eAnaGridMonthGenEnergyH  ] = (int16)fReal_Power(stPower.PHomeLoad.PhaseA);//uiSlaveAnalogData[eS2MRealData15];//225 ;       // 225 Grid月馈电量高位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaGridMonthGenEnergyL  ] = (int16)fReal_Power(strSlvAnalog.fPvPowerAll);//uiSlaveAnalogData[eS2MRealData16];//226 ;       // 226 Grid月馈电量低位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaGridYearGenEnergyH   ] = (int16)fReal_Power(g_ComInfo.fRefluxPowerRef);//uiSlaveAnalogData[eS2MRealData17];//227 ;       // 227 Grid年馈电量高位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaGridYearGenEnergyL   ] = uiSelfFrameAnalogData_BatCurrPCT;//0;//uiSlaveAnalogData[eS2MRealData18];//228 ;       // 228 Grid年馈电量低位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaLoadDayCostEnergy    ] = uiSelfFrameAnalogData_PLoadPCT;//0;//uiSlaveAnalogData[eS2MRealData19];//229 ;       // 229 Load日耗电量（0.1KWh）    移至GD处计算
            uiSciAnalogDataBag[eAnaLoadMonthCostEnergyH ] = uiSelfFrameAnalogData_PPvPCT;//0;//uiSlaveAnalogData[eS2MRealData20];//230 ;       // 230 Load月耗电量高位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaLoadMonthCostEnergyL ] = uiMasterFlag_Sys2UpmFlag;// 0;//uiSlaveAnalogData[eS2MRealData21];//231 ;       // 231 Load月耗电量低位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaLoadYearCostEnergyH  ] = g_ComInfo.iEcoBatChgDisChgEn;//uiSlaveAnalogData[eS2MRealData22];//232 ;       // 232 Load年耗电量高位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaLoadYearCostEnergyL  ] = g_SystemInfo.SysFlag.word.word0;       //0;//uiSlaveAnalogData[eS2MRealData23];//233 ;       // 233 Load年耗电量低位（0.1KWh）  移至GD处计算
            uiSciAnalogDataBag[eAnaGenDayCostEnergy     ] = g_SystemInfo.SysFlag.word.word1;       //0;//uiSlaveAnalogData[eS2MRealData24];//234 ;       // 234 Gen日取电量（0.1KWh）
            uiSciAnalogDataBag[eAnaGenMonthCostEnergyH  ] = g_SystemInfo.SysFlag.word.word2;       //0;//uiSlaveAnalogData[eS2MRealData25];//235 ;       // 235 Gen月取电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaGenMonthCostEnergyL  ] = g_SystemInfo.SysFlag.word.word3;       // 236 Gen月取电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaGenYearCostEnergyH   ] = (int16)(fReal_Power(g_InvVar.fGridInPowerLoopOut));//237 ;       // 237 Gen年取电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaGenYearCostEnergyL   ] = (int16)(fReal_Power(g_ComInfo.fGridOutPowerRef));       // 238 Gen年取电量低位（0.1KWh）

            uiSciAnalogDataBag[eAnaSmartLoadDayCostEnergy     ] = stateTest[0];          // 239 智能负载日耗电量（0.1KWh）
            uiSciAnalogDataBag[eAnaSmartLoadMonthCostEnergyH  ] = stateTest[1];          // 240 智能负载月耗电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaSmartLoadMonthCostEnergyL  ] = stateTest[2];          // 241 智能负载月耗电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaSmartLoadYearCostEnergyH   ] = stateTest[3];          // 242 智能负载年耗电量高位（0.1KWh）
            uiSciAnalogDataBag[eAnaSmartLoadYearCostEnergyL   ] = stateTest[4];          // 243 智能负载年耗电量低位（0.1KWh）
            uiSciAnalogDataBag[eAnaHomeLoadDayCostEnergy      ] = stateTest[5];          // 244 家庭负载日耗电量
            uiSciAnalogDataBag[eAnaHomeLoadMonthCostEnergyH   ] = stateTest[6];          // 245 家庭负载月耗电量高位
            uiSciAnalogDataBag[eAnaHomeLoadMonthCostEnergyL   ] = stateTest[7];          // 246 家庭负载月耗电量低位
            uiSciAnalogDataBag[eAnaHomeLoadYearCostEnergyH    ] = stateTest[8];          // 247 家庭负载年耗电量高位
            uiSciAnalogDataBag[eAnaHomeLoadYearCostEnergyL    ] = stateTest[9];          // 248 家庭负载年耗电量低位

            uiSciAnalogDataBag[eAnalogRsvd249      ] = (int16)(g_ComInfo.fBat1ForceChgVoltStart);          // 249 预留
            uiSciAnalogDataBag[eAnalogRsvd250      ] = (int16)(g_ComInfo.fBat1ForceChgVoltStop);//250 ;          // 250 预留
            uiSciAnalogDataBag[eAnalogRsvd251      ] = (int16)(stValue.fAveReal.VBat);//251 ;          // 251 预留
            uiSciAnalogDataBag[eAnalogRsvd252      ] = unRxSysStaFlag2.all;          // 252 预留
#endif
            break;
        }
        case 5:
        {
            // 以下暂时用来显示从DSP的数据  以下的数据经过了MCU处理 所以与DSP传的数据不一样
           uiSciAnalogDataBag[eEqStage                  ] = 0;                               // 301 EQ状态
           uiSciAnalogDataBag[eATSStartSignal           ] = 0;                               // 302 ATS启动信号
           uiSciAnalogDataBag[eLinePowerConvertion      ] = (int16)(stPowerConver.fPGrid_Conver);          // 303 电网折算功率（W）
           uiSciAnalogDataBag[eGenPowerConvertion       ] = (int16)(stPowerConver.fPGen_Conver);           // 304 油机折算功率（W）
           uiSciAnalogDataBag[eBatPowerConvertion       ] = (int16)(stPowerConver.fPBat_Conver);           // 305 电池折算功率（W）
           uiSciAnalogDataBag[eLoadPowerConvertion      ] = (int16)(stPowerConver.fPLoad_Conver);          // 306 负载折算功率（W）
           uiSciAnalogDataBag[eSmartLoadPowerConvertion ] = (int16)(stPowerConver.fPSmtLoad_Conver);       // 307 智能负载折算功率（W）
           uiSciAnalogDataBag[ePV1PowerConvertion       ] = (int16)(stPowerConver.fPPv1_Conver);           // 308 PV1折算功率（W）
           uiSciAnalogDataBag[ePV2PowerConvertion       ] = (int16)(stPowerConver.fPPv2_Conver);           // 309 PV2折算功率（W）
           uiSciAnalogDataBag[eLineCurrConvertion       ] = (int16)(stPowerConver.fIGrid_Conver * 10);     // 310 电网折算电流（0.1A）
           uiSciAnalogDataBag[eGenCurrConvertion        ] = (int16)(stPowerConver.fIGen_Conver * 10);      // 311 油机折算电流（0.1A）
           uiSciAnalogDataBag[eBatCurrConvertion        ] = (int16)(stPowerConver.fIBat_Conver * 10);      // 312 电池折算电流（0.1A）
           uiSciAnalogDataBag[eLoadCurrConvertion       ] = (int16)(stPowerConver.fILoad_Conver * 10);     // 313 负载折算电流（0.1A）
           uiSciAnalogDataBag[eSmartLoadCurrConvertion  ] = (int16)(stPowerConver.fISmtLoad_Conver * 10);  // 314 智能负载折算电流（0.1A）
           uiSciAnalogDataBag[ePV1CurrConvertion        ] = (int16)(stPowerConver.fIPv1_Conver * 10);      // 315 PV1折算电流（0.1A）
           uiSciAnalogDataBag[ePV2CurrConvertion        ] = (int16)(stPowerConver.fIPv2_Conver * 10);      // 316 PV2折算电流（0.1A）
/**/
//内部测试
#ifdef AnologUpdateForDebug
#endif
            break;
        }
        //.........
        default:
        {
            uiRenewStep = 0;
            break;
        }
    }

}

/******************************************************************************
Function Name           :MonitorProtocol_AnologInfoDataUpdate
------------------------------------------------------------------------------
Function Descriptions   : 更新模拟量
Parameter Name list     : 021506004825010001
ReturnType              :
Refer documents         : 20ms  特别注意：上传负的浮点数时，要将浮点数先转成有符号整数，再赋给无符号数组,否则会出错！
******************************************************************************/
void MonitorProtocol_AnologInfoDataUpdate(void)
{
    static Uint16 uiRenewStep = 0;

    switch(uiRenewStep++)
    {
        case 0:
        {
            uiSciAnalogInforDataBag[ eInflogTypeID        ] = cDeviceType;//  0   DeviceType  大类
            uiSciAnalogInforDataBag[ eInflogSubTypeID     ] = uiSciSetDataBag[eATE_SubTypeID];//  1   子类
            uiSciAnalogInforDataBag[ eInflogCommProVerID  ] = 0; //  2   通讯协议版本号
            uiSciAnalogInforDataBag[ eInflogCommInfoID    ] = g_SystemInfo.usVerDate;//  3   通讯信息

            uiSciAnalogInforDataBag[ eInflogSNID1         ] = uiSciSetDataBag[eATE_SN1]; //  4   序列号/SN另外机器型号通过SN码识别
            uiSciAnalogInforDataBag[ eInflogSNID2         ] = uiSciSetDataBag[eATE_SN2]; //  5   序列号/SN另外机器型号通过SN码识别
            uiSciAnalogInforDataBag[ eInflogSNID3         ] = uiSciSetDataBag[eATE_SN3]; //  6   序列号/SN另外机器型号通过SN码识别
            uiSciAnalogInforDataBag[ eInflogSNID4         ] = uiSciSetDataBag[eATE_SN4]; //  7   序列号/SN另外机器型号通过SN码识别
            uiSciAnalogInforDataBag[ eInflogSNID5         ] = uiSciSetDataBag[eATE_SN5]; //  8   序列号/SN另外机器型号通过SN码识别

            uiSciAnalogInforDataBag[ eInflogSNLenID       ] = 18;  //  9   机器序列号长度
            uiSciAnalogInforDataBag[ eInflogDispSwVerID   ] = 0;   //  10  显示板软件版本号
            uiSciAnalogInforDataBag[ eInflogMCU1SwVerID   ] = g_SystemInfo.usMstVersion;       //  11  MCU1版本/MCU1 Version
            uiSciAnalogInforDataBag[ eInflogMCU2SwVerID   ] = strSlvAnalog.uwSlaveDSPVersion;  //  12  MCU2版本/MCU2 Version
            uiSciAnalogInforDataBag[ eInflogDispHwVerID   ] = 0;   //  13  显示板硬件版本号
            uiSciAnalogInforDataBag[ eInflogCtrlHwVerID   ] = (Uint16)(g_SystemInfo.SysFlag.bit.HdVerIdentify << 4) + g_SystemInfo.HDVerionCode;  //  14  控制板硬件版本号
            uiSciAnalogInforDataBag[ eInflogPowerHwVerID  ] = g_ComInfo.MachinePhase;  //  15  功率板硬件版本号
            break;
        }

        case 1:
        {
            uiSciAnalogInforDataBag[ eInflogRsvd1ID       ] = 0;  //  16  预留
            uiSciAnalogInforDataBag[ eInflogRsvd2ID       ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd3ID       ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd4ID       ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd5ID       ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd6ID       ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd7ID       ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd8ID       ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd9ID       ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd10ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd11ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd12ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd13ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd14ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd15ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd16ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd17ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd18ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd19ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd20ID      ] = 0;

//			uiSciAnalogInforDataBag[eInflogRsvd1ID  ] = fReal_Power(strInvCtrlBatDisChgPRegu.Err);//(Uint16)(strBMSLogicInfo.uiBMS1DataAllowUse);
//			uiSciAnalogInforDataBag[eInflogRsvd2ID  ] = (Uint16)(fReal_BatCurr(g_DcDcVar.fBatMaxChrCurrSet));
//			uiSciAnalogInforDataBag[eInflogRsvd3ID  ] = (Uint16)(fReal_BatCurr(g_DcDcVar.fBatMaxDisChrCurrSet));
//			uiSciAnalogInforDataBag[eInflogRsvd4ID  ] = (Uint16)(g_ComInfo.Com1.bit.BatDisChgLimitFlg);
//			uiSciAnalogInforDataBag[eInflogRsvd5ID  ] = (int16)(-strBusVoltUpLmtRegu.integrator * cPowerRated);//g_ComInfo.Com1.bit.GridShavingEn;
//			uiSciAnalogInforDataBag[eInflogRsvd6ID  ] = g_uiBatAbnormalFlg;
//			uiSciAnalogInforDataBag[eInflogRsvd7ID  ] = fReal_BusVolt(strOnGridDeltaUpBusRef.Out);//(int16)((stPower.PGridCt.PhaseA * cSinglePRated));//外部CT_A
//			uiSciAnalogInforDataBag[eInflogRsvd8ID  ] = fReal_BusVolt(strOnGridDeltaDownBusRef.Out);//fReal_Power(strInvCtrlBatDisChgPRegu.integrator);//g_ComInfo.Com1.bit.LoadFirstEn;//(int16)((stPower.PGridCt.PhaseB * cSinglePRated));//外部CT_B
//			uiSciAnalogInforDataBag[eInflogRsvd9ID	] = (int16)(stValue.fAveReal.IDcDc * 10);//(int16)(g_ComInfo.Com1.bit.BatForceChar);//总CT
//			uiSciAnalogInforDataBag[eInflogRsvd10ID	] = fReal_BusVolt(stADC.fRealScale.VBus);//strBatPowerDerate.fBatDisVoltOrder ;//电池放电电压降载
//			uiSciAnalogInforDataBag[eInflogRsvd11ID  ] = fReal_BusVolt(g_SystemInfo.fPvBusVoltSet);//strBatPowerDerate.fBatDisSocOrder ;// 132 C相油机功率因数（0.01）
//			uiSciAnalogInforDataBag[eInflogRsvd12ID  ] = fReal_Power(g_SystemInfo.PowerBalance.PvMaxPower);	 // 132 C相油机功率因数（0.01）
//			uiSciAnalogInforDataBag[eInflogRsvd13ID	] = strBatPowerDerate.fBatDisBmsOrder ;	 // 132 C相油机功率因数（0.01）
//			uiSciAnalogInforDataBag[eInflogRsvd14ID	] = strBatPowerDerate.fBatChrCmdOrder ;	 // 132 C相油机功率因数（0.01）
//			uiSciAnalogInforDataBag[eInflogRsvd15ID  ] = strBatPowerDerate.fBatChrVoltOrder	;	   // 132 C相油机功率因数（0.01）
//
//			uiSciAnalogDataBag[eInflogRsvd16ID] = (int16)(fReal_BusVolt(g_InvVar.fInvBusVoltSet));//母线给定// 139 总市电折算功率高位
//			uiSciAnalogDataBag[eInflogRsvd17ID ] = (int16)(fReal_BusVolt(g_SystemInfo.fPvBusVoltSet));//PV母线给定// 140 总油机折算功率
//			uiSciAnalogDataBag[eInflogRsvd18ID] = (int16)(mVBusRealCalc(strBusVoltUpLmtRegu.Ref) * 10);//BUS高压值 // 141 负载用电折算功率
//			uiSciAnalogDataBag[eInflogRsvd19ID ] = (int16)(mVBusRealCalc(strBusVoltDownLmtRegu.Ref) * 10);//BUS低压值	// 142 电池折算功率
//			uiSciAnalogDataBag[eInflogRsvd20ID  ] = g_FanVar.fPowerforFan;//从Dsp正母线电压// 143 PV输入折算功率
            break;
        }

        case 2:
        {
            uiSciAnalogInforDataBag[ eInflogRsvd21ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd22ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd23ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd24ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd25ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd26ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd27ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd28ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd29ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd30ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd31ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd32ID      ] = 0;
            uiSciAnalogInforDataBag[ eInflogRsvd33ID      ] = 0;  //  48  预留
            
//			uiSciAnalogInforDataBag[eInflogRsvd21ID] = g_SystemInfo.fBatVoltAvgReal;//strBatPowerDerate.fBatChrSocOrder	;	  // 132 C相油机功率因数（0.01）
//			uiSciAnalogInforDataBag[eInflogRsvd22ID] = g_SystemInfo.ComInfo.fBat1VoltUpLimit;//strBatPowerDerate.fBatChrBmsOrder;
//			uiSciAnalogInforDataBag[eInflogRsvd23ID] = (int16)(fReal_Power(g_SystemInfo.ComInfo.fInvChrPowerLmt));//电网给电池充电限制
//			uiSciAnalogInforDataBag[eInflogRsvd24ID] = (int16)(fReal_Power(g_InvVar.fPInvSoftStart));//功率环基准
//			uiSciAnalogInforDataBag[eInflogRsvd25ID] = (int16)(-strBusVoltUpLmtRegu.Out * cPowerRated);//BUS高压触发环输出	
//			uiSciAnalogInforDataBag[eInflogRsvd26ID] = (int16)(-strBusVoltDownLmtRegu.Out * cPowerRated);//BUS低压触发环输出
//			uiSciAnalogInforDataBag[eInflogRsvd27ID] = (int16)(fPinvLoopOutputRef * cPowerRated);//BUS高低压环总触发输出
//			uiSciAnalogInforDataBag[eInflogRsvd28ID] = (int16)fReal_Power(strPVInvCtrlBatChgPRegu.Out);//电池充电限制环
//			uiSciAnalogInforDataBag[eInflogRsvd29ID] = (int16)fReal_Power(strInvCtrlBatDisChgPRegu.Out);//电池放电限制环
//			uiSciAnalogInforDataBag[eInflogRsvd30ID] = (int16)(fReal_Power(g_InvVar.fPInvTotalRefTemp));//功率环第二基准
//			uiSciAnalogInforDataBag[eInflogRsvd31ID] = (int16)(fReal_Power(g_InvVar.fRefluxLoopOut));//防逆流输出
//			uiSciAnalogInforDataBag[eInflogRsvd32ID] = (int16)(fReal_Power(g_InvVar.fGridOutLoopOut));//电网减峰输出
//			uiSciAnalogInforDataBag[eInflogRsvd33ID] = (int16)(fReal_Power(g_InvVar.fPInvTotalRef));//功率环第三基准

            break;
        }
        case 3:
        {
            uiSciAnalogInforDataBag[ eInflogCurrBMSAddr   ] = 0;  //  49  当前电池包通讯地址
            uiSciAnalogInforDataBag[ eInflogType          ] = 0;  //  50  DeviceType
            uiSciAnalogInforDataBag[ eInflogSubType       ] = 0;  //  51  子类
            uiSciAnalogInforDataBag[ eInflogCommProVer    ] = 0;  //  52  通讯协议版本号
            uiSciAnalogInforDataBag[ eInflogCommInfo      ] = 0;  //  53  通讯信息
            uiSciAnalogInforDataBag[ eInflogSN1           ] = 0;  //  54  机器序列号
            uiSciAnalogInforDataBag[ eInflogSN2           ] = 0;  //  55  机器序列号
            uiSciAnalogInforDataBag[ eInflogSN3           ] = 0;  //  56  机器序列号
            uiSciAnalogInforDataBag[ eInflogSN4           ] = 0;  //  57  机器序列号
            uiSciAnalogInforDataBag[ eInflogSN5           ] = 0;  //  58  机器序列号
            uiSciAnalogInforDataBag[ eInflogSNLen         ] = 0;  //  59  机器序列号长度
            uiSciAnalogInforDataBag[ eInflogDispSwVer     ] = 0;  //  60  显示板软件版本号
            uiSciAnalogInforDataBag[ eInflogMCU1SwVer     ] = 0;  //  61  MCU1软件版本号
            uiSciAnalogInforDataBag[ eInflogMCU2SwVer     ] = 0;  //  62  MCU2软件版本号
            uiSciAnalogInforDataBag[ eInflogDispHwVer     ] = 0;  //  63  显示板硬件版本号
            uiSciAnalogInforDataBag[ eInflogCtrlHwVer     ] = 0;  //  64  控制板硬件版本号
            uiSciAnalogInforDataBag[ eInflogPowerHwVer    ] = 0;  //  65  功率板硬件版本号
            break;
        }
        case 4:
        {


            break;
        }
        //.........
        default:
        {
            uiRenewStep = 0;
            break;
        }
    }

}
/******************************************************************************
Function Name: Sci_CrcCaculate
--------------------------------------
Function Descriptions   :
Parameter Name list :
ReturnTyp           :
Refer doctuments        :
******************************************************************************/
Uint16 Sci_CrcCaculate(Uint16 *DataFirstAddPtr,Uint16 uiDataLength)
{
    Uint16 uiTemp;
    Uint16 uiCRCWord = 0xFFFF;

    while (uiDataLength--)
    {
        uiTemp = (*DataFirstAddPtr++ ^ uiCRCWord) & 0x00FF;
        uiCRCWord >>= 8;
        uiCRCWord ^= uiCRCTable[uiTemp];
    }
    return uiCRCWord;
}

static inline float32 Get_Power(float32 sPower)
{
	return (sPower > 0) ? sPower : 0;
}
/******************************************************************************
Function Name: Sci_PowerCalculate
--------------------------------------
Function Descriptions   : 功率折算
Parameter Name list     :
ReturnTyp               :
Refer doctuments        :
******************************************************************************/
void MonitorProtocol_PowerCalc(float32 fP_Grid, float32 fP_Gen, float32 fP_Bat, float32 fP_Inv, float32 fP_Load, float32 fP_SmartLoad, float32 fP_Pv1, float32 fP_Pv2)
{
    float32 s_wPVPowerTotal = 0;
    float32 s_wPVPowerConversion = 0;
    float32 s_wBatPower = 0; // >0: charge,  <0: Discharge
    float32 s_dwGridPower = 0;
    float32 s_dwGenPower = 0;
    float32 s_dwOPWatt = 0;
    float32 s_dwSmartOPWatt = 0;
    float32 s_dwRequiredPower;
    float32 s_dwSupplyPower;
    float32 s_wBalancePower;
    float32 s_wCorrectionFactor = 1;
    float32 s_dwRequiredPowerRatio = 1;
    float32 s_dwSupplyPowerRatio = 1;
    // float32*  s_dwAcPower;

    //1、准备数据
    //PV功率
    if(ePvLose != g_SystemInfo.Source.bit.Pv1)
    {
        s_wPVPowerTotal += fP_Pv1;
    }
    if(ePvLose != g_SystemInfo.Source.bit.Pv2)
    {
        s_wPVPowerTotal += fP_Pv2;
    }

    //负载功率
    if(fP_Load > 20)
    {
        s_dwOPWatt = fP_Load;  // 避免空载采用误差
    }
    if(fP_SmartLoad > 20)
    {
        s_dwSmartOPWatt = fP_SmartLoad;
    }

    //电池功率
    if(eLLCRunState_Boost == g_DcDcVar.DcDcFlag.bit.bLLcSts)
    {
        s_wBatPower = fP_Bat;

        //并网或离网且PV功率足够带载(未验证，只有电池充满不充不放时出现)情况下，小功率放电认为是采样误差
        if(   ((OnGridMode == g_SystemInfo.usSystemMode) || ((OffGridMode == g_SystemInfo.usSystemMode) && (s_wPVPowerTotal > s_dwOPWatt + s_dwSmartOPWatt + 50)))
           && (s_wBatPower < 0 && s_wBatPower > -120) )
        {
            s_wBatPower = 0;
        }
    }
// stateTest[2] = (int16)(fP_Bat);
// stateTest[3] = (int16)(s_wBatPower);
    //AC功率
    if((OnGridMode == g_SystemInfo.usSystemMode) || (OnGenMode == g_SystemInfo.usSystemMode) || (BypassMode == g_SystemInfo.usSystemMode))
    {
        //PV存在的情况下，PV优先充电，市电不显示充电功率(电池电压低于一定值市电也会充电，需要验证！！！)
        //PV不足时全部去充电，折算后会显示PV带了一点载，考虑到客户对此工况下市电去充电更敏感，先维持此修改
        // Uint16 IsRectifiedPowerClr = (   (swGetEEChgPriority() == cChargeSolarFirst || swGetEEChgPriority() == cChargeSolarOnly)
        //                               && (s_wPVPowerTotal > (s_wBatPower + 50))
        //                               && ((fP_Inv < 0) && fP_Inv > -150) ); // 市电小电流充电
        // Uint16 IsRectifiedPowerClr = (   (s_wPVPowerTotal > (s_wBatPower + 50))
        //                               && ((fP_Inv < 0) && fP_Inv > -100) ); // PV功率大于市电小电流充电时
        Uint16 IsRectifiedPowerClr = 1;
        if(OnGridMode == g_SystemInfo.usSystemMode)
        {
            if(IsRectifiedPowerClr)  //PV存在情况下，整流功率处理掉，不然会显示为市电给电池充电
            {
                s_dwGridPower = s_dwOPWatt + s_dwSmartOPWatt;
            }
            else
            {
                s_dwGridPower = s_dwOPWatt + s_dwSmartOPWatt - fP_Inv;	//逆变 : <0 整流  >0逆变
            }
        }
        else if(OnGenMode == g_SystemInfo.usSystemMode)
        {
            s_dwGenPower = fP_Gen;

            if(IsRectifiedPowerClr /*&& (s_dwGenPower > abs(g_dwRInvWatt))*/)  //先屏蔽
            {
                s_dwGenPower += fP_Inv;
            }
        }

        if(s_dwGridPower < 80)
        {
            s_dwGridPower = 0;
        }
        if(s_dwGenPower < 80)
        {
            s_dwGenPower = 0;
        }
    }

    //2、功率折算
    //需求功率
    s_dwRequiredPower = s_dwOPWatt + s_dwSmartOPWatt + Get_Power(s_wBatPower);
// stateTest[4] = (int16)(s_dwRequiredPower);
    //供给功率
    s_dwSupplyPower = s_wPVPowerTotal + s_dwGridPower + s_dwGenPower + Get_Power((-s_wBatPower));
// stateTest[5] = (int16)(s_dwSupplyPower);
    if(s_dwRequiredPower > 50 && s_dwSupplyPower > 50)
    {
        s_wBalancePower = (s_dwSupplyPower - s_dwRequiredPower);
        //如果供给功率小于需求功率，增大供给功率，减小需求功率
        if(s_wBalancePower < 0)
        {
            s_wCorrectionFactor = -1;
        }
        //缩放校正
        s_wBalancePower = fabs(s_wBalancePower * 0.5f);
        //缩放系数计算
        // 误差 > 0, 供给功率减小，需求功率增大；误差 < 0, 供给功率增大，需求功率减小。
        s_dwRequiredPowerRatio = ((s_dwRequiredPower + s_wCorrectionFactor * s_wBalancePower) / s_dwRequiredPower);
        s_dwSupplyPowerRatio = ((s_dwSupplyPower - s_wCorrectionFactor * s_wBalancePower) / s_dwSupplyPower);
    }
    else
    {
        s_dwRequiredPowerRatio = 0;
        s_dwSupplyPowerRatio = 0;
    }
// stateTest[6] = (int16)(s_wBalancePower);
// stateTest[7] = (int16)(s_dwRequiredPowerRatio);
// stateTest[8] = (int16)(s_dwSupplyPowerRatio);
    //3、最终赋值
    //需求功率
    stPowerConver.fPLoad_Conver  = (s_dwOPWatt * s_dwRequiredPowerRatio);
    stPowerConver.fPSmtLoad_Conver = (s_dwSmartOPWatt * s_dwRequiredPowerRatio);

// stateTest[9] = (int16)(stPowerConver.fPLoad_Conver);
    //供给功率
    s_wPVPowerConversion        = (s_wPVPowerTotal * s_dwSupplyPowerRatio);
    stPowerConver.fPGrid_Conver = (s_dwGridPower * s_dwSupplyPowerRatio);
    stPowerConver.fPGen_Conver  = (s_dwGenPower * s_dwSupplyPowerRatio);

    //电池单独处理
    if(s_wBatPower >= 0)
    {
        stPowerConver.fPBat_Conver = (s_wBatPower * s_dwRequiredPowerRatio);
    }
    else
    {
        stPowerConver.fPBat_Conver = (s_wBatPower * s_dwSupplyPowerRatio);
    }

    //4、赋值结果额外处理
    //①、如果有供给功率<需求功率的情况，需求功率减小相应的部分(余数导致1~2w误差)
    s_dwRequiredPower = stPowerConver.fPLoad_Conver + stPowerConver.fPSmtLoad_Conver + Get_Power(stPowerConver.fPBat_Conver);

    s_dwSupplyPower = s_wPVPowerConversion + stPowerConver.fPGrid_Conver + stPowerConver.fPGen_Conver + Get_Power((-stPowerConver.fPBat_Conver));
    s_wBalancePower = s_dwSupplyPower - s_dwRequiredPower;

    // 更改输入输出都调整为只调整输入
    // if(s_wBalancePower < 0)
    // {
    //     if(stPowerConver.fPLoad_Conver > (-s_wBalancePower))
    //     {
    //         stPowerConver.fPLoad_Conver += s_wBalancePower;
    //     }
    //     else if(stPowerConver.fPSmtLoad_Conver > (-s_wBalancePower))
    //     {
    //         stPowerConver.fPSmtLoad_Conver += s_wBalancePower;
    //     }
    //     else if(stPowerConver.fPBat_Conver > 0 && stPowerConver.fPBat_Conver > (-s_wBalancePower))
    //     {
    //         stPowerConver.fPBat_Conver += s_wBalancePower;
    //     }
    // }

    //②、USB，市电/发电机功率被折算导致显示的是PV和市电一起带载
    // if(g_uwWorkMode == cLineMode && swGetEEOPPriority() == cOutputUtilityFirst)
    // {
    //     if(OnGridMode == g_SystemInfo.usSystemMode) //&& g_wBatPowerConversion >= 0)
    //     {
    //         s_dwAcPower = &stPowerConver.fPGrid_Conver;
    //         s_wBalancePower = stPowerConver.fPLoad_Conver + stPowerConver.fPSmtLoad_Conver - stPowerConver.fPGrid_Conver;
    //     }
    //     else if(OnGenMode == g_SystemInfo.usSystemMode)
    //     {
    //         s_dwAcPower = &stPowerConver.fPGen_Conver;
    //         s_wBalancePower = stPowerConver.fPLoad_Conver - stPowerConver.fPGen_Conver;
    //     }
    //
    //     if(s_wBalancePower > 0 && stPowerConver.fPBat_Conver >= 0 && s_wPVPowerConversion >= (s_wBalancePower + stPowerConver.fPBat_Conver))
    //     {
    //         *s_dwAcPower += s_wBalancePower; // 误差量叠加回电网功率或者油机功率中
    //         s_wPVPowerConversion -= s_wBalancePower;
    //         if(s_wPVPowerConversion <= 3)
    //         {
    //             s_wPVPowerConversion = 0;
    //         }
    //     }
    // }

    //③、PV1、PV2折算
    if((ePvLose != g_SystemInfo.Source.bit.Pv1) && (ePvLose != g_SystemInfo.Source.bit.Pv2))
    {
        stPowerConver.fPPv1_Conver = ((s_wPVPowerConversion * fP_Pv1) / s_wPVPowerTotal);
        stPowerConver.fPPv2_Conver = s_wPVPowerConversion - stPowerConver.fPPv1_Conver;
    }
    else if(ePvLose == g_SystemInfo.Source.bit.Pv1)
    {
        stPowerConver.fPPv1_Conver = 0;
        stPowerConver.fPPv2_Conver = s_wPVPowerConversion;
    }
    else
    {
        stPowerConver.fPPv1_Conver = s_wPVPowerConversion;
        stPowerConver.fPPv2_Conver = 0;
    }

    //-----------------------------
    // 5、折算电流
    if(stValue.fRmsReal.VGridA < 60 || stPowerConver.fPGrid_Conver == 0)
    { stPowerConver.fIGrid_Conver = 0; }
    else
    { stPowerConver.fIGrid_Conver = stPowerConver.fPGrid_Conver / stValue.fRmsReal.VGridA; }

    if(stValue.fRmsReal.VGenA < 60 || stPowerConver.fPGen_Conver == 0)
    { stPowerConver.fIGen_Conver = 0; }
    else
    { stPowerConver.fIGen_Conver = stPowerConver.fPGen_Conver / stValue.fRmsReal.VGenA; }

    if(stValue.fAveReal.VBat < 10 || stPowerConver.fPBat_Conver == 0)
    { stPowerConver.fIBat_Conver = 0; }
    else
    { stPowerConver.fIBat_Conver = stPowerConver.fPBat_Conver / stValue.fAveReal.VBat; }

    // if(stValue.fRmsReal.VOutA < 60 || stPowerConver.fPLoad_Conver == 0)
    // { stPowerConver.fILoad_Conver = 0; }
    // else
    // { stPowerConver.fILoad_Conver = stPowerConver.fPLoad_Conver / stValue.fRmsReal.VOutA; }

    // if(stValue.fRmsReal.VSmLoadA < 60 || stPowerConver.fPSmtLoad_Conver == 0)
    // { stPowerConver.fISmtLoad_Conver = 0; }
    // else
    // { stPowerConver.fISmtLoad_Conver = stPowerConver.fPSmtLoad_Conver / stValue.fRmsReal.VSmLoadA; }

    if(strSlvAnalog.fVoltPv1 < 60 || stPowerConver.fPPv1_Conver == 0)
    { stPowerConver.fIPv1_Conver = 0; }
    else
    { stPowerConver.fIPv1_Conver = stPowerConver.fPPv1_Conver / strSlvAnalog.fVoltPv1; }

    if(strSlvAnalog.fVoltPv2 < 60 || stPowerConver.fPPv2_Conver == 0)
    { stPowerConver.fIPv2_Conver = 0; }
    else
    { stPowerConver.fIPv2_Conver = stPowerConver.fPPv2_Conver / strSlvAnalog.fVoltPv2; }
}
#endif // MonitorProtocol_C
//===========================================================================
// End of file.
//===========================================================================

